<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache MailiSrgBceaoWriter est une extension de BinFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer et envoyer des fichiers Maili sous-r&eacute;gionaux vers la BCEAO. Elle traite les ch&egrave;ques et effets en fonction de leur &eacute;tat et g&eacute;n&egrave;re des fichiers binaires contenant les images associ&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer des fichiers Maili sous-r&eacute;gionaux vers la BCEAO, incluant les images des ch&egrave;ques et effets.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les banques sous-r&eacute;gionales et leurs op&eacute;rations (ch&egrave;ques et effets) &agrave; traiter.</p><p>Pr&eacute;pare les fichiers binaires contenant les images des ch&egrave;ques et effets.</p><p>Met &agrave; jour l'&eacute;tat des op&eacute;rations apr&egrave;s traitement.</p><p><strong>M&eacute;thodes</strong></p><p><strong>MailiSrgBceaoWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi des fichiers Maili sous-r&eacute;gionaux.</p><p><strong>prepareCheques(List&lt;Cheques&gt; cheques, String banqueRemettante)</strong> : Pr&eacute;pare les ch&egrave;ques pour l'envoi en g&eacute;n&eacute;rant les fichiers binaires.</p><p><strong>prepareEffets(List&lt;Effets&gt; effets, String banqueRemettante)</strong> : Pr&eacute;pare les effets pour l'envoi en g&eacute;n&eacute;rant les fichiers binaires.</p><p><strong>updateEtatOperations()</strong> : Met &agrave; jour l'&eacute;tat des op&eacute;rations apr&egrave;s traitement.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEALLICOM1ACC</strong> : &Eacute;tat des op&eacute;rations &agrave; traiter pour ICOM1.</p><p><strong>CETAOPEALLICOM1ACCENVSIB</strong> : &Eacute;tat des op&eacute;rations &agrave; traiter pour ICOM1 envoy&eacute;es au SIB.</p><p><strong>CETAIMASTO</strong> : &Eacute;tat des images stock&eacute;es.</p><p><strong>CETAIMATRA</strong> : &Eacute;tat des images trait&eacute;es.</p><p><strong>CETAIMAENV</strong> : &Eacute;tat des images envoy&eacute;es.</p><p><strong>COMPENSATION_MANUELLE</strong> : Indicateur de compensation manuelle.</p><p><strong>GENMAILIPARBANQUE</strong> : Indicateur de g&eacute;n&eacute;ration de Maili par banque.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration ou de l'envoi des fichiers sont g&eacute;r&eacute;es par des logs et des mises &agrave; jour de param&egrave;tres.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types d'op&eacute;rations ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette tache utilise DataBaseJPA pour interagir avec la base de donn&eacute;es et r&eacute;cup&eacute;rer les op&eacute;rations &agrave; traiter.</p>