<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache CorporatesBICISReader est con&ccedil;ue pour lire et traiter les fichiers plats contenant des informations sur les remises et les ch&egrave;ques des clients corporatifs, en int&eacute;grant ces donn&eacute;es dans la base de donn&eacute;es et en g&eacute;rant le stockage des images associ&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers de remises dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit chaque ligne du fichier pour extraire les informations des remises et des ch&egrave;ques.</p><p>Cr&eacute;e des objets Remises et Cheques &agrave; partir des donn&eacute;es extraites.</p><p>Stocke les images des ch&egrave;ques dans le r&eacute;pertoire configur&eacute;.</p><p>Ins&egrave;re les remises et les ch&egrave;ques dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Les remises et les ch&egrave;ques sont int&eacute;gr&eacute;s et mis &agrave; jour dans la base de donn&eacute;es, et les images sont stock&eacute;es dans le r&eacute;pertoire appropri&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de traitement sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Utilise un BufferedReader pour lire chaque ligne du fichier et extraire les informations n&eacute;cessaires.</p><p><strong>Cr&eacute;ation d'Objets</strong> :</p><p>Utilise la m&eacute;thode getChamp pour extraire les champs des lignes et cr&eacute;er des objets Remises et Cheques.</p><p><strong>Stockage des Images</strong> :</p><p>Utilise FileUtils.copyFile pour copier les images des ch&egrave;ques dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Mise &agrave; Jour des Enregistrements</strong> :</p><p>Utilise DataBaseJPA pour ins&eacute;rer les remises et les ch&egrave;ques dans la base de donn&eacute;es.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>`IMG_ALLER_FOLDER`</strong> : Dossier de destination pour les images trait&eacute;es.</p><p><strong>`IMG_ALLER_CORP`</strong> : Dossier source pour les images des ch&egrave;ques.</p><p><strong>`VALIDATION_CORP_AUTO`</strong> : Indique si la validation automatique des remises est activ&eacute;e.</p><p><strong>Interactions avec la Base de Donn&eacute;es</strong></p><p><strong>Requ&ecirc;tes SQL</strong> : Utilise des requ&ecirc;tes SQL pour ins&eacute;rer les remises et les ch&egrave;ques dans la base de donn&eacute;es.</p><p><strong>Gestion des Transactions</strong> : Utilise DataBaseJPA pour g&eacute;rer les transactions de base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s et Valeurs Possibles</strong></p><p><strong>`CETAOPEVAL`</strong> :</p><p><strong>Utilisation</strong> : Code d'&eacute;tat pour les op&eacute;rations en attente de validation.</p><p><strong>Valeurs Possibles</strong> : Identifiants num&eacute;riques d&eacute;finis dans le syst&egrave;me.</p><p><strong>`CETAOPESUPVAL`</strong> :</p><p><strong>Utilisation</strong> : Code d'&eacute;tat pour les op&eacute;rations valid&eacute;es automatiquement.</p><p><strong>Valeurs Possibles</strong> : Identifiants num&eacute;riques d&eacute;finis dans le syst&egrave;me.</p>