<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache InitrNatWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer et envoyer des fichiers d'initialisation nationale (INITR) vers la BCEAO. Elle initialise la journ&eacute;e de compensation en cr&eacute;ant un fichier sp&eacute;cifique avec les informations n&eacute;cessaires.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer un fichier d'initialisation nationale vers la BCEAO pour d&eacute;marrer la journ&eacute;e de compensation.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les param&egrave;tres n&eacute;cessaires pour l'initialisation.</p><p>Cr&eacute;e un en-t&ecirc;te de remise avec les informations de l'&eacute;metteur, du r&eacute;cepteur, et d'autres d&eacute;tails.</p><p>G&eacute;n&egrave;re un fichier avec les informations d'initialisation et l'envoie &agrave; la BCEAO.</p><p><strong>M&eacute;thodes</strong></p><p><strong>InitrNatWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi du fichier d'initialisation nationale.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>VERSION_SICA</strong> : Version du syst&egrave;me SICA utilis&eacute;.</p><p><strong>INITR_NAT</strong> : Compteur pour les fichiers d'initialisation nationale.</p><p><strong>MONITOR_LINES</strong> : Nombre de lignes &agrave; conserver dans le journal des &eacute;v&eacute;nements.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration ou de l'envoi du fichier sont g&eacute;r&eacute;es par des logs et des messages d'erreur.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types d'initialisations ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette tache utilise DataBaseJPA pour interagir avec la base de donn&eacute;es et g&eacute;rer les param&egrave;tres de l'application.</p>