<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache Cro135T24OBAMoveForUpload est une extension de FlatFileWriter utilis&eacute;e pour d&eacute;placer des fichiers CRO 135 vers un r&eacute;pertoire de destination sp&eacute;cifique pour le syst&egrave;me T24. Elle assure la gestion des fichiers en les d&eacute;pla&ccedil;ant et en les sauvegardant si n&eacute;cessaire.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.temenos</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : D&eacute;placer les fichiers CRO 135 vers un r&eacute;pertoire de destination pour le syst&egrave;me T24.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les fichiers CRO 135 &agrave; partir d'un r&eacute;pertoire source.</p><p>D&eacute;place les fichiers vers un r&eacute;pertoire de destination.</p><p>Sauvegarde les fichiers existants avant de les &eacute;craser.</p><p>Supprime les fichiers sources apr&egrave;s le d&eacute;placement.</p><p><strong>M&eacute;thodes</strong></p><p><strong>Cro135T24OBAMoveForUpload()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'op&eacute;ration.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de d&eacute;placement des fichiers CRO 135.</p><p><strong>moveAndOverwrite(File source, File dest)</strong> : D&eacute;place un fichier source vers une destination, en sauvegardant le fichier de destination s'il existe d&eacute;j&agrave;.</p><p><strong>getNonExistingTempFile(File inputFile)</strong> : G&eacute;n&egrave;re un nom de fichier temporaire qui n'existe pas dans le m&ecirc;me r&eacute;pertoire que le fichier d'entr&eacute;e.</p><p><strong>end()</strong> : Termine le processus en enregistrant un &eacute;v&eacute;nement de log.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>SIB_IN_FOLDER</strong> : Param&egrave;tre indiquant le r&eacute;pertoire source des fichiers CRA.</p><p><strong>DEST_CRA_FOLDER</strong> : Param&egrave;tre indiquant le r&eacute;pertoire de destination pour les fichiers CRO.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors du d&eacute;placement ou de la suppression des fichiers sont g&eacute;r&eacute;es par des logs.</p><p><strong>Extensibilit&eacute;</strong> : La classe peut &ecirc;tre &eacute;tendue pour inclure d'autres types de fichiers ou pour int&eacute;grer d'autres syst&egrave;mes de gestion de fichiers.</p><p><strong>Utilisation de la Biblioth&egrave;que Apache Commons IO</strong> : La classe utilise FileUtils de la biblioth&egrave;que Apache Commons IO pour la manipulation des fichiers.</p>