<p><strong>Fiche Technique : EffetAcceptationAmpUpReader</strong></p><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache EffetAcceptationAmpUpReader est con&ccedil;ue pour lire et traiter les fichiers contenant des informations sur les effets accept&eacute;s, en mettant &agrave; jour les enregistrements dans la base de donn&eacute;es en fonction des donn&eacute;es lues.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers d'effets dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit chaque ligne du fichier pour extraire les informations des effets.</p><p>Cr&eacute;e des objets Bkefr &agrave; partir des lignes lues.</p><p>Met &agrave; jour les enregistrements d'effets dans la base de donn&eacute;es si les conditions sont remplies.</p><p><strong>R&eacute;sultat</strong> : Les enregistrements d'effets sont mis &agrave; jour dans la base de donn&eacute;es selon les informations fournies dans le fichier.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de traitement sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Utilise un BufferedReader pour lire chaque ligne du fichier et extraire les informations n&eacute;cessaires.</p><p><strong>Cr&eacute;ation d'Objets</strong> :</p><p>Utilise la m&eacute;thode createBkefrFromLine pour transformer chaque ligne du fichier en un objet Bkefr.</p><p>Utilise des expressions r&eacute;guli&egrave;res pour diviser les lignes en attributs.</p><p><strong>Mise &agrave; Jour des Effets</strong> :</p><p>Recherche les enregistrements d'effets existants dans la base de donn&eacute;es &agrave; l'aide de DataBaseJPA.</p><p>Met &agrave; jour les attributs des effets si les conditions sont remplies.</p><p>Met &agrave; jour l'&eacute;tat des effets si n&eacute;cessaire.</p><p><strong>Gestion des Erreurs</strong> : Consigne les erreurs de validation et de traitement dans les journaux.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>S&eacute;parateur de Ligne</strong> : Utilise le caract&egrave;re | pour diviser les lignes en attributs.</p><p><strong>Interactions avec la Base de Donn&eacute;es</strong></p><p><strong>Requ&ecirc;tes SQL</strong> : Utilise des requ&ecirc;tes JPQL pour r&eacute;cup&eacute;rer et mettre &agrave; jour les enregistrements d'effets et de comptes.</p><p><strong>Gestion des Transactions</strong> : Utilise DataBaseJPA pour g&eacute;rer les transactions de base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>`CETAOPEVAL2`</strong> : Param&egrave;tre utilis&eacute; pour v&eacute;rifier l'&eacute;tat actuel des effets. Il est r&eacute;cup&eacute;r&eacute; via Utility.getParam(&quot;CETAOPEVAL2&quot;) et repr&eacute;sente un &eacute;tat sp&eacute;cifique des effets dans le syst&egrave;me.</p><p><strong>`CETAOPEVALDELTA`</strong> : Param&egrave;tre utilis&eacute; pour mettre &agrave; jour l'&eacute;tat des effets. Il est r&eacute;cup&eacute;r&eacute; via Utility.getParam(&quot;CETAOPEVALDELTA&quot;) et repr&eacute;sente le nouvel &eacute;tat &agrave; appliquer aux effets apr&egrave;s traitement.</p><p><strong>Valeurs Possibles des Param&egrave;tres</strong></p><p><strong>`CETAOPEVAL2`</strong> et <strong>`CETAOPEVALDELTA`</strong> : Ces param&egrave;tres sont g&eacute;n&eacute;ralement des identifiants num&eacute;riques ou des codes sp&eacute;cifiques d&eacute;finis dans le syst&egrave;me pour repr&eacute;senter diff&eacute;rents &eacute;tats des effets. Les valeurs exactes d&eacute;pendent de la configuration du syst&egrave;me et des besoins m&eacute;tier.</p><p>Cette fiche technique inclut les fonctionnalit&eacute;s principales de la classe EffetAcceptationAmpUpReader, en mettant l'accent sur le processus de lecture, de cr&eacute;ation d'objets, de mise &agrave; jour des enregistrements dans la base de donn&eacute;es, et l'utilisation des param&egrave;tres de configuration.</p>