<p><strong>ICRCheckWithoutSlipSaveReader</strong></p><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ICRCheckWithoutSlipSaveReader est con&ccedil;ue pour lire, traiter et sauvegarder les fichiers de ch&egrave;ques scann&eacute;s sans bordereau, en int&eacute;grant les informations dans le syst&egrave;me et en appliquant des v&eacute;rifications de conformit&eacute;.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers de ch&egrave;ques scann&eacute;s dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> : V&eacute;rifie les donn&eacute;es des fichiers scann&eacute;s, traite les images des ch&egrave;ques, applique des tatouages num&eacute;riques, et met &agrave; jour les informations dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Mise &agrave; jour des statuts des ch&egrave;ques et des s&eacute;quences dans la base de donn&eacute;es, avec les images des ch&egrave;ques d&eacute;plac&eacute;es vers le r&eacute;pertoire appropri&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Fichiers</strong> : Assure la lecture, la validation, et le d&eacute;placement des fichiers de ch&egrave;ques scann&eacute;s.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Met &agrave; jour les statuts des ch&egrave;ques et des s&eacute;quences.</p><p><strong>Traitement d'Images</strong> : Redimensionne, tatoue et d&eacute;place les images des ch&egrave;ques.</p><p><strong>V&eacute;rification ICR</strong> : Int&egrave;gre les services ICR pour la reconnaissance des caract&egrave;res et la validation des informations de ch&egrave;que.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>LINE_SCORE_PARAM</strong> : Param&egrave;tre de score de ligne utilis&eacute; pour la validation.</p><p><strong>IMG_ALLER_FOLDER</strong> : R&eacute;pertoire de destination pour les images trait&eacute;es.</p><p><strong>CODE_SICA2</strong> et <strong>CODE_SICA3</strong> : Param&egrave;tres pour la conversion des codes num&eacute;riques en codes alphanum&eacute;riques.</p><p><strong>ICR_ACTIVATED</strong> : Indique si le service ICR est activ&eacute;.</p><p><strong>ICR_VERSION</strong> : Version du service ICR utilis&eacute;.</p><p><strong>Exemples d'Utilisation</strong></p><p>Utilis&eacute;e pour valider, traiter et sauvegarder les ch&egrave;ques scann&eacute;s sans bordereau dans un environnement bancaire.</p><p><strong>Int&eacute;gration avec d'autres Syst&egrave;mes</strong></p><p>Int&eacute;gr&eacute;e avec le syst&egrave;me de gestion des ch&egrave;ques, le service ICR pour la reconnaissance des caract&egrave;res, et les services de tatouage num&eacute;rique.</p>