<p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache AmplitudeLot035SaveReader est utilis&eacute;e pour lire et traiter les fichiers de lots d'amplitude, en particulier pour sauvegarder les informations de ch&egrave;ques et g&eacute;rer les images associ&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.ampup</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers de lots d'amplitude dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit les lignes du fichier pour extraire les informations de ch&egrave;ques, telles que les en-t&ecirc;tes de lot et les op&eacute;rations.</p><p>V&eacute;rifie l'existence des ch&egrave;ques dans la base de donn&eacute;es pour &eacute;viter les doublons.</p><p>Ins&egrave;re de nouveaux ch&egrave;ques et met &agrave; jour les informations existantes.</p><p>G&egrave;re les images associ&eacute;es aux ch&egrave;ques en les d&eacute;pla&ccedil;ant vers le r&eacute;pertoire appropri&eacute;.</p><p><strong>R&eacute;sultat</strong> : Les informations extraites sont ins&eacute;r&eacute;es dans la base de donn&eacute;es, mettant &agrave; jour les tables de ch&egrave;ques et de remises. Les images des ch&egrave;ques sont d&eacute;plac&eacute;es vers le r&eacute;pertoire appropri&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Assure la lecture et le traitement des lignes du fichier de lots d'amplitude.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> :</p><p>Ins&egrave;re et met &agrave; jour les informations de ch&egrave;ques et de remises dans la base de donn&eacute;es.</p><p>Utilise ComptesClient pour r&eacute;cup&eacute;rer des informations de compte.</p><p><strong>Gestion des Images</strong> :</p><p>D&eacute;place les images des ch&egrave;ques vers le r&eacute;pertoire appropri&eacute; et met &agrave; jour les chemins d'acc&egrave;s dans la base de donn&eacute;es.</p><p>V&eacute;rifie l'existence des fichiers d'image avant de les copier.</p><p><strong>V&eacute;rification de Conformit&eacute;</strong> : V&eacute;rifie si les ch&egrave;ques ont d&eacute;j&agrave; &eacute;t&eacute; trait&eacute;s pour &eacute;viter les doublons.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>FILE_PATH_IMG_JPG</strong> : Chemin d'acc&egrave;s pour les images JPEG des ch&egrave;ques, avec comme valeur par d&eacute;faut: <strong>/data/amplitude/images_jpg/</strong>.</p><p><strong>IMG_ALLER_FOLDER</strong> : R&eacute;pertoire de destination pour les images trait&eacute;es, avec comme valeur par d&eacute;faut: <strong>/data/amplitude/images_traitees/</strong>.</p><p><strong>DATE_FOLDER_IMG_JPG</strong> : Indicateur pour inclure la date dans le chemin d'acc&egrave;s des images. Valeurs possibles : &quot;OUI&quot; pour inclure la date, &quot;NON&quot; pour ne pas l'inclure.</p>