<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache SmartSFTPDownloader est responsable du t&eacute;l&eacute;chargement de fichiers &agrave; partir d'un serveur SFTP. Elle g&egrave;re la connexion, le t&eacute;l&eacute;chargement, et la suppression des fichiers distants apr&egrave;s leur transfert.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : La m&eacute;thode execute() est appel&eacute;e pour initier le processus de t&eacute;l&eacute;chargement.</p><p><strong>Traitement</strong> : &Eacute;tablit une connexion SFTP, t&eacute;l&eacute;charge les fichiers du r&eacute;pertoire sp&eacute;cifi&eacute;, et les enregistre localement. Les fichiers t&eacute;l&eacute;charg&eacute;s sont ensuite supprim&eacute;s du serveur SFTP.</p><p><strong>R&eacute;sultat</strong> : Les fichiers sont t&eacute;l&eacute;charg&eacute;s avec succ&egrave;s et enregistr&eacute;s dans le r&eacute;pertoire local sp&eacute;cifi&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de connexion ou de transfert sont consign&eacute;es dans les journaux, et des messages d'erreur sont affich&eacute;s.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Connexion SFTP</strong> : &Eacute;tablit une connexion s&eacute;curis&eacute;e au serveur SFTP en utilisant un mot de passe ou une cl&eacute; priv&eacute;e.</p><p><strong>T&eacute;l&eacute;chargement de Fichiers</strong> : T&eacute;l&eacute;charge les fichiers du r&eacute;pertoire distant sp&eacute;cifi&eacute; et les enregistre localement.</p><p><strong>Suppression de Fichiers</strong> : Supprime les fichiers du serveur SFTP apr&egrave;s leur t&eacute;l&eacute;chargement r&eacute;ussi.</p><p><strong>Gestion des Erreurs</strong> : G&egrave;re les erreurs de connexion et de transfert, en les consignant dans les journaux.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>SFTPHOST</strong> : Adresse du serveur SFTP, obtenue dynamiquement &agrave; partir de l'identifiant du r&eacute;pertoire.</p><p><strong>SFTPPORT</strong> : Port du serveur SFTP, avec une valeur par d&eacute;faut de <strong>22</strong>.</p><p><strong>SFTPUSER</strong> : Nom d'utilisateur pour la connexion SFTP, obtenu dynamiquement.</p><p><strong>SFTPPASS</strong> : Mot de passe pour la connexion SFTP, obtenu dynamiquement.</p><p><strong>privateKeyPath</strong> : Chemin vers la cl&eacute; priv&eacute;e pour l'authentification par cl&eacute;, avec une valeur par d&eacute;faut <strong>etc/ssh/id</strong>.</p><p><strong>TIME_ALIVE_SFTP</strong> : Intervalle de temps pour garder la connexion SFTP active, avec une valeur par d&eacute;faut de <strong>300000ms</strong>.</p><p><strong>preferredAuthentications</strong> : M&eacute;thode d'authentification pr&eacute;f&eacute;r&eacute;e (mot de passe ou cl&eacute;), avec une valeur par d&eacute;faut <strong>password</strong>.</p><p><strong>SFTPHEARTBEAT</strong> : Intervalle de temps en millisecondes entre les cycles de t&eacute;l&eacute;chargement pour permettre &agrave; la connexion de rester active, avec une valeur par d&eacute;faut de <strong>500000ms</strong>.</p><p><strong>Exemples d'Utilisation</strong></p><p>Utilis&eacute;e pour automatiser le t&eacute;l&eacute;chargement de fichiers &agrave; partir de serveurs SFTP dans un environnement d'entreprise.</p><p><strong>Int&eacute;gration avec d'autres Syst&egrave;mes</strong></p><p>Int&eacute;gr&eacute;e avec les syst&egrave;mes de gestion de fichiers pour assurer un transfert s&eacute;curis&eacute; et fiable des fichiers.</p>