<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache DeprecatedMailiIntReader est con&ccedil;ue pour lire et traiter les fichiers binaires contenant des informations sur les remises de ch&egrave;ques et d'effets, en int&eacute;grant ces donn&eacute;es dans la base de donn&eacute;es et en g&eacute;rant le stockage des images associ&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers de remises dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit les en-t&ecirc;tes et les index d'images des fichiers binaires.</p><p>Ins&egrave;re les informations des remises et des ch&egrave;ques/effets dans la base de donn&eacute;es.</p><p>Stocke les images des ch&egrave;ques/effets dans le r&eacute;pertoire configur&eacute;.</p><p>G&egrave;re les doublons de ch&egrave;ques en les enregistrant dans une table d&eacute;di&eacute;e.</p><p><strong>R&eacute;sultat</strong> : Les remises et les ch&egrave;ques/effets sont int&eacute;gr&eacute;s et mis &agrave; jour dans la base de donn&eacute;es, et les images sont stock&eacute;es dans le r&eacute;pertoire appropri&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de traitement sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Utilise BufferedInputStream pour lire les fichiers binaires.</p><p><strong>Cr&eacute;ation d'Objets</strong> :</p><p>Utilise des m&eacute;thodes pour extraire les champs des en-t&ecirc;tes et des index d'images et cr&eacute;er des objets Remises, Cheques, et Effets.</p><p><strong>Stockage des Images</strong> :</p><p>Utilise BufferedOutputStream et ImageIO pour &eacute;crire les images des ch&egrave;ques/effets dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Mise &agrave; Jour des Enregistrements</strong> :</p><p>Utilise DataBaseJPA pour ins&eacute;rer les remises et les ch&egrave;ques/effets dans la base de donn&eacute;es.</p><p>G&egrave;re les doublons de ch&egrave;ques en les enregistrant dans une table d&eacute;di&eacute;e.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>`IMG_ALLER_FOLDER`</strong> : Dossier de destination pour les images trait&eacute;es.</p><p><strong>`CORPORATE_OFFLINE`</strong> : Indique si le mode hors ligne est activ&eacute; pour les corporates.</p><p><strong>`TATOO_PICTURE`</strong> : Indique si les images doivent &ecirc;tre tatou&eacute;es avec des informations suppl&eacute;mentaires.</p><p><strong>Interactions avec la Base de Donn&eacute;es</strong></p><p><strong>Requ&ecirc;tes SQL</strong> : Utilise des requ&ecirc;tes SQL pour ins&eacute;rer et mettre &agrave; jour les remises et les ch&egrave;ques/effets dans la base de donn&eacute;es.</p><p><strong>Gestion des Transactions</strong> : Utilise DataBaseJPA pour g&eacute;rer les transactions de base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s et Valeurs Possibles</strong></p><p><strong>`CETAOPEVAL`</strong> :</p><p><strong>Utilisation</strong> : Code d'&eacute;tat pour les op&eacute;rations en attente de validation.</p><p><strong>Valeurs Possibles</strong> : Identifiants num&eacute;riques d&eacute;finis dans le syst&egrave;me.</p><p><strong>`CETAOPEVAL2`</strong> :</p><p><strong>Utilisation</strong> : Code d'&eacute;tat pour les op&eacute;rations valid&eacute;es.</p><p><strong>Valeurs Possibles</strong> : Identifiants num&eacute;riques d&eacute;finis dans le syst&egrave;me.</p>