<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ChequesRetourSenderWriter est une extension de BrmWriter utilis&eacute;e pour g&eacute;rer l'envoi des ch&egrave;ques de retour vers le service de comptabilit&eacute; pour v&eacute;rification de signature. Elle r&eacute;cup&egrave;re les ch&egrave;ques &agrave; traiter, met &agrave; jour leur &eacute;tat, et envoie des notifications par email.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.baobab_uap</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;rer l'envoi des ch&egrave;ques de retour vers le service de comptabilit&eacute; pour v&eacute;rification de signature.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les ch&egrave;ques &agrave; l'&eacute;tat de retour &agrave; traiter.</p><p>Met &agrave; jour l'&eacute;tat des ch&egrave;ques apr&egrave;s traitement.</p><p>Envoie des notifications par email concernant les ch&egrave;ques trait&eacute;s.</p><p><strong>M&eacute;thodes</strong></p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des ch&egrave;ques de retour, en r&eacute;cup&eacute;rant les ch&egrave;ques &agrave; traiter, en mettant &agrave; jour leur &eacute;tat, et en envoyant des notifications par email.</p><p><strong>fetchChequesRetour()</strong> : R&eacute;cup&egrave;re la liste des ch&egrave;ques &agrave; l'&eacute;tat de retour &agrave; traiter depuis la base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPERETREC</strong> : Param&egrave;tre utilis&eacute; pour identifier l'&eacute;tat des ch&egrave;ques de retour &agrave; traiter.</p><p><strong>CETAOPERETRECENVSIB</strong> : Param&egrave;tre utilis&eacute; pour mettre &agrave; jour l'&eacute;tat des ch&egrave;ques apr&egrave;s traitement.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors du traitement des ch&egrave;ques et de l'envoi des emails sont enregistr&eacute;es dans les logs.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de v&eacute;rifications ou de notifications si n&eacute;cessaire.</p><p><strong>Configuration</strong> : La classe utilise des composants configurables pour le traitement des ch&egrave;ques et l'envoi des emails, permettant une adaptation facile aux besoins sp&eacute;cifiques du syst&egrave;me.</p><p><strong>Notifications</strong> : La classe utilise JerseyEmailClient pour envoyer des notifications par email concernant les ch&egrave;ques trait&eacute;s.</p>