<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache IcomaMailSender est une extension de FlatFileWriter utilis&eacute;e pour envoyer des rapports d'acquisition par email. Elle g&eacute;n&egrave;re des fichiers Excel et PDF contenant des informations sur les transactions trait&eacute;es, et les envoie aux destinataires sp&eacute;cifi&eacute;s.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.sica.mail</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer des rapports d'acquisition par email.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les transactions depuis la base de donn&eacute;es en fonction de leur &eacute;tat.</p><p>G&eacute;n&egrave;re des fichiers Excel et PDF contenant les informations des transactions.</p><p>Envoie les fichiers g&eacute;n&eacute;r&eacute;s par email aux destinataires sp&eacute;cifi&eacute;s.</p><p><strong>M&eacute;thodes</strong></p><p><strong>IcomaMailSender()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'op&eacute;ration.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi des rapports d'acquisition.</p><p><strong>createFile(String path, String ordre, byte[] theBytes)</strong> : Cr&eacute;e un fichier &agrave; partir des donn&eacute;es fournies et le sauvegarde &agrave; l'emplacement sp&eacute;cifi&eacute;.</p><p><strong>generateExcel(ResultSet rs, String sheetName)</strong> : G&eacute;n&egrave;re un fichier Excel &agrave; partir d'un ResultSet et retourne les donn&eacute;es sous forme de tableau d'octets.</p><p><strong>createPdfFile(ResultSet resultSet, String startRapportName, String nomRapport, String dateCompensation)</strong> : G&eacute;n&egrave;re un fichier PDF &agrave; partir d'un ResultSet et retourne le nom du fichier cr&eacute;&eacute;.</p><p><strong>getRemcom()</strong> : Retourne l'objet Remcom associ&eacute;.</p><p><strong>setRemcom(Remcom remcom)</strong> : D&eacute;finit l'objet Remcom associ&eacute;.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>TEMPLATE_ICOMA_REJET</strong> : Chemin du mod&egrave;le d'email pour les rejets.</p><p><strong>TEMPLATE_ICOMA_ACCEPTE</strong> : Chemin du mod&egrave;le d'email pour les acceptations.</p><p><strong>EMAILS_DEST_OPS</strong> : Liste des destinataires des emails.</p><p><strong>SEND_PDF_REPORT</strong> : Indicateur pour envoyer ou non le rapport PDF.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des fichiers ou de l'envoi des emails sont g&eacute;r&eacute;es par des logs et des messages d'erreur.</p><p><strong>Extensibilit&eacute;</strong> : La classe peut &ecirc;tre &eacute;tendue pour inclure d'autres types de transactions ou formats de rapport.</p><p><strong>Utilisation de la Biblioth&egrave;que Apache POI</strong> : La classe utilise Apache POI pour la g&eacute;n&eacute;ration des fichiers Excel.</p>