<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ReportingOrdersCorporates est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer des rapports sur les ordres de paiement des entreprises. Elle g&eacute;n&egrave;re des rapports pour les ch&egrave;ques et effets pay&eacute;s, rejet&eacute;s, et pr&eacute;sent&eacute;s, et envoie ces rapports par email aux &eacute;tablissements concern&eacute;s.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer des rapports sur les ordres de paiement des entreprises, incluant les ch&egrave;ques et effets pay&eacute;s, rejet&eacute;s, et pr&eacute;sent&eacute;s.</p><p><strong>Traitement</strong> :</p><p>G&eacute;n&egrave;re des rapports PDF pour les ch&egrave;ques et effets pay&eacute;s, rejet&eacute;s, et pr&eacute;sent&eacute;s.</p><p>Envoie les rapports par email aux &eacute;tablissements concern&eacute;s.</p><p>Utilise des services externes pour r&eacute;cup&eacute;rer des informations sur les &eacute;tablissements et envoyer des emails.</p><p><strong>M&eacute;thodes</strong></p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi des rapports, en appelant les m&eacute;thodes sp&eacute;cifiques pour chaque type de rapport.</p><p><strong>genChequesPayesReport()</strong> : G&eacute;n&egrave;re et envoie le rapport des ch&egrave;ques pay&eacute;s.</p><p><strong>genChequesRejReport()</strong> : G&eacute;n&egrave;re et envoie le rapport des ch&egrave;ques rejet&eacute;s.</p><p><strong>genEffetsPayesReport()</strong> : G&eacute;n&egrave;re et envoie le rapport des effets pay&eacute;s.</p><p><strong>genEffetsRejReport()</strong> : G&eacute;n&egrave;re et envoie le rapport des effets rejet&eacute;s.</p><p><strong>genChequesAmplitudeReport()</strong> : G&eacute;n&egrave;re et envoie le rapport des ch&egrave;ques int&eacute;gr&eacute;s dans Amplitude.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>RAPPORT_AVEC_CORE_BANKING</strong> : Indique si le rapport doit &ecirc;tre g&eacute;n&eacute;r&eacute; avec des donn&eacute;es du core banking.</p><p><strong>CETAOPEALLICOM1ACC</strong> : Param&egrave;tre utilis&eacute; pour identifier les comptes &agrave; inclure dans le rapport des ch&egrave;ques pay&eacute;s.</p><p><strong>CETAOPEREJRETENVSIB</strong> : Param&egrave;tre utilis&eacute; pour identifier les comptes &agrave; inclure dans le rapport des ch&egrave;ques rejet&eacute;s.</p><p><strong>EMAIL_TEMPLATES_FOLDER</strong> : R&eacute;pertoire contenant les mod&egrave;les d'email pour l'envoi des rapports.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des rapports et de l'envoi des emails sont enregistr&eacute;es dans les logs.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de rapports ou de formats de fichiers si n&eacute;cessaire.</p><p><strong>Configuration</strong> : La classe utilise des composants configurables pour le traitement des rapports et l'envoi des emails, permettant une adaptation facile aux besoins sp&eacute;cifiques du syst&egrave;me.</p><p><strong>Rapports PDF</strong> : Les rapports g&eacute;n&eacute;r&eacute;s sont au format PDF et contiennent les d&eacute;tails des ch&egrave;ques et effets, y compris le nombre total et le montant total, et sont envoy&eacute;s par email aux &eacute;tablissements concern&eacute;s.</p>