<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache SmartZIPSynFileReader est une extension de FlatFileReader utilis&eacute;e pour traiter les fichiers ZIP synchronis&eacute;s. Elle g&egrave;re l'extraction des fichiers contenus dans les archives ZIP et leur traitement ult&eacute;rieur.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers ZIP dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> : Extrait les fichiers contenus dans l'archive ZIP, puis traite chaque fichier extrait en utilisant un lecteur de fichiers sp&eacute;cifique.</p><p><strong>R&eacute;sultat</strong> : Les fichiers extraits sont trait&eacute;s et les archives ZIP peuvent &ecirc;tre sauvegard&eacute;es ou supprim&eacute;es selon la configuration.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Fichiers ZIP</strong> : Assure l'extraction des fichiers contenus dans les archives ZIP.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Met &agrave; jour les informations pertinentes apr&egrave;s le traitement des fichiers extraits.</p><p><strong>Traitement des Fichiers Extraits</strong> : Utilise SmartImageChequeSynReader pour traiter les fichiers extraits.</p><p><strong>V&eacute;rification de Conformit&eacute;</strong> : V&eacute;rifie si les fichiers ZIP ont d&eacute;j&agrave; &eacute;t&eacute; trait&eacute;s pour &eacute;viter les doublons.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>SAVEZIPFILE</strong> : Indicateur pour sauvegarder ou supprimer les fichiers ZIP apr&egrave;s traitement.</p><p><strong>workFolder</strong> : R&eacute;pertoire de travail temporaire pour l'extraction des fichiers.</p><p><strong>zipFolder</strong> : R&eacute;pertoire de sauvegarde pour les fichiers ZIP trait&eacute;s.</p>