<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache FichiersRetoursBIAOWriter est une extension de FlatFileWriter utilis&eacute;e pour orchestrer l'envoi des fichiers de retour vers le SIB (Syst&egrave;me d'Information Bancaire) et SIGN. Elle ex&eacute;cute plusieurs processus d'&eacute;criture pour diff&eacute;rents types de fichiers de retour.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.orion</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Coordonner l'envoi des fichiers de retour vers le SIB et SIGN en ex&eacute;cutant plusieurs &eacute;crivains de fichiers de retour.</p><p><strong>Traitement</strong> :</p><p>Ex&eacute;cute une s&eacute;rie de classes d'&eacute;criture de fichiers de retour, chacune responsable d'un type sp&eacute;cifique de fichier de retour.</p><p><strong>M&eacute;thodes</strong></p><p><strong>FichiersRetoursBIAOWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des fichiers de retour en appelant les m&eacute;thodes execute() de plusieurs classes d'&eacute;criture de fichiers de retour.</p><p><strong>Classes d'&Eacute;criture de Fichiers de Retour Ex&eacute;cut&eacute;es</strong></p><p><strong>ChequeRetourSignWriter</strong> : G&egrave;re l'envoi des ch&egrave;ques retour vers SIGN.</p><p><strong>ChequeRetourEISSitWriter</strong> : G&egrave;re l'envoi des ch&egrave;ques retour vers EIS.</p><p><strong>EffetRetourSitWriter</strong> : G&egrave;re l'envoi des effets retour vers le SIB.</p><p><strong>VirementRetourSitWriter</strong> : G&egrave;re l'envoi des virements retour vers le SIB.</p><p><strong>ChequeRejeteSitWriter</strong> : G&egrave;re l'envoi des ch&egrave;ques rejet&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types de fichiers de retour ou pour modifier l'ordre d'ex&eacute;cution des &eacute;crivains de fichiers.</p><p><strong>Int&eacute;gration</strong> : Cette tache sert de point central pour l'ex&eacute;cution coordonn&eacute;e des processus d'&eacute;criture de fichiers de retour, facilitant ainsi la gestion des envois vers le SIB et SIGN.</p>