<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache RemiseDGIReader est utilis&eacute;e pour lire et traiter les fichiers de remises DGI, en extrayant les informations des ordres de paiement et en les enregistrant dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.bni</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers de remises DGI dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit chaque ligne du fichier pour extraire les informations des ordres de paiement.</p><p>V&eacute;rifie la coh&eacute;rence des montants totaux des ch&egrave;ques avec le montant global renseign&eacute;.</p><p>Enregistre les informations des ordres de paiement dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Les ordres de paiement sont ins&eacute;r&eacute;s dans la base de donn&eacute;es, avec v&eacute;rification de la coh&eacute;rence des donn&eacute;es.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de coh&eacute;rence des montants ou d'en-t&ecirc;te manquante sont consign&eacute;es dans les journaux et le traitement du fichier est interrompu.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Utilise un Scanner pour lire chaque ligne du fichier et extraire les informations n&eacute;cessaires.</p><p><strong>V&eacute;rification de Conformit&eacute;</strong> : V&eacute;rifie que le montant total des ch&egrave;ques correspond au montant global renseign&eacute; dans le fichier.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Enregistre chaque ordre de paiement dans la base de donn&eacute;es en utilisant DataBaseJPA.</p><p><strong>Gestion des Erreurs</strong> : Consigne les erreurs de coh&eacute;rence des montants et d'en-t&ecirc;te manquante dans les journaux.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>Formats de Date</strong> : Utilise SimpleDateFormat pour formater les dates d'&eacute;mission et comptables des ordres de paiement.</p><p>Cette fiche technique inclut les fonctionnalit&eacute;s principales de la classe RemiseDGIReader, en mettant l'accent sur le processus de lecture, de v&eacute;rification et d'enregistrement des ordres de paiement.</p>