<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache AmplitudeTransfertApiClient est un client API REST utilis&eacute; pour interagir avec le service Amplitude pour effectuer des transferts. Elle g&egrave;re la cr&eacute;ation et l'envoi de requ&ecirc;tes de transfert, ainsi que le traitement des r&eacute;ponses et des erreurs.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates.sfd.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Fournir une interface pour interagir avec l'API Amplitude pour les op&eacute;rations de transfert.</p><p><strong>Traitement</strong> :</p><p>Configure un client REST pour communiquer avec l'API Amplitude.</p><p>Envoie des requ&ecirc;tes de transfert et traite les r&eacute;ponses.</p><p>G&egrave;re les erreurs et les exceptions lors des appels API.</p><p><strong>Attributs</strong></p><p><strong>dataBaseJPA</strong> : DataBaseJPA - Instance pour l'acc&egrave;s &agrave; la base de donn&eacute;es.</p><p><strong>LOG</strong> : Logger - Logger pour enregistrer les informations et les erreurs.</p><p><strong>createTransactions</strong> : WebTarget - Cible pour la cr&eacute;ation de transactions.</p><p><strong>transfertEntries</strong> : WebTarget - Cible pour les entr&eacute;es de transfert.</p><p><strong>client</strong> : Client - Client REST pour effectuer les appels API.</p><p><strong>BASE_URI</strong> : String - URI de base pour l'API Amplitude, r&eacute;cup&eacute;r&eacute; &agrave; partir des param&egrave;tres de configuration.</p><p><strong>M&eacute;thodes</strong></p><p><strong>AmplitudeTransfertApiClient()</strong> : Constructeur qui initialise le client REST et configure les cibles API.</p><p><strong>createTransfers(TransferApiAmplitudeRequest transferToApis, String apiKey, String etabPartenaire, String codeProduit)</strong> : Envoie une requ&ecirc;te de transfert &agrave; l'API Amplitude et retourne la r&eacute;ponse.</p><p><strong>returnMapper()</strong> : Retourne un ObjectMapper configur&eacute; pour la s&eacute;rialisation/d&eacute;s&eacute;rialisation JSON.</p><p><strong>close()</strong> : Ferme le client REST pour lib&eacute;rer les ressources.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>AMPLITUDE_API_URI</strong> : URI de base pour l'API Amplitude, utilis&eacute; pour configurer le client REST.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : La classe g&egrave;re diverses exceptions li&eacute;es aux appels API, en enregistrant les erreurs et en fournissant des messages d'erreur d&eacute;taill&eacute;s.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre extensible, permettant l'ajout de nouvelles fonctionnalit&eacute;s ou l'int&eacute;gration avec d'autres services API.</p><p><strong>S&eacute;curit&eacute;</strong> : Utilise un en-t&ecirc;te x-api-key pour l'authentification lors des appels API.</p>