<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache LotScanchequeWriter est une extension de FlatFileWriter utilis&eacute;e pour envoyer des lots de ch&egrave;ques scann&eacute;s vers le Syst&egrave;me d'Information Bancaire (SIB). Elle traite les ch&egrave;ques en attente, g&eacute;n&egrave;re un fichier plat contenant les d&eacute;tails des ch&egrave;ques, et copie les images associ&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.borne</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer un fichier contenant les informations des ch&egrave;ques scann&eacute;s vers le SIB.</p><p><strong>Traitement</strong> :</p><p>Met &agrave; jour l'&eacute;tat des ch&egrave;ques avec des montants nuls ou vides.</p><p>R&eacute;cup&egrave;re les ch&egrave;ques et remises en attente depuis la base de donn&eacute;es.</p><p>G&eacute;n&egrave;re un fichier plat pour chaque lot de ch&egrave;ques contenant les informations n&eacute;cessaires.</p><p>&Eacute;crit les informations des ch&egrave;ques dans le fichier g&eacute;n&eacute;r&eacute;.</p><p>Copie les images des ch&egrave;ques dans le r&eacute;pertoire appropri&eacute;.</p><p><strong>Attributs</strong></p><p><strong>db</strong> : DataBase - Instance pour l'acc&egrave;s &agrave; la base de donn&eacute;es.</p><p><strong>M&eacute;thodes</strong></p><p><strong>LotScanchequeWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description du processus.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi des fichiers de ch&egrave;ques scann&eacute;s vers le SIB.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEERR</strong> : &Eacute;tat d'erreur pour les ch&egrave;ques avec des montants nuls ou vides.</p><p><strong>CETAREMSAIIRIS</strong> : &Eacute;tat des remises en attente de traitement.</p><p><strong>CETAOPEALLICOM1</strong> : &Eacute;tat des ch&egrave;ques apr&egrave;s traitement r&eacute;ussi.</p><p><strong>CETAREMENVSIB</strong> : &Eacute;tat des remises apr&egrave;s envoi r&eacute;ussi.</p><p><strong>SIB_IN_FOLDER</strong> : R&eacute;pertoire de destination pour les fichiers g&eacute;n&eacute;r&eacute;s.</p><p><strong>CHQ_IN_FILE_ROOTNAME</strong> : Nom de base pour les fichiers de ch&egrave;ques.</p><p><strong>SIB_FILE_EXTENSION</strong> : Extension des fichiers de ch&egrave;ques.</p><p><strong>AGENCE_BORNE</strong> : Code de l'agence pour les bornes.</p><p><strong>DATECOMPENS_NAT</strong> : Date de compensation nationale.</p><p><strong>SCANCHEQUES_IMG_FOLDER</strong> : R&eacute;pertoire pour les images des ch&egrave;ques.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des fichiers et de la copie des images sont g&eacute;r&eacute;es par des logs.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre extensible, permettant l'ajout de nouvelles fonctionnalit&eacute;s ou l'int&eacute;gration avec d'autres syst&egrave;mes de traitement de ch&egrave;ques.</p><p><strong>Utilisation de la Base de Donn&eacute;es</strong> : Utilise DataBase et JDBCXmlReader pour g&eacute;rer les connexions et les op&eacute;rations sur la base de donn&eacute;es.</p>