<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache LotCorpReader est con&ccedil;ue pour lire et traiter les fichiers de lots d'op&eacute;rations bancaires, en extrayant les informations n&eacute;cessaires et en mettant &agrave; jour les enregistrements dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers de lots dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit chaque ligne du fichier pour extraire les informations des op&eacute;rations bancaires.</p><p>Cr&eacute;e des objets Operation &agrave; partir des lignes lues.</p><p>Met &agrave; jour les enregistrements de ch&egrave;ques, virements, effets, et pr&eacute;l&egrave;vements dans la base de donn&eacute;es si les conditions sont remplies.</p><p><strong>R&eacute;sultat</strong> : Les enregistrements sont mis &agrave; jour dans la base de donn&eacute;es.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de traitement sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Utilise un BufferedReader pour lire chaque ligne du fichier et extraire les informations n&eacute;cessaires.</p><p><strong>Cr&eacute;ation d'Objets</strong> :</p><p>Utilise la m&eacute;thode getChamp pour extraire les champs des lignes et cr&eacute;er des objets Operation.</p><p>Utilise des expressions r&eacute;guli&egrave;res pour diviser les lignes en attributs.</p><p><strong>Mise &agrave; Jour des Enregistrements</strong> :</p><p>Recherche les enregistrements existants dans la base de donn&eacute;es &agrave; l'aide de DataBaseJPA.</p><p>Met &agrave; jour les attributs des enregistrements si les conditions sont remplies.</p><p>Met &agrave; jour l'&eacute;tat des enregistrements si n&eacute;cessaire.</p><p><strong>Param&egrave;tres du Composant et Valeurs Possibles</strong></p><p><strong>`VERSION_SICA`</strong> : D&eacute;termine la version du syst&egrave;me SICA utilis&eacute;e. Les valeurs possibles sont &quot;2&quot; ou &quot;3&quot;.</p><p><strong>`CETAOPEVALTRANS`</strong> : Code d'&eacute;tat pour les op&eacute;rations en cours de traitement.</p><p><strong>`CETAOPEVAL`</strong> : Code d'&eacute;tat pour les op&eacute;rations valid&eacute;es.</p><p><strong>`CETAIMASTO`</strong> : Code d'&eacute;tat pour les images stock&eacute;es.</p><p><strong>`patternDate`</strong> : Format de date utilis&eacute; pour le traitement des dates.</p><p><strong>`CODE_SICA3`</strong> : Code utilis&eacute; pour la correspondance des banques dans le syst&egrave;me SICA3.</p><p><strong>`CODE_CORRESPONDANCE`</strong> : Code utilis&eacute; pour la correspondance des banques.</p><p><strong>Interactions avec la Base de Donn&eacute;es</strong></p><p><strong>Requ&ecirc;tes SQL</strong> : Utilise des requ&ecirc;tes JPQL pour r&eacute;cup&eacute;rer et mettre &agrave; jour les enregistrements de ch&egrave;ques, virements, effets, et pr&eacute;l&egrave;vements.</p><p><strong>Gestion des Transactions</strong> : Utilise DataBaseJPA pour g&eacute;rer les transactions de base de donn&eacute;es, assurant la cr&eacute;ation et la mise &agrave; jour des enregistrements de mani&egrave;re atomique.</p>