<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache GenerateReportingOrdersCorporates est utilis&eacute;e pour g&eacute;n&eacute;rer des rapports sur les ordres de paiement pour les entreprises. Elle g&eacute;n&egrave;re des rapports PDF pour les ch&egrave;ques et effets pay&eacute;s ou rejet&eacute;s, et envoie ces rapports par email aux &eacute;tablissements concern&eacute;s.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer des rapports sur les ordres de paiement pour les entreprises.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les informations des comptes d'entreprise &agrave; partir de la base de donn&eacute;es.</p><p>G&eacute;n&egrave;re des rapports PDF pour les ch&egrave;ques et effets pay&eacute;s ou rejet&eacute;s.</p><p>Envoie les rapports par email aux &eacute;tablissements concern&eacute;s.</p><p><strong>M&eacute;thodes</strong></p><p><strong>GenerateReportingOrdersCorporates()</strong> : Constructeur qui initialise les composants n&eacute;cessaires pour la g&eacute;n&eacute;ration des rapports.</p><p><strong>genChequesPayesReport(HashSet&lt;String&gt; comptesCorp, String date)</strong> : G&eacute;n&egrave;re et envoie un rapport pour les ch&egrave;ques pay&eacute;s.</p><p><strong>genChequesRejReport(HashSet&lt;String&gt; comptesCorp, String date)</strong> : G&eacute;n&egrave;re et envoie un rapport pour les ch&egrave;ques rejet&eacute;s.</p><p><strong>genEffetsPayesReport(HashSet&lt;String&gt; comptesCorp, String date)</strong> : G&eacute;n&egrave;re et envoie un rapport pour les effets pay&eacute;s.</p><p><strong>genEffetsRejReport(HashSet&lt;String&gt; comptesCorp, String date)</strong> : G&eacute;n&egrave;re et envoie un rapport pour les effets rejet&eacute;s.</p><p><strong>Composants Internes</strong></p><p><strong>DataBaseJPA</strong> : Utilis&eacute; pour interagir avec la base de donn&eacute;es et r&eacute;cup&eacute;rer les informations des comptes et &eacute;tablissements.</p><p><strong>EmailRequest</strong> : Repr&eacute;sente une requ&ecirc;te d'envoi d'email avec un fichier joint.</p><p><strong>JerseyEmailClient</strong> : Client utilis&eacute; pour envoyer des emails.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>EMAIL_TEMPLATES_FOLDER</strong> : R&eacute;pertoire contenant les mod&egrave;les d'email.</p><p><strong>PatwareLibMvnPU</strong> : Unit&eacute; de persistance utilis&eacute;e pour g&eacute;n&eacute;rer les rapports PDF.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des rapports ou de l'envoi des emails sont g&eacute;r&eacute;es par des logs de d&eacute;bogage.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de rapports si n&eacute;cessaire.</p><p><strong>Configuration</strong> : La classe utilise des composants configurables pour la g&eacute;n&eacute;ration des rapports et l'envoi des emails, permettant une adaptation facile aux besoins sp&eacute;cifiques du syst&egrave;me.</p><p><strong>Coordination</strong> : La classe GenerateReportingOrdersCorporates coordonne la g&eacute;n&eacute;ration et l'envoi des rapports pour diff&eacute;rents types d'op&eacute;rations, assurant une gestion efficace des ordres de paiement pour les entreprises.</p>