<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache SmartSFTPUploader est con&ccedil;ue pour g&eacute;rer le transfert de fichiers via SFTP. Elle assure la connexion s&eacute;curis&eacute;e &agrave; un serveur distant et le transfert de fichiers tout en g&eacute;rant les erreurs et les tentatives de reconnexion.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : La tache est activ&eacute;e pour transf&eacute;rer des fichiers vers un serveur SFTP sp&eacute;cifi&eacute;.</p><p><strong>Traitement</strong> : Elle &eacute;tablit une connexion SFTP, transf&egrave;re le fichier, et g&egrave;re les erreurs potentielles avec des tentatives de reconnexion.</p><p><strong>R&eacute;sultat</strong> : Les fichiers sont transf&eacute;r&eacute;s avec succ&egrave;s vers le serveur SFTP, et une copie est archiv&eacute;e localement.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux, et des tentatives de reconnexion sont effectu&eacute;es si configur&eacute;es.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Connexions SFTP</strong> : &Eacute;tablit et g&egrave;re les connexions SFTP, y compris l'authentification par mot de passe ou cl&eacute; priv&eacute;e.</p><p><strong>Transfert de Fichiers</strong> : Transf&egrave;re les fichiers vers le r&eacute;pertoire distant sp&eacute;cifi&eacute; sur le serveur SFTP.</p><p><strong>Archivage Local</strong> : Copie les fichiers transf&eacute;r&eacute;s dans un r&eacute;pertoire d'archives local pour la tra&ccedil;abilit&eacute;.</p><p><strong>Gestion des Erreurs et Reconnexions</strong> : G&egrave;re les erreurs de connexion et effectue des tentatives de reconnexion si n&eacute;cessaire.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>SFTP_TIME_ALIVE</strong> : Intervalle de temps pour garder la connexion SFTP active, avec une valeur par d&eacute;faut de <strong>300000 ms</strong>. </p><p><strong>DEBUG_PASS</strong> : Indicateur pour activer le d&eacute;bogage des mots de passe, avec une valeur par d&eacute;faut <strong>false</strong>.</p><p><strong>CRYPT_TYPE</strong> : Type de cryptage utilis&eacute; pour les mots de passe, avec une valeur par d&eacute;faut <strong>AES-256</strong>.</p><p><strong>PREFERRED_AUTH_SFTP</strong> : M&eacute;thode d'authentification pr&eacute;f&eacute;r&eacute;e pour SFTP, avec une valeur par d&eacute;faut <strong>password</strong>.</p><p><strong>SFTP_RETRY</strong> : Indicateur pour activer les tentatives de reconnexion, avec une valeur par d&eacute;faut <strong>true</strong>.</p><p><strong>SFTP_OLD_ALGOS</strong> : Indicateur pour utiliser d'anciens algorithmes de chiffrement, avec une valeur par d&eacute;faut <strong>false</strong>.</p><p><strong>SFTP_CONN_VIA_KEY</strong> : Indicateur pour l'utilisation de l'authentification par cl&eacute; priv&eacute;e, avec une valeur par d&eacute;faut<strong> false</strong>.</p><p><strong>Exemples d'Utilisation</strong></p><p>Utilis&eacute;e pour transf&eacute;rer des fichiers de mani&egrave;re s&eacute;curis&eacute;e vers un serveur SFTP dans un environnement bancaire ou d'entreprise.</p><p><strong>Int&eacute;gration avec d'autres Syst&egrave;mes</strong></p><p>Int&eacute;gr&eacute;e avec les syst&egrave;mes de gestion de fichiers et de s&eacute;curit&eacute; pour assurer un transfert s&eacute;curis&eacute; et fiable des fichiers.</p>