<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache MTSFDWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer des fichiers de messages SWIFT MT103 et MT202 pour les Syst&egrave;mes Financiers D&eacute;centralis&eacute;s (SFD). Elle traite les virements RTGS (Real-Time Gross Settlement) et g&eacute;n&egrave;re les fichiers n&eacute;cessaires pour les transactions interbancaires.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates.sfd.rtgs</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer des fichiers de messages SWIFT MT103 et MT202 pour les transactions RTGS.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les virements RTGS de la base de donn&eacute;es.</p><p>Pr&eacute;pare et g&eacute;n&egrave;re les fichiers MT103 et MT202 en fonction des types de virements.</p><p>&Eacute;crit les fichiers g&eacute;n&eacute;r&eacute;s dans le r&eacute;pertoire sp&eacute;cifi&eacute;.</p><p><strong>Attributs</strong></p><p><strong>db</strong> : DataBaseJPA - Instance pour l'acc&egrave;s &agrave; la base de donn&eacute;es.</p><p><strong>parameters</strong> : ConcurrentHashMap&lt;String, Object&gt; - Param&egrave;tres pour les requ&ecirc;tes SQL.</p><p><strong>mt103Virs</strong> : List&lt;VirementsRTGS&gt; - Liste des virements de type MT103.</p><p><strong>mt202SfdToBankVirs</strong> : List&lt;VirementsRTGS&gt; - Liste des virements de type MT202 de SFD vers Banque.</p><p><strong>mt202SfdToSfdVirs</strong> : List&lt;VirementsRTGS&gt; - Liste des virements de type MT202 de SFD vers SFD.</p><p><strong>M&eacute;thodes</strong></p><p><strong>MTSFDWriter()</strong> : Constructeur par d&eacute;faut qui initialise les attributs n&eacute;cessaires.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration des fichiers de messages SWIFT.</p><p><strong>prepareVirMT103(List&lt;VirementsRTGS&gt; vir)</strong> : Pr&eacute;pare et g&eacute;n&egrave;re les fichiers pour les virements de type MT103.</p><p><strong>prepareVirMT202ToBank(List&lt;VirementsRTGS&gt; vir)</strong> : Pr&eacute;pare les virements de type MT202 de SFD vers Banque.</p><p><strong>prepareVirMT202ToSfd(List&lt;VirementsRTGS&gt; vir)</strong> : Pr&eacute;pare les virements de type MT202 de SFD vers SFD.</p><p><strong>writeMT103File(VirementsRTGS virMT103)</strong> : G&eacute;n&egrave;re et &eacute;crit un fichier MT103 pour un virement donn&eacute;.</p><p><strong>serializeToMTFin(String fileName, String document)</strong> : S&eacute;rialise le message SWIFT dans un fichier.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEVALDELTA</strong> : &Eacute;tat des op&eacute;rations &agrave; &eacute;valuer, utilis&eacute; pour filtrer les virements.</p><p><strong>SIB_IN_FOLDER</strong> : R&eacute;pertoire de destination pour les fichiers g&eacute;n&eacute;r&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des fichiers sont g&eacute;r&eacute;es par des logs.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre extensible, permettant l'ajout de nouveaux types de messages ou de fonctionnalit&eacute;s.</p><p><strong>Utilisation des Biblioth&egrave;ques SWIFT</strong> : Utilise les biblioth&egrave;ques Prowide pour manipuler les messages SWIFT.</p>