<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache PrelevementRetourSitWriter est une extension de FlatFileWriter utilis&eacute;e pour envoyer des pr&eacute;l&egrave;vements de retour vers le SIB (Syst&egrave;me d'Information Bancaire). Elle g&eacute;n&egrave;re des fichiers plats contenant les informations des pr&eacute;l&egrave;vements et met &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.orion</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Envoyer des pr&eacute;l&egrave;vements de retour vers le SIB en g&eacute;n&eacute;rant des fichiers plats et mettre &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Traitement</strong> :</p><p>V&eacute;rifie si le verrouillage des pr&eacute;l&egrave;vements de retour est actif.</p><p>R&eacute;cup&egrave;re les pr&eacute;l&egrave;vements &agrave; envoyer en fonction de leur &eacute;tat.</p><p>G&eacute;n&egrave;re un fichier plat avec les informations des pr&eacute;l&egrave;vements.</p><p>Met &agrave; jour l'&eacute;tat des pr&eacute;l&egrave;vements apr&egrave;s envoi.</p><p>G&egrave;re les messages associ&eacute;s aux pr&eacute;l&egrave;vements re&ccedil;us.</p><p><strong>M&eacute;thodes</strong></p><p><strong>PrelevementRetourSitWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des pr&eacute;l&egrave;vements de retour vers le SIB.</p><p><strong>getMessagePrelevementsRecus()</strong> : Retourne le message des pr&eacute;l&egrave;vements re&ccedil;us.</p><p><strong>setMessagePrelevementsRecus(String messagePrelevementsRecus)</strong> : D&eacute;finit le message des pr&eacute;l&egrave;vements re&ccedil;us.</p><p><strong>Attributs</strong></p><p><strong>messagePrelevementsRecus</strong> : Message des pr&eacute;l&egrave;vements re&ccedil;us.</p><p><strong>dataBaseJPA</strong> : Instance de DataBaseJPA pour interagir avec la base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>LOCK_PREL_RETOUR</strong> : Param&egrave;tre de verrouillage pour &eacute;viter les conflits d'acc&egrave;s lors de la composition des fichiers de pr&eacute;l&egrave;vements retour.</p><p><strong>CETAOPERET</strong> : &Eacute;tat des pr&eacute;l&egrave;vements retour.</p><p><strong>CETAOPERETENVSIB</strong> : &Eacute;tat des pr&eacute;l&egrave;vements apr&egrave;s envoi vers le SIB.</p><p><strong>SIB_IN_FOLDER</strong> : Dossier de destination pour les fichiers g&eacute;n&eacute;r&eacute;s.</p><p><strong>PREL_OUT_FILE_ROOTNAME</strong> : Nom de base pour les fichiers de pr&eacute;l&egrave;vements retour.</p><p><strong>SIB_FILE_EXTENSION</strong> : Extension des fichiers g&eacute;n&eacute;r&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de l'envoi des pr&eacute;l&egrave;vements de retour sont g&eacute;r&eacute;es par des logs et des messages d'avertissement.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types de pr&eacute;l&egrave;vements ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette tache utilise DataBaseJPA pour interagir avec la base de donn&eacute;es et effectuer les mises &agrave; jour n&eacute;cessaires.</p>