<p><strong> ICRCheckWithoutSlipReader</strong></p><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ICRCheckWithoutSlipReader est con&ccedil;ue pour lire et traiter les fichiers de ch&egrave;ques scann&eacute;s sans bordereau, en v&eacute;rifiant l'int&eacute;grit&eacute; des donn&eacute;es et en int&eacute;grant les informations dans le syst&egrave;me.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers de ch&egrave;ques scann&eacute;s dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> : V&eacute;rifie les donn&eacute;es des fichiers scann&eacute;s, traite les images des ch&egrave;ques, et met &agrave; jour les informations dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Mise &agrave; jour des statuts des ch&egrave;ques et des s&eacute;quences dans la base de donn&eacute;es.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Fichiers</strong> : Assure la lecture, la validation, et le d&eacute;placement des fichiers de ch&egrave;ques scann&eacute;s.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Met &agrave; jour les statuts des ch&egrave;ques et des s&eacute;quences.</p><p><strong>Traitement d'Images</strong> : Redimensionne et tatoue les images des ch&egrave;ques.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>LINE_SCORE_PARAM</strong> : Param&egrave;tre de score de ligne utilis&eacute; pour la validation.</p><p><strong>CORE_SYSTEM</strong> : Indique le syst&egrave;me central utilis&eacute; (ex. BAOBAB).</p><p><strong>RESIZE_THE_IMAGE</strong> : Indique si les images doivent &ecirc;tre redimensionn&eacute;es.</p><p><strong>IMG_ALLER_FOLDER</strong> : R&eacute;pertoire de destination pour les images trait&eacute;es.</p><p><strong>SAISIE_LENTE_DEV</strong> : Param&egrave;tre de d&eacute;veloppement pour la saisie lente.</p><p><strong>LENTEUR_TIME_DEV</strong> : Temps de latence pour le d&eacute;veloppement.</p><p><strong>Exemples d'Utilisation</strong></p><p>Utilis&eacute;e pour valider et traiter les ch&egrave;ques scann&eacute;s sans bordereau dans un environnement bancaire.</p><p><strong>Int&eacute;gration avec d'autres Syst&egrave;mes</strong></p><p>Int&eacute;gr&eacute;e avec le syst&egrave;me de gestion des ch&egrave;ques et le service ICR pour la reconnaissance des caract&egrave;res.</p>