<p><strong>SmartFTPSUploader</strong></p><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache SmartFTPSUploader est con&ccedil;ue pour g&eacute;rer le t&eacute;l&eacute;chargement de fichiers via le protocole FTPS (FTP Secure). Elle permet de t&eacute;l&eacute;charger des fichiers depuis un serveur distant, de v&eacute;rifier s'ils ont d&eacute;j&agrave; &eacute;t&eacute; trait&eacute;s, et de les supprimer du serveur apr&egrave;s t&eacute;l&eacute;chargement si n&eacute;cessaire.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : La m&eacute;thode treatFile() est appel&eacute;e pour initier le processus de t&eacute;l&eacute;chargement.</p><p><strong>Traitement</strong> : T&eacute;l&eacute;charge les fichiers depuis un serveur FTPS, v&eacute;rifie s'ils ont d&eacute;j&agrave; &eacute;t&eacute; trait&eacute;s, et les supprime du serveur si configur&eacute;.</p><p><strong>R&eacute;sultat</strong> : Les fichiers sont t&eacute;l&eacute;charg&eacute;s dans un r&eacute;pertoire local sp&eacute;cifi&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de connexion ou de t&eacute;l&eacute;chargement sont consign&eacute;es dans les journaux.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Connexion FTPS</strong> : &Eacute;tablit une connexion s&eacute;curis&eacute;e avec le serveur FTPS en utilisant les param&egrave;tres de connexion fournis.</p><p><strong>T&eacute;l&eacute;chargement de Fichiers</strong> : T&eacute;l&eacute;charge les fichiers qui correspondent &agrave; une extension sp&eacute;cifique depuis un r&eacute;pertoire distant.</p><p><strong>V&eacute;rification de Traitement</strong> : V&eacute;rifie si un fichier a d&eacute;j&agrave; &eacute;t&eacute; trait&eacute; en consultant une base de donn&eacute;es.</p><p><strong>Suppression de Fichiers</strong> : Supprime les fichiers du serveur distant apr&egrave;s t&eacute;l&eacute;chargement si configur&eacute; pour le faire.</p><p><strong>D&eacute;cryptage de Mot de Passe</strong> : D&eacute;crypte le mot de passe FTPS si celui-ci est stock&eacute; de mani&egrave;re crypt&eacute;e.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>SFTPHOST</strong> : Adresse du serveur FTPS, obtenue dynamiquement.</p><p><strong>SFTPPORT</strong> : Port du serveur FTPS, avec comme valeur par d&eacute;faut de <strong>22</strong>.</p><p><strong>SFTPUSER</strong> : Nom d'utilisateur pour la connexion FTPS, obtenu dynamiquement.</p><p><strong>SFTPPASSWORD</strong> : Mot de passe pour la connexion FTPS, qui peut &ecirc;tre crypt&eacute;, obtenu dynamiquement.</p><p><strong>REMOTE_FOLDER</strong> : R&eacute;pertoire distant &agrave; partir duquel les fichiers doivent &ecirc;tre t&eacute;l&eacute;charg&eacute;s , avec comme valeur par d&eacute;faut <strong>/remote/incoming/ (configurable)</strong>.</p><p><strong>REMOTE_FILE_EXTENSION</strong> : Extension des fichiers &agrave; t&eacute;l&eacute;charger, avec comme valeur par d&eacute;faut<strong> *</strong>.</p><p><strong>LOCAL_FOLDER</strong> : R&eacute;pertoire local o&ugrave; les fichiers t&eacute;l&eacute;charg&eacute;s seront stock&eacute;s, avec comme valeur par d&eacute;faut <strong>/var/data/sftp_upload/</strong>.</p><p><strong>DEL_FILE_AFTER_DOWNL</strong> : Indicateur pour supprimer les fichiers du serveur apr&egrave;s t&eacute;l&eacute;chargement, avec comme valeur par d&eacute;faut <strong>false</strong>.</p><p><strong>Exemples d'Utilisation</strong></p><p>Utilis&eacute;e pour automatiser le t&eacute;l&eacute;chargement s&eacute;curis&eacute; de fichiers depuis un serveur FTPS dans un environnement d'entreprise, en assurant que les fichiers sont correctement t&eacute;l&eacute;charg&eacute;s et trait&eacute;s.</p><p><strong>Int&eacute;gration avec d'autres Syst&egrave;mes</strong></p><p>Int&eacute;gr&eacute;e avec des syst&egrave;mes de gestion de fichiers et des bases de donn&eacute;es pour assurer un traitement fiable et efficace des fichiers t&eacute;l&eacute;charg&eacute;s.</p>