<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache VirementsSicaSFDWriter est une extension de FlatFileWriter utilis&eacute;e pour traiter et envoyer des virements vers le syst&egrave;me Amplitude. Elle r&eacute;cup&egrave;re les virements &agrave; partir de la base de donn&eacute;es, les pr&eacute;pare pour l'envoi, et interagit avec une API pour effectuer les transferts.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates.sfd.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Traiter et envoyer des virements vers le syst&egrave;me Amplitude.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les &eacute;tablissements et leurs virements associ&eacute;s &agrave; partir de la base de donn&eacute;es.</p><p>Pr&eacute;pare les donn&eacute;es des virements pour l'envoi, y compris la g&eacute;n&eacute;ration de l'IBAN et la mise &agrave; jour des &eacute;tats.</p><p>Envoie les virements via une API d&eacute;di&eacute;e et g&egrave;re les r&eacute;ponses pour assurer le suivi des op&eacute;rations.</p><p><strong>M&eacute;thodes</strong></p><p><strong>VirementsSicaSFDWriter()</strong> : Constructeur par d&eacute;faut.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des virements, en r&eacute;cup&eacute;rant les donn&eacute;es, pr&eacute;parant les transactions, et interagissant avec l'API Amplitude.</p><p><strong>retrieveVirements(String etablissement)</strong> : R&eacute;cup&egrave;re les virements pour un &eacute;tablissement donn&eacute;.</p><p><strong>retrieveEtabsFromVirements()</strong> : R&eacute;cup&egrave;re la liste des &eacute;tablissements ayant des virements &agrave; traiter.</p><p><strong>addErrorMessage(String message)</strong> : Ajoute un message d'erreur au contexte Faces.</p><p><strong>addInfoMessage(String message)</strong> : Ajoute un message d'information au contexte Faces.</p><p><strong>addWarningMessage(String message)</strong> : Ajoute un message d'avertissement au contexte Faces.</p><p><strong>Composants Internes</strong></p><p><strong>DataBaseJPA</strong> : Utilis&eacute; pour interagir avec la base de donn&eacute;es et r&eacute;cup&eacute;rer les informations des virements.</p><p><strong>AmplitudeTransfertApiClient</strong> : Client API utilis&eacute; pour envoyer les virements au syst&egrave;me Amplitude.</p><p><strong>TransferApiAmplitudeRequest</strong> : Repr&eacute;sente une requ&ecirc;te de transfert &agrave; envoyer &agrave; l'API Amplitude.</p><p><strong>Listtransaction</strong> : Repr&eacute;sente une transaction individuelle dans une requ&ecirc;te de transfert.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CODE_PRODUIT_</strong> : Code produit pour chaque &eacute;tablissement.</p><p><strong>PARTENAIRE_ID_</strong> : Identifiant partenaire pour chaque &eacute;tablissement.</p><p><strong>API_KEY_</strong> : Cl&eacute; API pour l'authentification des requ&ecirc;tes.</p><p><strong>CETAOPEVALDELTA</strong> : &Eacute;tat des virements &agrave; traiter.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de l'interaction avec l'API ou de la r&eacute;cup&eacute;ration des donn&eacute;es sont g&eacute;r&eacute;es par des logs et des messages Faces.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de transactions ou syst&egrave;mes de transfert.</p><p><strong>Configuration</strong> : La classe utilise des param&egrave;tres configurables pour l'interaction avec l'API, permettant une adaptation facile aux besoins sp&eacute;cifiques du syst&egrave;me.</p><p><strong>Coordination</strong> : La classe VirementsSicaSFDWriter coordonne l'envoi des virements en interagissant avec l'API Amplitude, assurant une gestion efficace des virements pour les &eacute;tablissements.</p>