<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache MailaSFDWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer et envoyer des fichiers de type MAILA vers un partenaire. Elle cr&eacute;e un fichier plat contenant les d&eacute;tails de l'en-t&ecirc;te de remise et g&egrave;re la configuration du nom de fichier.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer des fichiers MAILA pour l'envoi vers un partenaire.</p><p><strong>Traitement</strong> :</p><p>Configure le nom du fichier MAILA.</p><p>V&eacute;rifie et cr&eacute;e le r&eacute;pertoire de destination si n&eacute;cessaire.</p><p>G&eacute;n&egrave;re un en-t&ecirc;te de remise avec les informations n&eacute;cessaires.</p><p>Cr&eacute;e un fichier plat avec l'en-t&ecirc;te de remise et une ligne de fin de fichier.</p><p><strong>M&eacute;thodes</strong></p><p><strong>MailaSFDWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi MAILA.</p><p><strong>MailaSFDWriter(String name)</strong> : Constructeur qui configure le nom du fichier MAILA en fonction du nom fourni.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration du fichier MAILA, en cr&eacute;ant l'en-t&ecirc;te de remise et en &eacute;crivant le fichier plat.</p><p><strong>getNomFichierMaila()</strong> : Retourne le nom du fichier MAILA.</p><p><strong>setNomFichierMaila(String nomFichierMaila)</strong> : D&eacute;finit le nom du fichier MAILA.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>VERSION_SICA</strong> : Version du syst&egrave;me SICA utilis&eacute;e pour d&eacute;terminer le format de l'en-t&ecirc;te de remise.</p><p><strong>MAILA_SFD_NAT_FOLDER</strong> : R&eacute;pertoire de destination pour les fichiers MAILA SFD nationaux.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration du fichier sont g&eacute;r&eacute;es par la classe parente FlatFileWriter. Si le r&eacute;pertoire de destination ne peut pas &ecirc;tre cr&eacute;&eacute;, un &eacute;v&eacute;nement d'erreur est enregistr&eacute;.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de v&eacute;rifications ou de formats de fichiers si n&eacute;cessaire.</p><p><strong>Configuration</strong> : La classe utilise des composants configurables pour la g&eacute;n&eacute;ration des fichiers, permettant une adaptation facile aux besoins sp&eacute;cifiques du syst&egrave;me.</p><p><strong>Fichiers Plats</strong> : Les fichiers plats g&eacute;n&eacute;r&eacute;s contiennent les d&eacute;tails de l'en-t&ecirc;te de remise et une ligne de fin de fichier, et sont enregistr&eacute;s dans le r&eacute;pertoire sp&eacute;cifi&eacute; par MAILA_SFD_NAT_FOLDER.</p>