<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache Icom2NatWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer et envoyer des fichiers ICOM2 nationaux vers la BCEAO. Elle traite divers types d'op&eacute;rations financi&egrave;res telles que les ch&egrave;ques, effets, et pr&eacute;l&egrave;vements, en fonction de leur &eacute;tat et type.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer des fichiers ICOM2 nationaux vers la BCEAO en traitant les op&eacute;rations financi&egrave;res disponibles.</p><p><strong>Traitement</strong> :</p><p>V&eacute;rifie les param&egrave;tres de compensation manuelle et d'envoi.</p><p>R&eacute;cup&egrave;re les op&eacute;rations financi&egrave;res (ch&egrave;ques, effets, pr&eacute;l&egrave;vements) d'une banque.</p><p>Pr&eacute;pare les op&eacute;rations en fonction de leur type et destination.</p><p>Met &agrave; jour l'&eacute;tat des op&eacute;rations apr&egrave;s traitement.</p><p><strong>M&eacute;thodes</strong></p><p><strong>Icom2NatWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi des fichiers ICOM2.</p><p><strong>preparePrelevements(List&lt;Prelevements&gt; prelevements)</strong> : Pr&eacute;pare les pr&eacute;l&egrave;vements pour l'envoi.</p><p><strong>prepareCheques(List&lt;Cheques&gt; cheques)</strong> : Pr&eacute;pare les ch&egrave;ques pour l'envoi.</p><p><strong>prepareEffets(List&lt;Effets&gt; effets)</strong> : Pr&eacute;pare les effets pour l'envoi.</p><p><strong>printRejets(EnteteRemise enteteRemise, int i, int j)</strong> : G&eacute;n&egrave;re une ligne de rejet pour l'impression.</p><p><strong>printRemise(DataBaseJPA db)</strong> : Imprime la remise et met &agrave; jour les &eacute;tats des op&eacute;rations.</p><p><strong>printEnteteLot(EnteteRemise enteteRemise, Remcom remcom, int i)</strong> : G&eacute;n&egrave;re l'en-t&ecirc;te du lot pour l'impression.</p><p><strong>printEnteteRemise(EnteteRemise enteteRemise)</strong> : G&eacute;n&egrave;re l'en-t&ecirc;te de la remise pour l'impression.</p><p><strong>updateEtatOperations(DataBaseJPA db)</strong> : Met &agrave; jour l'&eacute;tat des op&eacute;rations apr&egrave;s l'envoi.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEALLICOM2</strong> : &Eacute;tat des op&eacute;rations &agrave; traiter pour ICOM2.</p><p><strong>CETAOPEALLPREICOM2</strong> : &Eacute;tat des op&eacute;rations avant l'envoi ICOM2.</p><p><strong>CETAOPEALLICOM2ENV</strong> : &Eacute;tat des op&eacute;rations apr&egrave;s l'envoi ICOM2.</p><p><strong>COMPENSATION_MANUELLE</strong> : Indicateur de compensation manuelle.</p><p><strong>DATECOMPENS_NAT</strong> : Date de compensation nationale.</p><p><strong>VERSION_SICA</strong> : Version du syst&egrave;me SICA utilis&eacute;.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration ou de l'envoi des fichiers sont g&eacute;r&eacute;es par des logs et des mises &agrave; jour de param&egrave;tres.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types d'op&eacute;rations ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette tache utilise DataBaseJPA pour interagir avec la base de donn&eacute;es et r&eacute;cup&eacute;rer les op&eacute;rations &agrave; traiter.</p>