<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache LotOrionTPCIWriter est une extension de FlatFileWriter utilis&eacute;e pour envoyer des lots d'op&eacute;rations de ch&egrave;ques vers le SIB (Syst&egrave;me d'Information Bancaire). Elle g&eacute;n&egrave;re des fichiers plats contenant les informations des ch&egrave;ques et met &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.orion</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Envoyer des lots d'op&eacute;rations de ch&egrave;ques vers le SIB en g&eacute;n&eacute;rant des fichiers plats et mettre &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les ch&egrave;ques &agrave; envoyer en fonction de leur &eacute;tat.</p><p>G&eacute;n&egrave;re un fichier plat avec les informations des ch&egrave;ques.</p><p>Met &agrave; jour l'&eacute;tat des ch&egrave;ques apr&egrave;s envoi.</p><p>G&egrave;re les op&eacute;rations associ&eacute;es &agrave; chaque ch&egrave;que.</p><p><strong>M&eacute;thodes</strong></p><p><strong>LotOrionTPCIWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des lots de ch&egrave;ques vers le SIB.</p><p><strong>prepareCheques(Cheques[] cheques)</strong> : Pr&eacute;pare les ch&egrave;ques pour l'envoi en cr&eacute;ant des op&eacute;rations associ&eacute;es.</p><p><strong>printLotCheque(Cheques[] cheques, EnteteLot enteteLot)</strong> : G&eacute;n&egrave;re le fichier plat pour un lot de ch&egrave;ques.</p><p><strong>printCheques(EnteteLot enteteLot, int j)</strong> : G&eacute;n&egrave;re la ligne de fichier plat pour un ch&egrave;que.</p><p><strong>printEnteteLot(EnteteLot enteteLot)</strong> : G&eacute;n&egrave;re l'en-t&ecirc;te du fichier plat pour un lot de ch&egrave;ques.</p><p><strong>Attributs</strong></p><p><strong>sql</strong> : Requ&ecirc;te SQL pour r&eacute;cup&eacute;rer les ch&egrave;ques.</p><p><strong>refLot</strong> : R&eacute;f&eacute;rence du lot en cours de traitement.</p><p><strong>vEnteteLots</strong> : Vecteur contenant les en-t&ecirc;tes des lots.</p><p><strong>cheques</strong> : Tableau de ch&egrave;ques de type 030.</p><p><strong>cheques35</strong> : Tableau de ch&egrave;ques de type 035.</p><p><strong>remcom</strong> : Objet repr&eacute;sentant une remise de ch&egrave;ques.</p><p><strong>lotcom</strong> : Objet repr&eacute;sentant un lot de ch&egrave;ques.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEVAL2</strong> : &Eacute;tat des op&eacute;rations valid&eacute;es.</p><p><strong>CETAOPEVAL</strong> : &Eacute;tat des op&eacute;rations en validation.</p><p><strong>CETAOPESAI</strong> : &Eacute;tat des op&eacute;rations saisies.</p><p><strong>CETAOPEALLICOM1</strong> : &Eacute;tat des op&eacute;rations apr&egrave;s envoi.</p><p><strong>CETAOPEVALSURCAIENVSIB</strong> : &Eacute;tat des op&eacute;rations valid&eacute;es sur CAI apr&egrave;s envoi vers le SIB.</p><p><strong>SIB_IN_FOLDER</strong> : Dossier de destination pour les fichiers g&eacute;n&eacute;r&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de l'envoi des lots de ch&egrave;ques sont g&eacute;r&eacute;es par des logs et des messages d'avertissement.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types de ch&egrave;ques ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette tache utilise DataBase pour interagir avec la base de donn&eacute;es et effectuer les mises &agrave; jour n&eacute;cessaires.</p>