<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache TransferApiAmplitudeRequest est utilis&eacute;e pour repr&eacute;senter une requ&ecirc;te d'envoi de virements vers le syst&egrave;me Amplitude. Elle contient les informations n&eacute;cessaires pour effectuer un transfert, y compris la liste des transactions, le nombre total de transactions, le montant total, et la r&eacute;f&eacute;rence de l'op&eacute;ration.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates.sfd.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Repr&eacute;senter une requ&ecirc;te pour les transferts de virements vers l'API Amplitude.</p><p><strong>Traitement</strong> :</p><p>Stocke les informations n&eacute;cessaires pour effectuer un transfert de virements.</p><p>Fournit des m&eacute;thodes pour acc&eacute;der et modifier ces informations.</p><p><strong>Attributs</strong></p><p><strong>listtransactions</strong> : ArrayList&lt;Listtransaction&gt; - Liste des transactions &agrave; inclure dans le transfert.</p><p><strong>nombreTransactions</strong> : int - Nombre total de transactions dans la requ&ecirc;te de transfert.</p><p><strong>montantTotal</strong> : long - Montant total des transactions dans la requ&ecirc;te de transfert.</p><p><strong>referenceOperation</strong> : String - R&eacute;f&eacute;rence de l'op&eacute;ration de transfert.</p><p><strong>M&eacute;thodes</strong></p><p><strong>TransferApiAmplitudeRequest()</strong> : Constructeur par d&eacute;faut.</p><p><strong>getListtransactions() / setListtransactions(ArrayList&lt;Listtransaction&gt; listtransactions)</strong> : Acc&egrave;de et modifie la liste des transactions.</p><p><strong>getNombreTransactions() / setNombreTransactions(int nombreTransactions)</strong> : Acc&egrave;de et modifie le nombre total de transactions.</p><p><strong>getMontantTotal() / setMontantTotal(long montantTotal)</strong> : Acc&egrave;de et modifie le montant total des transactions.</p><p><strong>getReferenceOperation() / setReferenceOperation(String referenceOperation)</strong> : Acc&egrave;de et modifie la r&eacute;f&eacute;rence de l'op&eacute;ration.</p><p><strong>toString()</strong> : Retourne une repr&eacute;sentation sous forme de cha&icirc;ne de caract&egrave;res de l'objet, incluant tous ses attributs.</p><p><strong>Composants Internes</strong></p><p><strong>Listtransaction</strong> : Classe utilis&eacute;e pour repr&eacute;senter une transaction individuelle dans la requ&ecirc;te de transfert.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>Aucun param&egrave;tre externe sp&eacute;cifique</strong> : La classe utilise des attributs internes pour stocker les donn&eacute;es n&eacute;cessaires &agrave; la requ&ecirc;te.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : La classe ne g&egrave;re pas directement les erreurs, mais pr&eacute;pare les donn&eacute;es pour l'envoi &agrave; l'API.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres attributs ou m&eacute;thodes si n&eacute;cessaire.</p><p><strong>Configuration</strong> : La classe est configur&eacute;e pour stocker et manipuler les donn&eacute;es n&eacute;cessaires pour les transferts de virements.</p><p><strong>Coordination</strong> : La classe TransferApiAmplitudeRequest coordonne la pr&eacute;paration des donn&eacute;es pour l'envoi &agrave; l'API Amplitude, assurant une repr&eacute;sentation claire et structur&eacute;e des informations de transfert.</p>