<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache RemiseChequesBaobabUapWriter est une extension de BrmWriter utilis&eacute;e pour g&eacute;rer l'envoi des remises et des ch&egrave;ques vers le syst&egrave;me UAP BAOBAB. Elle traite les remises et les ch&egrave;ques, met &agrave; jour leur &eacute;tat, et g&eacute;n&egrave;re les valeurs n&eacute;cessaires pour l'int&eacute;gration avec UAP BAOBAB.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.baobab_uap</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;rer l'envoi des remises et des ch&egrave;ques vers UAP BAOBAB, en mettant &agrave; jour les &eacute;tats et en g&eacute;n&eacute;rant les valeurs n&eacute;cessaires pour l'int&eacute;gration.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les remises et les ch&egrave;ques &agrave; traiter.</p><p>Met &agrave; jour l'&eacute;tat des remises et des ch&egrave;ques apr&egrave;s traitement.</p><p>G&eacute;n&egrave;re les valeurs pour l'int&eacute;gration avec UAP BAOBAB.</p><p>G&egrave;re les deux sens d'interface : &quot;ALLER&quot; pour l'envoi des remises et &quot;RETOUR&quot; pour l'envoi des ch&egrave;ques rejet&eacute;s.</p><p><strong>M&eacute;thodes</strong></p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des remises et des ch&egrave;ques, en r&eacute;cup&eacute;rant les remises et les ch&egrave;ques &agrave; traiter, en mettant &agrave; jour leur &eacute;tat, et en g&eacute;n&eacute;rant les valeurs pour UAP BAOBAB.</p><p><strong>generateValuesForUapBaobab(Remises remise)</strong> : G&eacute;n&egrave;re les valeurs pour l'envoi des remises vers UAP BAOBAB.</p><p><strong>generateRejectValuesForUapBaobab(List&lt;Cheques&gt; cheques)</strong> : G&eacute;n&egrave;re les valeurs pour l'envoi des ch&egrave;ques rejet&eacute;s vers UAP BAOBAB.</p><p><strong>convertFromRemises(Remises r)</strong> : Convertit une remise en un objet IntRemisesAller pour l'int&eacute;gration avec UAP BAOBAB.</p><p><strong>convertFromOneCheque(Cheques c)</strong> : Convertit un ch&egrave;que en un objet IntChequesAller pour l'int&eacute;gration avec UAP BAOBAB.</p><p><strong>convertFromOneChequeRej(Cheques c)</strong> : Convertit un ch&egrave;que rejet&eacute; en un objet IntChequesRejetes pour l'int&eacute;gration avec UAP BAOBAB.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CODE_BANQUE_SICA3</strong> : Code de la banque utilis&eacute; pour identifier l'&eacute;tablissement.</p><p><strong>CETAOPEVAL2</strong> : Param&egrave;tre utilis&eacute; pour identifier l'&eacute;tat des remises &agrave; traiter.</p><p><strong>CETAOPEALLICOM1</strong> : Param&egrave;tre utilis&eacute; pour mettre &agrave; jour l'&eacute;tat des ch&egrave;ques apr&egrave;s traitement.</p><p><strong>CETAOPEALLICOM2</strong> : Param&egrave;tre utilis&eacute; pour identifier l'&eacute;tat des ch&egrave;ques rejet&eacute;s &agrave; traiter.</p><p><strong>CETAOPEALLICOM2ENV</strong> : Param&egrave;tre utilis&eacute; pour mettre &agrave; jour l'&eacute;tat des ch&egrave;ques rejet&eacute;s apr&egrave;s traitement.</p><p><strong>LOCK_CHK_ALL_COMPENSE</strong> : Param&egrave;tre utilis&eacute; pour verrouiller le traitement des ch&egrave;ques.</p><p><strong>LOCK_CHK_RET_RJT_COMPENSE</strong> : Param&egrave;tre utilis&eacute; pour verrouiller le traitement des ch&egrave;ques rejet&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors du traitement des remises et des ch&egrave;ques sont enregistr&eacute;es dans les logs et peuvent d&eacute;clencher des notifications d'erreur.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de v&eacute;rifications ou de formats de fichiers si n&eacute;cessaire.</p><p><strong>Configuration</strong> : La classe utilise des composants configurables pour le traitement des remises et des ch&egrave;ques, permettant une adaptation facile aux besoins sp&eacute;cifiques du syst&egrave;me.</p><p><strong>Interface Sens</strong> : La classe g&egrave;re deux sens d'interface : &quot;ALLER&quot; pour l'envoi des remises et &quot;RETOUR&quot; pour l'envoi des ch&egrave;ques rejet&eacute;s.</p>