<p><strong>SmartEffetsRemManSynReader</strong></p><p><strong>Introduction</strong></p><p style="margin-left: 30.0px;"><strong>Description</strong> : La tache SmartEffetsRemManSynReader est con&ccedil;ue pour lire, traiter et synchroniser les fichiers d'effets scann&eacute;s avec des informations de remise. Elle int&egrave;gre les informations des effets dans le syst&egrave;me, applique des v&eacute;rifications de conformit&eacute;, et g&egrave;re le d&eacute;placement des fichiers d'images vers les r&eacute;pertoires appropri&eacute;s.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers d'effets scann&eacute;s dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> : V&eacute;rifie les donn&eacute;es des fichiers scann&eacute;s, traite les images des effets, et met &agrave; jour les informations dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Mise &agrave; jour des statuts des effets et des s&eacute;quences dans la base de donn&eacute;es, avec les images des effets d&eacute;plac&eacute;es vers le r&eacute;pertoire appropri&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Fichiers</strong> : Assure la lecture, la validation, et le d&eacute;placement des fichiers d'effets scann&eacute;s.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Met &agrave; jour les statuts des effets et des s&eacute;quences.</p><p><strong>Traitement d'Images</strong> : D&eacute;place et renomme les images des effets.</p><p><strong>V&eacute;rification de Conformit&eacute;</strong> : V&eacute;rifie si les fichiers ont d&eacute;j&agrave; &eacute;t&eacute; trait&eacute;s pour &eacute;viter les doublons.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>IMG_ALLER_FOLDER</strong> : R&eacute;pertoire de destination pour les images trait&eacute;es.</p><p><strong>CODE_SICA2</strong> et <strong>CODE_SICA3</strong> : Param&egrave;tres pour la conversion des codes num&eacute;riques en codes alphanum&eacute;riques.</p><p><strong>RVDSTRONGCHECK</strong> : Param&egrave;tre pour la gestion des fichiers d&eacute;j&agrave; trait&eacute;s.</p><p><strong>Exemples d'Utilisation</strong></p><p>Utilis&eacute;e pour valider, traiter et sauvegarder les effets scann&eacute;s avec des informations de remise dans un environnement bancaire.</p><p><strong>Int&eacute;gration avec d'autres Syst&egrave;mes</strong></p><p>Int&eacute;gr&eacute;e avec le syst&egrave;me de gestion des effets et les services de gestion des fichiers pour le traitement et le stockage des images.</p>