<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ChequeRejeteBAMLSitWriter est une extension de FlatFileWriter utilis&eacute;e pour envoyer les ch&egrave;ques rejet&eacute;s vers le SIB (Syst&egrave;me d'Information Bancaire). Elle g&eacute;n&egrave;re un fichier plat contenant les informations des ch&egrave;ques rejet&eacute;s &agrave; envoyer et met &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.orion</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Envoyer les ch&egrave;ques rejet&eacute;s vers le SIB en g&eacute;n&eacute;rant un fichier plat et mettre &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Traitement</strong> :</p><p>V&eacute;rifie si le verrouillage pour l'envoi des ch&egrave;ques rejet&eacute;s est activ&eacute;.</p><p>R&eacute;cup&egrave;re les ch&egrave;ques rejet&eacute;s &agrave; envoyer.</p><p>G&eacute;n&egrave;re un fichier plat avec les informations des ch&egrave;ques rejet&eacute;s.</p><p>Met &agrave; jour l'&eacute;tat des ch&egrave;ques apr&egrave;s envoi.</p><p><strong>M&eacute;thodes</strong></p><p><strong>ChequeRejeteBAMLSitWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des ch&egrave;ques rejet&eacute;s vers le SIB.</p><p><strong>getMessageChequesRejetesRecus()</strong> : Retourne le message contenant le nombre de ch&egrave;ques rejet&eacute;s et le montant total.</p><p><strong>setMessageChequesRejetesRecus(String message)</strong> : D&eacute;finit le message contenant le nombre de ch&egrave;ques rejet&eacute;s et le montant total.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEREJRET</strong> : &Eacute;tat des ch&egrave;ques rejet&eacute;s pr&ecirc;ts &agrave; &ecirc;tre envoy&eacute;s.</p><p><strong>CETAOPEREJRETENVSIB</strong> : &Eacute;tat des ch&egrave;ques rejet&eacute;s apr&egrave;s envoi.</p><p><strong>LOCK_CHK_RJT_ALLER</strong> : Param&egrave;tre de verrouillage pour &eacute;viter les envois simultan&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de l'envoi des ch&egrave;ques rejet&eacute;s sont g&eacute;r&eacute;es par des logs.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types de ch&egrave;ques ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette tache utilise DataBaseJPA pour interagir avec la base de donn&eacute;es et effectuer les mises &agrave; jour n&eacute;cessaires.</p>