<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache GenOrdersByBankForSFDWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer des fichiers d'ordres pour les Syst&egrave;mes Financiers D&eacute;centralis&eacute;s (SFD) &agrave; destination des banques. Elle coordonne l'ex&eacute;cution de deux autres &eacute;crivains de fichiers, MailiBankSFDWriter et LotSFDBankWriter, pour produire les fichiers n&eacute;cessaires.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates.sfd.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et coordonner la cr&eacute;ation de fichiers d'ordres pour les SFD vers les banques.</p><p><strong>Traitement</strong> :</p><p>Initialise et ex&eacute;cute les &eacute;crivains de fichiers MailiBankSFDWriter et LotSFDBankWriter.</p><p>Met &agrave; jour la description du processus en fonction des r&eacute;sultats des &eacute;crivains de fichiers.</p><p><strong>Attributs</strong></p><p><strong>mailiNatBankSFDWriter</strong> : MailiBankSFDWriter - Instance de l'&eacute;crivain de fichiers pour les ordres de type Maili.</p><p><strong>lotSFDBankWriter</strong> : LotSFDBankWriter - Instance de l'&eacute;crivain de fichiers pour les lots de SFD.</p><p><strong>M&eacute;thodes</strong></p><p><strong>GenOrdersByBankForSFDWriter()</strong> : Constructeur par d&eacute;faut qui initialise les &eacute;crivains de fichiers et la description du processus.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration des fichiers d'ordres en coordonnant les &eacute;crivains de fichiers.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>ParametersMap</strong> : Utilis&eacute; pour passer des param&egrave;tres de configuration aux &eacute;crivains de fichiers MailiBankSFDWriter et LotSFDBankWriter.</p><p><strong>Remarques</strong></p><p><strong>Coordination</strong> : La classe GenOrdersByBankForSFDWriter agit comme un coordinateur, orchestrant l'ex&eacute;cution de plusieurs &eacute;crivains de fichiers pour assurer la g&eacute;n&eacute;ration compl&egrave;te des fichiers d'ordres pour les SFD.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible, permettant l'ajout de nouveaux &eacute;crivains de fichiers ou de nouvelles fonctionnalit&eacute;s si n&eacute;cessaire.</p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de l'ex&eacute;cution des &eacute;crivains de fichiers sont g&eacute;r&eacute;es par les classes respectives, et la description du processus est mise &agrave; jour en cons&eacute;quence.</p>