<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache Icom1NatWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer et envoyer des fichiers ICOM1 nationaux vers la BCEAO. Elle traite divers types d'op&eacute;rations financi&egrave;res telles que les ch&egrave;ques, virements, effets, et pr&eacute;l&egrave;vements, en fonction de leur &eacute;tat et type.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer des fichiers ICOM1 nationaux vers la BCEAO en traitant les op&eacute;rations financi&egrave;res disponibles.</p><p><strong>Traitement</strong> :</p><p>V&eacute;rifie les param&egrave;tres de compensation manuelle et d'envoi.</p><p>R&eacute;cup&egrave;re les op&eacute;rations financi&egrave;res (ch&egrave;ques, virements, effets, pr&eacute;l&egrave;vements) d'une banque.</p><p>Pr&eacute;pare les op&eacute;rations en fonction de leur type et destination (Banque &agrave; Banque, Banque &agrave; SFD, SFD &agrave; Banque, SFD &agrave; SFD).</p><p>Met &agrave; jour l'&eacute;tat des op&eacute;rations apr&egrave;s traitement.</p><p><strong>M&eacute;thodes</strong></p><p><strong>Icom1NatWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi des fichiers ICOM1.</p><p><strong>feedOperationWithBltOrdre(int j, Operation[] operations, Effets effet)</strong> : Pr&eacute;pare une op&eacute;ration avec un billet &agrave; ordre.</p><p><strong>feedOperationWithBltOrdre45(int j, Operation[] operations, Effets effet)</strong> : Pr&eacute;pare une op&eacute;ration avec un billet &agrave; ordre normalis&eacute;.</p><p><strong>feedOperationWithCheque(int j, Cheques cheque, Operation[] operations)</strong> : Pr&eacute;pare une op&eacute;ration avec un ch&egrave;que.</p><p><strong>feedOperationWithCheque35(int j, Cheques cheque, Operation[] operations)</strong> : Pr&eacute;pare une op&eacute;ration avec un ch&egrave;que de type 35.</p><p><strong>feedOperationWithLtrChange(Operation[] operations, int j, Effets effet)</strong> : Pr&eacute;pare une op&eacute;ration avec une lettre de change.</p><p><strong>feedOperationWithLtrChange46(Operation[] operations, int j, Effets effet)</strong> : Pr&eacute;pare une op&eacute;ration avec une lettre de change normalis&eacute;e.</p><p><strong>feedOperationWithPrelevement(int j, Operation[] operations, Prelevements prelevement)</strong> : Pr&eacute;pare une op&eacute;ration avec un pr&eacute;l&egrave;vement.</p><p><strong>feedOperationWithVirement10(Virements virement, int j, Operation[] operations)</strong> : Pr&eacute;pare une op&eacute;ration avec un virement de type 10.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEALLICOM1</strong> : &Eacute;tat des op&eacute;rations &agrave; traiter.</p><p><strong>CHEACCIMASCANOUNOR</strong> : Type de ch&egrave;que &agrave; traiter.</p><p><strong>VIRSTACLIANCNOR</strong> : Type de virement client&egrave;le &agrave; traiter.</p><p><strong>VIRSTACLINOUNOR</strong> : Type de virement non normalis&eacute; &agrave; traiter.</p><p><strong>VIRBANBANANCNOR</strong> : Type de virement banque &agrave; banque &agrave; traiter.</p><p><strong>VIRMISDISANCNOR</strong> : Type de virement mise &agrave; disposition &agrave; traiter.</p><p><strong>VIRMISDISNOUNOR</strong> : Type de virement mise &agrave; disposition non normalis&eacute; &agrave; traiter.</p><p><strong>BILORDNOUNOR</strong> : Type d'effet billet &agrave; ordre non normalis&eacute; &agrave; traiter.</p><p><strong>LETCHANOUNOR</strong> : Type d'effet lettre de change non normalis&eacute; &agrave; traiter.</p><p><strong>ORDPRENOUNOR</strong> : Type de pr&eacute;l&egrave;vement non normalis&eacute; &agrave; traiter.</p><p><strong>EFFET_NORMALISE</strong> : Indicateur d'effet normalis&eacute;.</p><p><strong>COMPENSATION_MANUELLE</strong> : Indicateur de compensation manuelle.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration ou de l'envoi des fichiers sont g&eacute;r&eacute;es par des logs et des mises &agrave; jour de param&egrave;tres.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types d'op&eacute;rations ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette tache utilise DataBaseJPA pour interagir avec la base de donn&eacute;es et r&eacute;cup&eacute;rer les op&eacute;rations &agrave; traiter.</p>