<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache SmartSFTPWithCertUploader est con&ccedil;ue pour g&eacute;rer le transfert de fichiers via le protocole SFTP (Secure File Transfer Protocol) en utilisant une authentification par certificat. Elle permet de transf&eacute;rer des fichiers vers un serveur distant de mani&egrave;re s&eacute;curis&eacute;e.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : La m&eacute;thode treatFile() est appel&eacute;e pour initier le processus de transfert de fichiers.</p><p><strong>Traitement</strong> : Transf&egrave;re les fichiers vers un serveur SFTP en utilisant une cl&eacute; priv&eacute;e pour l'authentification.</p><p><strong>R&eacute;sultat</strong> : Les fichiers sont transf&eacute;r&eacute;s vers un r&eacute;pertoire distant sp&eacute;cifi&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de connexion ou de transfert sont consign&eacute;es dans les journaux.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Connexion SFTP avec Certificat</strong> : &Eacute;tablit une connexion s&eacute;curis&eacute;e avec le serveur SFTP en utilisant une cl&eacute; priv&eacute;e pour l'authentification.</p><p><strong>Transfert de Fichiers</strong> : Transf&egrave;re les fichiers vers le r&eacute;pertoire distant sp&eacute;cifi&eacute; sur le serveur SFTP.</p><p><strong>Archivage des Fichiers</strong> : D&eacute;place les fichiers transf&eacute;r&eacute;s vers un r&eacute;pertoire d'archives local pour un suivi ult&eacute;rieur.</p><p><strong>Gestion des Sessions</strong> : G&egrave;re les sessions SFTP, y compris la connexion et la d&eacute;connexion s&eacute;curis&eacute;es.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>SFTPHOST</strong> : Adresse du serveur SFTP, obtenue dynamiquement.</p><p><strong>SFTPPORT</strong> : Port du serveur SFTP, avec comme valeur par d&eacute;faut de <strong>22</strong>.</p><p><strong>SFTPUSER</strong> : Nom d'utilisateur pour la connexion SFTP, obtenue dynamiquement.</p><p><strong>SFTPPASSWORD</strong> : Mot de passe pour la connexion SFTP, qui peut &ecirc;tre crypt&eacute;, obtenue dynamiquement.</p><p><strong>SFTPWORKINGDIR</strong> : R&eacute;pertoire distant o&ugrave; les fichiers doivent &ecirc;tre transf&eacute;r&eacute;s, avec comme valeur par d&eacute;faut <strong>/var/etc/SFTPWORKINGDIR</strong>.</p><p><strong>SSH_KEY</strong> : Chemin vers la cl&eacute; priv&eacute;e utilis&eacute;e pour l'authentification SFTP avec comme valeur par d&eacute;faut <strong>/etc/ssh/private_key.pem</strong>.</p><p><strong>CRYPT_TYPE</strong> : Type de cryptage utilis&eacute; pour le mot de passe, si applicable avec comme valeur par d&eacute;faut <strong>AES_256</strong>.</p><p><strong>Exemples d'Utilisation</strong></p><p>Utilis&eacute;e pour automatiser le transfert s&eacute;curis&eacute; de fichiers vers un serveur SFTP dans un environnement d'entreprise, en assurant que les fichiers sont correctement transf&eacute;r&eacute;s et archiv&eacute;s.</p><p><strong>Int&eacute;gration avec d'autres Syst&egrave;mes</strong></p><p>Int&eacute;gr&eacute;e avec des syst&egrave;mes de gestion de fichiers et des bases de donn&eacute;es pour assurer un traitement fiable et efficace des fichiers transf&eacute;r&eacute;s.</p>