<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ChequeRetourCIEWriter est une extension de FlatFileWriter utilis&eacute;e pour envoyer des ch&egrave;ques &quot;Retour&quot; vers le Syst&egrave;me d'Information Bancaire (SIB). Elle traite les ch&egrave;ques en fonction de leur &eacute;tat et les ins&egrave;re dans les tables appropri&eacute;es pour la compensation et le retour.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.cie</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Envoyer les ch&egrave;ques &quot;Retour&quot; vers le SIB pour traitement.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les ch&egrave;ques avec des &eacute;tats sp&eacute;cifiques depuis la base de donn&eacute;es.</p><p>Ins&egrave;re les ch&egrave;ques dans les tables IBUS_CHQ_RET et IBUS_CHQ_COMP selon leur type (Retour, Aller accept&eacute;, Aller rejet&eacute;).</p><p>Met &agrave; jour l'&eacute;tat des ch&egrave;ques apr&egrave;s insertion r&eacute;ussie.</p><p><strong>Attributs</strong></p><p><strong>db</strong> : DataBase - Instance pour l'acc&egrave;s &agrave; la base de donn&eacute;es.</p><p><strong>M&eacute;thodes</strong></p><p><strong>ChequeRetourCIEWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description du processus.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des ch&egrave;ques &quot;Retour&quot; vers le SIB.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPERETREC</strong>, <strong>CETAOPERET</strong> : &Eacute;tats des ch&egrave;ques &agrave; r&eacute;cup&eacute;rer pour le retour.</p><p><strong>CETAOPERETENVSIB</strong>, <strong>CETAOPERETRECENVSIB</strong> : Nouveaux &eacute;tats &agrave; attribuer aux ch&egrave;ques apr&egrave;s envoi r&eacute;ussi.</p><p><strong>CETAOPEALLICOM1ACCENVSIB</strong>, <strong>CETAOPEALLICOM1ACCENVSIBCON</strong> : &Eacute;tats pour les ch&egrave;ques &quot;Aller&quot; accept&eacute;s.</p><p><strong>CETAOPEREJRET</strong>, <strong>CETAOPEREJRETENVSIB</strong> : &Eacute;tats pour les ch&egrave;ques &quot;Aller&quot; rejet&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de l'insertion des ch&egrave;ques sont g&eacute;r&eacute;es par des logs, et un message d'avertissement est enregistr&eacute; en cas d'&eacute;chec.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre extensible, permettant l'ajout de nouvelles fonctionnalit&eacute;s ou l'int&eacute;gration avec d'autres syst&egrave;mes de compensation.</p><p><strong>Utilisation de la Base de Donn&eacute;es</strong> : Utilise DataBase et JDBCXmlReader pour g&eacute;rer les connexions et les op&eacute;rations sur la base de donn&eacute;es.</p>