<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache EffetsAllerTemenosRemisesWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;rer l'envoi des effets vers le syst&egrave;me Temenos. Elle traite les remises d'effets, en les pr&eacute;parant pour l'envoi sous forme de fichiers plats.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.temenos</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Pr&eacute;parer et envoyer des remises d'effets vers le syst&egrave;me Temenos.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les effets associ&eacute;s &agrave; une remise depuis la base de donn&eacute;es.</p><p>G&eacute;n&egrave;re un fichier plat contenant les informations des effets.</p><p>Met &agrave; jour l'&eacute;tat des effets apr&egrave;s traitement.</p><p><strong>M&eacute;thodes</strong></p><p><strong>EffetsAllerTemenosRemisesWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'op&eacute;ration.</p><p><strong>EffetsAllerTemenosRemisesWriter(Remises remise)</strong> : Constructeur qui initialise la remise &agrave; traiter.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de pr&eacute;paration et d'envoi des effets.</p><p><strong>getRemise()</strong> : Retourne la remise en cours de traitement.</p><p><strong>setRemise(Remises remise)</strong> : D&eacute;finit la remise &agrave; traiter.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEERR</strong> : Param&egrave;tre indiquant l'&eacute;tat des op&eacute;rations en erreur.</p><p><strong>CETAOPEVAL</strong> : Param&egrave;tre indiquant l'&eacute;tat des op&eacute;rations valid&eacute;es.</p><p><strong>CETAREMENVSIB</strong> : Param&egrave;tre indiquant l'&eacute;tat des remises envoy&eacute;es au SIB.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la pr&eacute;paration des effets sont g&eacute;r&eacute;es par des logs.</p><p><strong>Extensibilit&eacute;</strong> : La classe peut &ecirc;tre &eacute;tendue pour inclure d'autres types de remises ou pour int&eacute;grer d'autres syst&egrave;mes de gestion de fichiers.</p><p><strong>Utilisation de la Biblioth&egrave;que Apache Commons Lang</strong> : La classe utilise StringUtils de la biblioth&egrave;que Apache Commons Lang pour la manipulation des cha&icirc;nes de caract&egrave;res.</p>