<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache CraT24OBAMoveForUpload est une extension de FlatFileWriter utilis&eacute;e pour d&eacute;placer des fichiers CRA (Comptes Rendus d'Activit&eacute;) vers un r&eacute;pertoire de destination pour le syst&egrave;me T24. Elle surveille un r&eacute;pertoire source pour des fichiers sp&eacute;cifiques et les d&eacute;place tout en g&eacute;rant les sauvegardes des fichiers existants.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.temenos</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : D&eacute;placer les fichiers CRA vers un r&eacute;pertoire de destination pour le syst&egrave;me T24.</p><p><strong>Traitement</strong> :</p><p>Surveille un r&eacute;pertoire source pour des fichiers avec des extensions sp&eacute;cifiques.</p><p>D&eacute;place les fichiers trouv&eacute;s vers un r&eacute;pertoire de destination.</p><p>G&egrave;re les sauvegardes des fichiers existants avant de les &eacute;craser.</p><p><strong>M&eacute;thodes</strong></p><p><strong>CraT24OBAMoveForUpload()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'op&eacute;ration.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de d&eacute;placement des fichiers CRA vers le r&eacute;pertoire de destination.</p><p><strong>moveAndOverwrite(File source, File dest)</strong> : D&eacute;place un fichier source vers une destination, en sauvegardant le fichier de destination s'il existe d&eacute;j&agrave;.</p><p><strong>getNonExistingTempFile(File inputFile)</strong> : G&eacute;n&egrave;re un nom de fichier temporaire qui n'existe pas encore dans le m&ecirc;me r&eacute;pertoire que le fichier d'entr&eacute;e.</p><p><strong>end()</strong> : Termine le processus en enregistrant un &eacute;v&eacute;nement de log.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>SIB_IN_FOLDER</strong> : R&eacute;pertoire source o&ugrave; se trouvent les fichiers CRA.</p><p><strong>DEST_CRA_FOLDER</strong> : R&eacute;pertoire de destination pour les fichiers CRA d&eacute;plac&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors du d&eacute;placement des fichiers sont g&eacute;r&eacute;es par des logs, et la description de l'op&eacute;ration est mise &agrave; jour pour refl&eacute;ter le statut de chaque &eacute;tape.</p><p><strong>Extensibilit&eacute;</strong> : La classe peut &ecirc;tre &eacute;tendue pour inclure d'autres types de fichiers ou pour int&eacute;grer d'autres syst&egrave;mes de gestion de fichiers.</p><p><strong>Utilisation de la Biblioth&egrave;que Apache Commons IO</strong> : La classe utilise FileUtils de la biblioth&egrave;que Apache Commons IO pour les op&eacute;rations de copie de fichiers.</p>