<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache TransferApiAmplitudeResponse est utilis&eacute;e pour repr&eacute;senter la r&eacute;ponse d'une API lors de l'envoi de virements vers le syst&egrave;me Amplitude. Elle contient des informations sur l'op&eacute;ration de transfert, y compris l'identifiant, la r&eacute;f&eacute;rence de l'op&eacute;ration, le nombre de transactions, le montant total, la date de soumission, le statut, et les &eacute;ventuelles erreurs.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates.sfd.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Repr&eacute;senter la r&eacute;ponse d'une API pour les transferts de virements.</p><p><strong>Traitement</strong> :</p><p>Stocke les informations renvoy&eacute;es par l'API apr&egrave;s l'envoi d'une requ&ecirc;te de transfert.</p><p>Fournit des m&eacute;thodes pour acc&eacute;der et modifier ces informations.</p><p><strong>Attributs</strong></p><p><strong>id</strong> : BigInteger - Identifiant unique de l'op&eacute;ration de transfert.</p><p><strong>referenceOperation</strong> : String - R&eacute;f&eacute;rence de l'op&eacute;ration de transfert.</p><p><strong>debitIban</strong> : String - IBAN de d&eacute;bit utilis&eacute; pour le transfert.</p><p><strong>nombreTransaction</strong> : int - Nombre total de transactions dans l'op&eacute;ration de transfert.</p><p><strong>montantTotal</strong> : BigInteger - Montant total des transactions dans l'op&eacute;ration de transfert.</p><p><strong>dateSoumission</strong> : String - Date et heure de soumission de l'op&eacute;ration de transfert, format&eacute;e selon le pattern yyyy-MM-dd'T'HH:mm:ss.SSSXXX.</p><p><strong>statut</strong> : String - Statut actuel de l'op&eacute;ration de transfert.</p><p><strong>error</strong> : GenericError - Objet contenant des informations sur les erreurs &eacute;ventuelles.</p><p><strong>M&eacute;thodes</strong></p><p><strong>TransferApiAmplitudeResponse()</strong> : Constructeur par d&eacute;faut.</p><p><strong>getters et setters</strong> : M&eacute;thodes pour acc&eacute;der et modifier les attributs de la classe.</p><p><strong>toString()</strong> : Retourne une repr&eacute;sentation sous forme de cha&icirc;ne de caract&egrave;res de l'objet, incluant tous ses attributs.</p><p><strong>Composants Internes</strong></p><p><strong>GenericError</strong> : Classe utilis&eacute;e pour repr&eacute;senter les erreurs &eacute;ventuelles dans la r&eacute;ponse de l'API.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>JsonFormat</strong> : Annotation utilis&eacute;e pour sp&eacute;cifier le format de la date de soumission dans la r&eacute;ponse JSON.</p><p><strong>Temporal</strong> : Annotation utilis&eacute;e pour indiquer que l'attribut dateSoumission est de type temporel.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs sont encapsul&eacute;es dans l'attribut error de type GenericError.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres attributs ou m&eacute;thodes si n&eacute;cessaire.</p><p><strong>Configuration</strong> : La classe utilise des annotations pour le formatage JSON et la gestion des dates, permettant une int&eacute;gration facile avec les syst&egrave;mes utilisant ces formats.</p><p><strong>Coordination</strong> : La classe TransferApiAmplitudeResponse coordonne la gestion des r&eacute;ponses de l'API, assurant une repr&eacute;sentation claire et structur&eacute;e des informations de transfert.</p>