<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache PrelevementResultAmplitudeSGBCIReader est con&ccedil;ue pour lire et traiter les fichiers plats contenant des r&eacute;sultats de pr&eacute;l&egrave;vements pour SGBCI, en mettant &agrave; jour les enregistrements dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers plats dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit le fichier pour extraire les informations de pr&eacute;l&egrave;vement.</p><p>Met &agrave; jour les enregistrements de pr&eacute;l&egrave;vements dans la base de donn&eacute;es en fonction des r&eacute;sultats de traitement.</p><p><strong>R&eacute;sultat</strong> : Les pr&eacute;l&egrave;vements sont trait&eacute;s et mis &agrave; jour dans la base de donn&eacute;es.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de traitement sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Utilise BufferedReader pour lire les lignes du fichier et extraire les donn&eacute;es.</p><p><strong>Mise &agrave; Jour des Enregistrements</strong> :</p><p>Utilise DataBaseJPA pour mettre &agrave; jour les enregistrements de pr&eacute;l&egrave;vements dans la base de donn&eacute;es.</p><p>G&egrave;re les informations de pr&eacute;l&egrave;vement telles que le montant, les comptes b&eacute;n&eacute;ficiaires et tireurs, et les d&eacute;tails de l'&eacute;metteur.</p><p>Met &agrave; jour l'&eacute;tat et le motif de rejet des pr&eacute;l&egrave;vements en fonction des r&eacute;sultats de traitement.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>R&eacute;pertoires</strong> : Utilise des objets Repertoires pour g&eacute;rer les r&eacute;pertoires de fichiers.</p><p><strong>Param&egrave;tres de Configuration</strong> :</p><p>CODE_BANQUE_SICA3, ORDPRENOUNOR, CETAOPEALLICOM2, CETAOPERETENVSIB pour la gestion des pr&eacute;l&egrave;vements.</p><p><strong>Interactions avec la Base de Donn&eacute;es</strong></p><p><strong>Requ&ecirc;tes SQL</strong> : Utilise des requ&ecirc;tes SQL pour mettre &agrave; jour les enregistrements de pr&eacute;l&egrave;vements.</p><p><strong>Gestion des Transactions</strong> : Utilise DataBaseJPA pour g&eacute;rer les transactions de base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s et Valeurs Possibles</strong></p><p><strong>CODE_BANQUE_SICA3</strong> : Code de la banque utilis&eacute; pour les pr&eacute;l&egrave;vements.</p><p><strong>ORDPRENOUNOR</strong> : Type de pr&eacute;l&egrave;vement.</p><p><strong>CETAOPEALLICOM2</strong> : &Eacute;tat des pr&eacute;l&egrave;vements accept&eacute;s.</p><p><strong>CETAOPERETENVSIB</strong> : &Eacute;tat des pr&eacute;l&egrave;vements en attente.</p><p><strong>Remarques</strong></p><p><strong>Impl&eacute;mentation Future</strong> : La m&eacute;thode treatFile est partiellement impl&eacute;ment&eacute;e et peut n&eacute;cessiter des ajustements pour g&eacute;rer de nouveaux types de pr&eacute;l&egrave;vements ou de nouvelles exigences de traitement.</p>