<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache IcomaReaderToMailSender est une extension de FlatFileReader qui combine la lecture de fichiers ICOMA et l'envoi de rapports par email. Elle utilise IcomaReader pour traiter les fichiers et IcomaMailSender pour envoyer les rapports g&eacute;n&eacute;r&eacute;s.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.sica.mail</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Traiter les fichiers ICOMA et envoyer les rapports correspondants par email.</p><p><strong>Traitement</strong> :</p><p>Utilise IcomaReader pour lire et traiter les fichiers ICOMA.</p><p>Utilise IcomaMailSender pour g&eacute;n&eacute;rer et envoyer les rapports par email.</p><p>Renomme les fichiers trait&eacute;s pour indiquer qu'ils ont &eacute;t&eacute; termin&eacute;s.</p><p><strong>M&eacute;thodes</strong></p><p><strong>treatFile(File aFile, Repertoires repertoire)</strong> : Traite le fichier ICOMA en utilisant IcomaReader, puis envoie le rapport par email en utilisant IcomaMailSender. Renomme le fichier trait&eacute; pour indiquer qu'il est termin&eacute;.</p><p><strong>closeFile()</strong> : Ferme le fichier apr&egrave;s traitement, en appelant la m&eacute;thode de la classe parente.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>TEMPLATE_ICOMA_REJET</strong> : Chemin du mod&egrave;le d'email pour les rejets, utilis&eacute; par IcomaMailSender.</p><p><strong>TEMPLATE_ICOMA_ACCEPTE</strong> : Chemin du mod&egrave;le d'email pour les acceptations, utilis&eacute; par IcomaMailSender.</p><p><strong>EMAILS_DEST_OPS</strong> : Liste des destinataires des emails, utilis&eacute; par IcomaMailSender.</p><p><strong>SEND_PDF_REPORT</strong> : Indicateur pour envoyer ou non le rapport PDF, utilis&eacute; par IcomaMailSender.</p><p><strong>CONSTANTE_SICA</strong> : Utilis&eacute; pour d&eacute;terminer la source dans IcomaMailSender.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors du traitement des fichiers ou de l'envoi des emails sont g&eacute;r&eacute;es par des logs et des messages d'erreur.</p><p><strong>Extensibilit&eacute;</strong> : La classe peut &ecirc;tre &eacute;tendue pour inclure d'autres types de traitement ou de rapports.</p><p><strong>Int&eacute;gration</strong> : Cette classe int&egrave;gre les fonctionnalit&eacute;s de lecture et d'envoi de rapports, simplifiant ainsi le flux de travail pour le traitement des fichiers ICOMA.</p>