<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache OrdFileWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer et envoyer des fichiers ORD. Ces fichiers contiennent des informations sur les ch&egrave;ques &agrave; traiter, format&eacute;es selon des sp&eacute;cifications pr&eacute;cises.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.uap</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer des fichiers ORD contenant des informations sur les ch&egrave;ques pour un traitement ult&eacute;rieur.</p><p><strong>Traitement</strong> :</p><p>Formate les informations des ch&egrave;ques en une ligne de texte selon un format pr&eacute;d&eacute;fini.</p><p>&Eacute;crit ces lignes dans un fichier ORD.</p><p>G&egrave;re la s&eacute;quence et le nommage des fichiers pour assurer l'unicit&eacute; et la tra&ccedil;abilit&eacute;.</p><p><strong>M&eacute;thodes</strong></p><p><strong>OrdFileWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'op&eacute;ration.</p><p><strong>OrdFileWriter(Cheques[] cheques35, String sequence)</strong> : Constructeur qui initialise les ch&egrave;ques et la s&eacute;quence pour le fichier ORD.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration du fichier ORD.</p><p><strong>listOfFiles(String path)</strong> : Retourne la liste des fichiers dans un r&eacute;pertoire donn&eacute;, avec des logs pour chaque fichier ou r&eacute;pertoire trouv&eacute;.</p><p><strong>listFilesForFolder(File folder)</strong> : Parcourt r&eacute;cursivement un dossier pour lister tous les fichiers, avec des logs pour chaque fichier trouv&eacute;.</p><p><strong>getCheques35()</strong> : Retourne le tableau de ch&egrave;ques.</p><p><strong>setCheques35(Cheques[] cheques35)</strong> : D&eacute;finit le tableau de ch&egrave;ques.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>ORD_FOLDER</strong> : Param&egrave;tre indiquant le r&eacute;pertoire o&ugrave; les fichiers ORD doivent &ecirc;tre enregistr&eacute;s.</p><p><strong>CODE_BANQUE_SICA3</strong> : Code de la banque utilis&eacute; pour d&eacute;terminer le pr&eacute;fixe du fichier ORD.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des fichiers sont g&eacute;r&eacute;es par des logs et des messages d'erreur.</p><p><strong>Extensibilit&eacute;</strong> : La classe peut &ecirc;tre &eacute;tendue pour inclure d'autres types de fichiers ou formats de sortie.</p><p><strong>Utilisation de la Biblioth&egrave;que Apache Commons Lang</strong> : La classe utilise StringUtils de la biblioth&egrave;que Apache Commons Lang pour la manipulation des cha&icirc;nes de caract&egrave;res.</p>