<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache LotBDASFDWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer des fichiers de lot d'op&eacute;rations de pr&eacute;l&egrave;vements pour les banques. Elle traite sp&eacute;cifiquement les pr&eacute;l&egrave;vements et g&eacute;n&egrave;re des fichiers de lot pour les envoyer aux banques.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates.sfd.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer des fichiers de lot de pr&eacute;l&egrave;vements &agrave; la banque.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les pr&eacute;l&egrave;vements &agrave; partir de la base de donn&eacute;es.</p><p>Pr&eacute;pare les ent&ecirc;tes et les op&eacute;rations pour les pr&eacute;l&egrave;vements.</p><p>G&eacute;n&egrave;re des fichiers de lot pour les pr&eacute;l&egrave;vements.</p><p>Met &agrave; jour l'&eacute;tat des pr&eacute;l&egrave;vements dans la base de donn&eacute;es apr&egrave;s traitement.</p><p><strong>Attributs</strong></p><p><strong>sql</strong> : String - Requ&ecirc;te SQL utilis&eacute;e pour r&eacute;cup&eacute;rer les donn&eacute;es.</p><p><strong>refLot</strong> : int - R&eacute;f&eacute;rence du lot en cours de traitement.</p><p><strong>vEnteteLots</strong> : Vector&lt;EnteteLot&gt; - Liste des ent&ecirc;tes de lot pr&eacute;par&eacute;es.</p><p><strong>prelevements25</strong> : List&lt;Prelevements&gt; - Liste de pr&eacute;l&egrave;vements de type 25.</p><p><strong>remcom</strong> : Remcom - Objet repr&eacute;sentant une remise commerciale.</p><p><strong>lotcom</strong> : Lotcom - Objet repr&eacute;sentant un lot commercial.</p><p><strong>lotFile</strong> : String - Nom du fichier de lot g&eacute;n&eacute;r&eacute;.</p><p><strong>remiseHasPrelevements</strong> : boolean - Indicateur de pr&eacute;sence de pr&eacute;l&egrave;vements dans la remise.</p><p><strong>dataBaseJPA</strong> : DataBaseJPA - Instance pour l'acc&egrave;s &agrave; la base de donn&eacute;es.</p><p><strong>parameters</strong> : ConcurrentHashMap&lt;String, Object&gt; - Param&egrave;tres pour les requ&ecirc;tes SQL.</p><p><strong>M&eacute;thodes</strong></p><p><strong>LotBDASFDWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description du processus.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration des fichiers de lot pour les pr&eacute;l&egrave;vements.</p><p><strong>returnEtabsUser(BigDecimal etat)</strong> : R&eacute;cup&egrave;re les &eacute;tablissements utilisateurs pour un &eacute;tat donn&eacute;.</p><p><strong>preparePrelevements(List&lt;Prelevements&gt; prelevements, String user, String codeEmetteur)</strong> : Pr&eacute;pare les pr&eacute;l&egrave;vements pour l'inclusion dans un fichier de lot.</p><p><strong>feedOperationWithPrelevement25(Prelevements prelevement, int j, Operation[] operations)</strong> : Alimente une op&eacute;ration avec les d&eacute;tails d'un pr&eacute;l&egrave;vement.</p><p><strong>fileNameNat(Object obj, EnteteLot enteteLot, String user)</strong> : G&eacute;n&egrave;re le nom de fichier pour un lot national.</p><p><strong>fileNameNat(String codeEmetteur)</strong> : G&eacute;n&egrave;re le nom de fichier pour un lot de pr&eacute;l&egrave;vements.</p><p><strong>printLotPrelevement(List&lt;Prelevements&gt; prelevements, EnteteLot enteteLot, String codeEmetteur)</strong> : Imprime le lot de pr&eacute;l&egrave;vements dans un fichier.</p><p><strong>updateEtatOperations()</strong> : Met &agrave; jour l'&eacute;tat des op&eacute;rations dans la base de donn&eacute;es apr&egrave;s traitement.</p><p><strong>addErrorMessage(String message)</strong> : Ajoute un message d'erreur &agrave; l'interface utilisateur.</p><p><strong>addWarnMessage(String message)</strong> : Ajoute un message d'avertissement &agrave; l'interface utilisateur.</p><p><strong>addInfoMessage(String message)</strong> : Ajoute un message d'information &agrave; l'interface utilisateur.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEVALDELTA</strong> : Utilis&eacute; pour filtrer les op&eacute;rations &agrave; traiter.</p><p><strong>CETAOPEALLICOM1</strong> : Utilis&eacute; pour mettre &agrave; jour l'&eacute;tat des op&eacute;rations apr&egrave;s traitement.</p><p><strong>SIB_IN_FOLDER</strong> : R&eacute;pertoire de destination pour les fichiers g&eacute;n&eacute;r&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des fichiers sont g&eacute;r&eacute;es par des logs et des messages d'erreur.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de transactions ou formats de fichiers.</p><p><strong>Coordination</strong> : La classe LotBDASFDWriter coordonne la g&eacute;n&eacute;ration des fichiers de lot pour les pr&eacute;l&egrave;vements, assurant une gestion efficace des transferts pour les banques.</p>