<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ImalCompteServiceClient est un client de service REST utilis&eacute; pour interagir avec le syst&egrave;me IMAL. Elle permet de r&eacute;cup&eacute;rer les informations de compte via des appels API RESTful.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.forimal</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Fournir une interface pour interagir avec le service REST d'IMAL afin de r&eacute;cup&eacute;rer les informations de compte.</p><p><strong>Traitement</strong> :</p><p>Configure un client REST pour se connecter au service IMAL.</p><p>Envoie des requ&ecirc;tes pour r&eacute;cup&eacute;rer les informations de compte.</p><p>G&egrave;re les erreurs potentielles lors des appels API.</p><p><strong>M&eacute;thodes</strong></p><p><strong>ImalCompteServiceClient()</strong> : Constructeur qui initialise le client REST et configure les param&egrave;tres de connexion.</p><p><strong>returnCompte(CompteRequest request)</strong> : Envoie une requ&ecirc;te pour r&eacute;cup&eacute;rer les informations de compte et retourne la r&eacute;ponse sous forme d'un objet ComptesResponse.</p><p><strong>returnMapper()</strong> : Cr&eacute;e et configure un ObjectMapper pour la s&eacute;rialisation et la d&eacute;s&eacute;rialisation JSON.</p><p><strong>close()</strong> : Ferme le client REST pour lib&eacute;rer les ressources.</p><p><strong>Attributs</strong></p><p><strong>LOG</strong> : Logger pour enregistrer les &eacute;v&eacute;nements et les erreurs.</p><p><strong>fetchCompte</strong> : Cible Web pour les requ&ecirc;tes de r&eacute;cup&eacute;ration de compte.</p><p><strong>client</strong> : Client REST configur&eacute; pour les appels API.</p><p><strong>BASE_URI</strong> : URI de base pour le service REST d'IMAL, r&eacute;cup&eacute;r&eacute; via Utility.getParam(&quot;IMAL_REST_URI&quot;).</p><p><strong>ACCOUNT_REL_URI</strong> : URI relatif pour acc&eacute;der aux informations de compte.</p><p><strong>dataBaseJPA</strong> : Instance de DataBaseJPA pour interagir avec la base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>IMAL_REST_URI</strong> : URI de base pour le service REST d'IMAL, utilis&eacute; pour configurer le client REST.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors des appels API sont captur&eacute;es et trait&eacute;es, avec des codes d'erreur sp&eacute;cifiques d&eacute;finis dans GenericError.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types de requ&ecirc;tes ou de services REST.</p><p><strong>Int&eacute;gration</strong> : Con&ccedil;ue pour &ecirc;tre utilis&eacute;e dans des contextes o&ugrave; les informations de compte doivent &ecirc;tre r&eacute;cup&eacute;r&eacute;es depuis le syst&egrave;me IMAL via des appels API RESTful.</p>