<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache MailoLiteReader est con&ccedil;ue pour lire et traiter les fichiers binaires contenant des informations sur les ch&egrave;ques et effets pour les clients corporatifs, en mettant &agrave; jour les enregistrements dans la base de donn&eacute;es et en int&eacute;grant les images associ&eacute;es dans le syst&egrave;me bancaire.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers binaires dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit le fichier pour extraire les en-t&ecirc;tes et les index d'images.</p><p>Met &agrave; jour ou ins&egrave;re les enregistrements de ch&egrave;ques et d'effets dans la base de donn&eacute;es.</p><p>G&egrave;re les images associ&eacute;es aux ch&egrave;ques et effets, en les stockant dans le r&eacute;pertoire configur&eacute;.</p><p><strong>R&eacute;sultat</strong> : Les enregistrements de ch&egrave;ques et d'effets sont mis &agrave; jour dans la base de donn&eacute;es, et les images sont stock&eacute;es.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de traitement sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Utilise des flux d'entr&eacute;e pour lire les en-t&ecirc;tes et les index d'images des fichiers binaires.</p><p><strong>Mise &agrave; Jour des Enregistrements</strong> :</p><p>Utilise DataBaseJPA pour ex&eacute;cuter des requ&ecirc;tes SQL qui mettent &agrave; jour ou ins&egrave;rent les enregistrements de ch&egrave;ques et d'effets dans la base de donn&eacute;es.</p><p><strong>Gestion des Images</strong> :</p><p>Lit et stocke les images recto et verso des ch&egrave;ques et effets dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>`MAILO_EXT_FOLDER`</strong> : R&eacute;pertoire o&ugrave; les images des ch&egrave;ques et effets sont stock&eacute;es.</p><p><strong>`DELETE_MAILO_CORP`</strong> : Indique si le fichier source doit &ecirc;tre supprim&eacute; apr&egrave;s traitement.</p><p><strong>Interactions avec la Base de Donn&eacute;es</strong></p><p><strong>Requ&ecirc;tes SQL</strong> : Utilise des requ&ecirc;tes SQL pour mettre &agrave; jour ou ins&eacute;rer les enregistrements de ch&egrave;ques et d'effets dans la base de donn&eacute;es.</p><p><strong>Gestion des Transactions</strong> : Utilise DataBaseJPA pour g&eacute;rer les transactions de base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s et Valeurs Possibles</strong></p><p><strong>`CETAOPERET`</strong> :</p><p><strong>Utilisation</strong> : Code d'&eacute;tat pour les op&eacute;rations en attente de traitement.</p><p><strong>`CETAOPERETREC`</strong> :</p><p><strong>Utilisation</strong> : Code d'&eacute;tat pour les op&eacute;rations trait&eacute;es avec succ&egrave;s.</p><p><strong>`CETAOPERETIMA`</strong> :</p><p><strong>Utilisation</strong> : Code d'&eacute;tat pour les op&eacute;rations avec image associ&eacute;e.</p><p><strong>`DELETE_MAILO_CORP`</strong> :</p><p><strong>Utilisation</strong> : Indique si le fichier source doit &ecirc;tre supprim&eacute; apr&egrave;s traitement.</p><p><strong>Valeurs Possibles</strong> : &quot;OUI&quot; pour activ&eacute;, autre pour d&eacute;sactiv&eacute;.</p>