<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache SmartImageEffetSynReader est une extension de FlatFileReader utilis&eacute;e pour lire et traiter les fichiers d'images d'effets synchronis&eacute;s. Elle g&egrave;re la validation des donn&eacute;es, le traitement des images, et l'int&eacute;gration des informations dans le syst&egrave;me bancaire.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers d'images d'effets dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> : V&eacute;rifie les donn&eacute;es des fichiers scann&eacute;s, traite les images des effets, et met &agrave; jour les informations dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Mise &agrave; jour des statuts des effets et des s&eacute;quences dans la base de donn&eacute;es, avec les images des effets d&eacute;plac&eacute;es vers le r&eacute;pertoire appropri&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Fichiers</strong> : Assure la lecture, la validation, et le d&eacute;placement des fichiers d'images d'effets.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Met &agrave; jour les statuts des effets et des s&eacute;quences.</p><p><strong>Traitement d'Images</strong> : Redimensionne et compresse les images des effets.</p><p><strong>V&eacute;rification de Conformit&eacute;</strong> : V&eacute;rifie si les fichiers ont d&eacute;j&agrave; &eacute;t&eacute; trait&eacute;s pour &eacute;viter les doublons.</p><p><strong>Lecture de Codes DataMatrix</strong> : Utilise DataMatrixClient pour extraire et traiter les donn&eacute;es des codes DataMatrix pr&eacute;sents sur les images d'effets. Ces donn&eacute;es sont utilis&eacute;es pour enrichir les informations sur l'effet et v&eacute;rifier son authenticit&eacute;.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>IMG_ALLER_FOLDER</strong> : R&eacute;pertoire de destination pour les images trait&eacute;es.</p><p><strong>ENDOS_SNIPPET_WIDTH</strong> : Largeur du sous-image pour lire le num&eacute;ro d'endossement.</p><p><strong>ENDOS_SNIPPET_HEIGTH</strong> : Hauteur du sous-image pour lire le num&eacute;ro d'endossement.</p><p><strong>COMPRESSION_RATIO</strong> : Ratio de compression pour les images JPEG.</p><p><strong>DELETE_IMAGES_AFTER_READ</strong> : Indicateur pour supprimer les images apr&egrave;s lecture.</p><p><strong>CODE_SICA2</strong> : Code SICA de type 2 pour la conversion des codes num&eacute;riques en alphanum&eacute;riques.</p><p><strong>CODE_SICA3</strong> : Code SICA de type 3 pour la conversion des codes num&eacute;riques en alphanum&eacute;riques.</p><p><strong>STRONG_CHECK_CMC7</strong> : Indicateur pour activer la v&eacute;rification stricte de la ligne CMC7.</p>