<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache LotTemenosWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;rer l'envoi des lots de ch&egrave;ques et d'effets vers le syst&egrave;me Temenos. Elle traite les lots de ch&egrave;ques et d'effets, en les pr&eacute;parant pour l'envoi sous forme de fichiers plats.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.temenos</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Pr&eacute;parer et envoyer des lots de ch&egrave;ques et d'effets vers le syst&egrave;me Temenos.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les ch&egrave;ques et les effets depuis la base de donn&eacute;es.</p><p>G&eacute;n&egrave;re des fichiers plats contenant les informations des ch&egrave;ques et des effets.</p><p>Met &agrave; jour l'&eacute;tat des ch&egrave;ques, des effets et des remises apr&egrave;s traitement.</p><p><strong>M&eacute;thodes</strong></p><p><strong>LotTemenosWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'op&eacute;ration.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de pr&eacute;paration et d'envoi des ch&egrave;ques et des effets.</p><p><strong>prepareCheques(List&lt;Cheques&gt; cheques)</strong> : Pr&eacute;pare les ch&egrave;ques pour l'envoi.</p><p><strong>prepareEffets(List&lt;Effets&gt; effets, String source)</strong> : Pr&eacute;pare les effets pour l'envoi.</p><p><strong>printLotCheque(List&lt;Cheques&gt; cheques, EnteteLot enteteLot)</strong> : G&eacute;n&egrave;re le fichier plat pour un lot de ch&egrave;ques.</p><p><strong>printLotEffet(List&lt;Effets&gt; effets, EnteteLot enteteLot, String source)</strong> : G&eacute;n&egrave;re le fichier plat pour un lot d'effets.</p><p><strong>updateEffets(List&lt;Effets&gt; allEffets)</strong> : Met &agrave; jour l'&eacute;tat des effets apr&egrave;s traitement.</p><p><strong>addErrorMessage(String message, String fromEcran)</strong> : Ajoute un message d'erreur.</p><p><strong>addInfoMessage(String message, String fromEcran)</strong> : Ajoute un message d'information.</p><p><strong>addWarningMessage(String message, String fromEcran)</strong> : Ajoute un message d'avertissement.</p><p><strong>printEnteteLot(EnteteLot enteteLot, String source)</strong> : G&eacute;n&egrave;re l'en-t&ecirc;te du fichier pour un lot.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEVAL</strong> : Param&egrave;tre indiquant l'&eacute;tat des op&eacute;rations valid&eacute;es.</p><p><strong>CETAOPEVAL2</strong> : Param&egrave;tre indiquant un autre &eacute;tat des op&eacute;rations valid&eacute;es.</p><p><strong>CETAOPESAI</strong> : Param&egrave;tre indiquant l'&eacute;tat des op&eacute;rations saisies.</p><p><strong>CETAOPEALLICOM1</strong> : Param&egrave;tre indiquant l'&eacute;tat des op&eacute;rations pr&ecirc;tes pour l'envoi.</p><p><strong>CETAOPEVALSURCAIENVSIB</strong> : Param&egrave;tre indiquant l'&eacute;tat des op&eacute;rations envoy&eacute;es au SIB.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la pr&eacute;paration des ch&egrave;ques et des effets sont g&eacute;r&eacute;es par des logs et des messages d'erreur.</p><p><strong>Extensibilit&eacute;</strong> : La classe peut &ecirc;tre &eacute;tendue pour inclure d'autres types de ch&egrave;ques ou d'effets, ou pour int&eacute;grer d'autres syst&egrave;mes de gestion de fichiers.</p><p><strong>Utilisation de la Biblioth&egrave;que Apache Commons Lang</strong> : La classe utilise StringUtils de la biblioth&egrave;que Apache Commons Lang pour la manipulation des cha&icirc;nes de caract&egrave;res.</p>