<p /><p><strong>Introduction</strong></p><p>La tache ICRCheckReader est con&ccedil;u pour traiter automatiquement les ch&egrave;ques scann&eacute;s accompagn&eacute;s de leur bordereau de remise, en utilisant les capacit&eacute;s de reconnaissance ICR (Intelligent Character Recognition). Il est d&eacute;clench&eacute; via le Gestionnaire de Processus d&egrave;s que des fichiers sont d&eacute;tect&eacute;s dans le r&eacute;pertoire associ&eacute; &agrave; une machine de scan. Ce traitement est particuli&egrave;rement adapt&eacute; pour les institutions bancaires cherchant &agrave; automatiser le traitement des remises tout en garantissant la qualit&eacute; des donn&eacute;es extraites (num&eacute;ros, montants, RIB, etc.). Le composant permet une int&eacute;gration fluide avec la base de donn&eacute;es SmartACCESS et alimente les &eacute;tapes de validation et de compensation.</p><p>&nbsp;</p><p><strong>Description fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong>: Le composant d&eacute;tecte les fichiers d&eacute;pos&eacute;s dans le dossier configur&eacute;.</p><p><strong>Traitement</strong>: Il analyse les images, reconna&icirc;t les caract&egrave;res (montant, num&eacute;ro de compte, etc.), et v&eacute;rifie la coh&eacute;rence avec les bordereaux.</p><p><strong>R&eacute;sultat</strong>: Les donn&eacute;es pr&eacute;par&eacute;es sont aliment&eacute;es dans la base SmartACCESS, et des journaux d&rsquo;ex&eacute;cution sont g&eacute;n&eacute;r&eacute;s et visibles dans le Gestionnaire de Processus.</p><p><strong>En cas d&rsquo;erreur</strong>: Les anomalies sont inscrites dans les journaux avec des codes couleurs (succ&egrave;s, avertissement, erreur) pour faciliter le suivi.</p><p>&nbsp;</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Fichiers</strong> : La classe g&egrave;re les fichiers repr&eacute;sentant les ch&egrave;ques, en s'assurant qu'ils sont complets et non dupliqu&eacute;s.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Elle r&eacute;cup&egrave;re et stocke des informations sur les ch&egrave;ques et les remises dans la base de donn&eacute;es.</p><p><strong>Traitement d'Images</strong> : La classe peut redimensionner les images et les d&eacute;placer vers des r&eacute;pertoires sp&eacute;cifiques.</p><p>&nbsp;</p><p><strong>Param&egrave;tres du composant</strong></p><p /><ol start="1"><li><p /></li></ol><p><strong>RESIZE_THE_IMAGE</strong> :</p><p><strong>Valeurs possibles</strong> : &quot;OUI&quot;, &quot;NON&quot;</p><p><strong>Comportement</strong> :</p><p>Si la valeur est &quot;OUI&quot;, les images seront redimensionn&eacute;es &agrave; une largeur de 1200 pixels lors de leur traitement.</p><p>Si la valeur est &quot;NON&quot;, les images seront copi&eacute;es sans redimensionnement.</p><ol start="2"><li><p /></li></ol><p><strong>IMG_ALLER_FOLDER</strong> :</p><p><strong>Valeur possible</strong> : Chemin d'acc&egrave;s, par exemple, &quot;d:\\image\\aller&quot;</p><p><strong>Comportement</strong> : D&eacute;finit le r&eacute;pertoire de destination pour les images trait&eacute;es.</p><ol start="3"><li><p /></li></ol><p><strong>RVDSTRONGCHECK</strong> :</p><p><strong>Valeurs possibles</strong> : &quot;0&quot;, &quot;1&quot;, &quot;2&quot;</p><p><strong>Comportement</strong> :</p><p>&quot;0&quot; : Les fichiers d&eacute;j&agrave; scann&eacute;s ne sont pas d&eacute;plac&eacute;s ou supprim&eacute;s.</p><p>&quot;1&quot; : Les fichiers d&eacute;j&agrave; scann&eacute;s sont d&eacute;plac&eacute;s vers un r&eacute;pertoire de &quot;junk&quot; sp&eacute;cifi&eacute; par le param&egrave;tre JUNK_FOLDER.</p><p>&quot;2&quot; : Les fichiers d&eacute;j&agrave; scann&eacute;s sont supprim&eacute;s.</p><ol start="4"><li><p /></li></ol><p><strong>JUNK_FOLDER</strong> :</p><p><strong>Valeur possible</strong> : Chemin d'acc&egrave;s, par exemple, &quot;C:/JunkFolder&quot;</p><p><strong>Comportement</strong> : Sp&eacute;cifie le r&eacute;pertoire o&ugrave; les fichiers d&eacute;j&agrave; scann&eacute;s sont d&eacute;plac&eacute;s si RVDSTRONGCHECK est &quot;1&quot;.</p><ol start="5"><li><p /></li></ol><p><strong>STRONG_CHECK_CMC7</strong> :</p><p><strong>Valeurs possibles</strong> : &quot;0&quot;, &quot;1&quot;</p><p><strong>Comportement</strong> :</p><p>&quot;0&quot; : Pas de v&eacute;rification stricte de la longueur de la ligne CMC7.</p><p>&quot;1&quot; : V&eacute;rifie que la ligne CMC7 a une longueur minimale d&eacute;finie par CMC7_MIN_LENGTH.</p><ol start="6"><li><p /></li></ol><p><strong>CMC7_MIN_LENGTH</strong> :</p><p><strong>Valeur possible</strong> : Un entier, par exemple, 30</p><p><strong>Comportement</strong> : D&eacute;finit la longueur minimale requise pour la ligne CMC7 si STRONG_CHECK_CMC7 est &quot;1&quot;.</p><ol start="7"><li><p /></li></ol><p><strong>CETAREMSTO</strong> :</p><p><strong>Valeur possible</strong> : Un code d'&eacute;tat, par exemple, 10</p><p><strong>Comportement</strong> : Utilis&eacute; pour d&eacute;finir l'&eacute;tat d'une remise lors de sa cr&eacute;ation.</p>