<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ChequesAllerTemenosWriterLite est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer et envoyer des fichiers de ch&egrave;ques vers le syst&egrave;me SIB (Syst&egrave;me d'Information Bancaire) dans le cadre d'une migration vers Temenos. Elle traite les remises de ch&egrave;ques et g&eacute;n&egrave;re un fichier plat contenant les informations n&eacute;cessaires pour le traitement. Cette version &quot;Lite&quot; semble &ecirc;tre optimis&eacute;e pour un traitement plus l&eacute;ger ou sp&eacute;cifique.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.temenos</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer un fichier contenant les informations des ch&egrave;ques &agrave; envoyer vers le SIB pour une migration vers Temenos.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les remises de ch&egrave;ques depuis la base de donn&eacute;es.</p><p>Calcule le nombre de ch&egrave;ques.</p><p>G&eacute;n&egrave;re un fichier plat avec les informations des remises et des ch&egrave;ques.</p><p>Met &agrave; jour l'&eacute;tat des remises et des ch&egrave;ques dans la base de donn&eacute;es apr&egrave;s traitement.</p><p><strong>Attributs</strong></p><p><strong>remise</strong> : Remises - Instance de la remise actuellement trait&eacute;e.</p><p><strong>db</strong> : DataBase - Instance de la base de donn&eacute;es utilis&eacute;e pour r&eacute;cup&eacute;rer et mettre &agrave; jour les informations des remises et des ch&egrave;ques.</p><p><strong>M&eacute;thodes</strong></p><p><strong>ChequesAllerTemenosWriterLite()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'op&eacute;ration.</p><p><strong>ChequesAllerTemenosWriterLite(Remises remise)</strong> : Constructeur qui initialise la classe avec une remise sp&eacute;cifique.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi des fichiers de ch&egrave;ques vers le SIB.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEERR</strong> : &Eacute;tat des op&eacute;rations, utilis&eacute; pour marquer les ch&egrave;ques avec des erreurs.</p><p><strong>CETAOPEVAL</strong> : &Eacute;tat des op&eacute;rations, utilis&eacute; pour filtrer les ch&egrave;ques &agrave; traiter.</p><p><strong>SIB_IN_FOLDER</strong> : R&eacute;pertoire de destination pour les fichiers g&eacute;n&eacute;r&eacute;s, o&ugrave; les fichiers de ch&egrave;ques seront stock&eacute;s apr&egrave;s leur cr&eacute;ation.</p><p><strong>CHQ_IN_FILE_ROOTNAME</strong> : Nom de base pour les fichiers de ch&egrave;ques g&eacute;n&eacute;r&eacute;s.</p><p><strong>SIB_FILE_EXTENSION</strong> : Extension des fichiers de ch&egrave;ques g&eacute;n&eacute;r&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des fichiers sont g&eacute;r&eacute;es par des logs, et la description de l'op&eacute;ration est mise &agrave; jour pour refl&eacute;ter le statut de chaque &eacute;tape.</p><p><strong>Extensibilit&eacute;</strong> : La classe peut &ecirc;tre &eacute;tendue pour inclure d'autres types de remises ou pour int&eacute;grer d'autres syst&egrave;mes de traitement de ch&egrave;ques.</p><p><strong>Utilisation de la Base de Donn&eacute;es</strong> : La classe interagit directement avec la base de donn&eacute;es pour r&eacute;cup&eacute;rer et mettre &agrave; jour les informations des remises et des ch&egrave;ques, en utilisant des requ&ecirc;tes SQL pour la persistance des donn&eacute;es.</p>