<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache MailiIntSFDReader est con&ccedil;ue pour lire et traiter les fichiers binaires contenant des informations sur les remises de ch&egrave;ques et d'effets pour les clients SFD (Syst&egrave;mes Financiers D&eacute;centralis&eacute;s), en mettant &agrave; jour les enregistrements dans la base de donn&eacute;es et en int&eacute;grant les valeurs dans le syst&egrave;me bancaire.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers binaires dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit le fichier pour extraire les en-t&ecirc;tes et les index d'images.</p><p>Met &agrave; jour ou ins&egrave;re les enregistrements de ch&egrave;ques et d'effets dans la base de donn&eacute;es.</p><p>G&egrave;re les remises de ch&egrave;ques et d'effets, en v&eacute;rifiant les doublons et en mettant &agrave; jour les &eacute;tats.</p><p>Envoie des notifications par email si configur&eacute;.</p><p><strong>R&eacute;sultat</strong> : Les enregistrements de ch&egrave;ques et d'effets sont mis &agrave; jour dans la base de donn&eacute;es, et les notifications sont envoy&eacute;es.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de traitement sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Utilise des flux d'entr&eacute;e pour lire les en-t&ecirc;tes et les index d'images des fichiers binaires.</p><p><strong>Mise &agrave; Jour des Enregistrements</strong> :</p><p>Utilise DataBaseJPA pour ex&eacute;cuter des requ&ecirc;tes SQL qui mettent &agrave; jour ou ins&egrave;rent les enregistrements de ch&egrave;ques et d'effets dans la base de donn&eacute;es.</p><p>G&egrave;re les doublons en ins&eacute;rant les enregistrements dans une table de doublons.</p><p><strong>Notifications</strong> : Envoie des emails r&eacute;capitulatifs si configur&eacute;.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>`CETAOPEVAL2`</strong> : Code d'&eacute;tat pour les op&eacute;rations valid&eacute;es.</p><p><strong>`CETAOPEVAL`</strong> : Code d'&eacute;tat pour les op&eacute;rations en cours de validation.</p><p><strong>`CETAOPEALLICOM1`</strong> : Code d'&eacute;tat pour les op&eacute;rations en attente de validation.</p><p><strong>`CETAREMERR`</strong> : Code d'&eacute;tat pour les remises en erreur.</p><p><strong>`CETAIMASTO`</strong> : Code d'&eacute;tat pour les images stock&eacute;es.</p><p><strong>Interactions avec la Base de Donn&eacute;es</strong></p><p><strong>Requ&ecirc;tes SQL</strong> : Utilise des requ&ecirc;tes SQL pour mettre &agrave; jour ou ins&eacute;rer les enregistrements de ch&egrave;ques et d'effets dans la base de donn&eacute;es.</p><p><strong>Gestion des Transactions</strong> : Utilise DataBaseJPA pour g&eacute;rer les transactions de base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s et Valeurs Possibles</strong></p><p><strong>`CORPORATE_OFFLINE`</strong> :</p><p><strong>Utilisation</strong> : Indique si le mode hors ligne est activ&eacute; pour les op&eacute;rations corporatives.</p><p><strong>Valeurs Possibles</strong> : &quot;1&quot; pour activ&eacute;, autre pour d&eacute;sactiv&eacute;.</p><p><strong>`VALIDATION_CORP_CHEQUE_AUTO`</strong> :</p><p><strong>Utilisation</strong> : Indique si la validation automatique des ch&egrave;ques corporatifs est activ&eacute;e.</p><p><strong>Valeurs Possibles</strong> : &quot;AUTO&quot; pour activ&eacute;, autre pour d&eacute;sactiv&eacute;.</p><p><strong>`SEND_RECAP_EMAIL`</strong> :</p><p><strong>Utilisation</strong> : Indique si un email r&eacute;capitulatif doit &ecirc;tre envoy&eacute;.</p><p><strong>Valeurs Possibles</strong> : &quot;OUI&quot; pour activ&eacute;, autre pour d&eacute;sactiv&eacute;.</p>