<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache SmartImageChequeDMWithoutSlipReader est une extension de FlatFileReader utilis&eacute;e pour lire et traiter les fichiers d'images de ch&egrave;ques scann&eacute;s sans bordereau. Elle g&egrave;re la validation des donn&eacute;es, le traitement des images, et l'int&eacute;gration des informations dans le syst&egrave;me bancaire.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers d'images de ch&egrave;ques dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> : V&eacute;rifie les donn&eacute;es des fichiers scann&eacute;s, traite les images des ch&egrave;ques, et met &agrave; jour les informations dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Mise &agrave; jour des statuts des ch&egrave;ques et des s&eacute;quences dans la base de donn&eacute;es, avec les images des ch&egrave;ques d&eacute;plac&eacute;es vers le r&eacute;pertoire appropri&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Fichiers</strong> : Assure la lecture, la validation, et le d&eacute;placement des fichiers d'images de ch&egrave;ques.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Met &agrave; jour les statuts des ch&egrave;ques et des s&eacute;quences.</p><p><strong>Traitement d'Images</strong> : Redimensionne et compresse les images des ch&egrave;ques.</p><p><strong>V&eacute;rification de Conformit&eacute;</strong> : V&eacute;rifie si les fichiers ont d&eacute;j&agrave; &eacute;t&eacute; trait&eacute;s pour &eacute;viter les doublons.</p><p><strong>Lecture de Codes DataMatrix</strong> : Utilise BarCodeReader pour extraire et traiter les donn&eacute;es des codes DataMatrix pr&eacute;sents sur les images de ch&egrave;ques. Ces donn&eacute;es sont utilis&eacute;es pour enrichir les informations sur le ch&egrave;que et v&eacute;rifier son authenticit&eacute;.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>IMG_ALLER_FOLDER</strong> : R&eacute;pertoire de destination pour les images trait&eacute;es.</p><p><strong>DT_SNIPPET_X, DT_SNIPPET_Y, DT_SNIPPET_W, DT_SNIPPET_H</strong> : Coordonn&eacute;es et dimensions pour extraire le sous-image contenant le code DataMatrix.</p><p><strong>ENDOS_SNIPPET_WIDTH</strong> : Largeur du sous-image pour lire le num&eacute;ro d'endossement.</p><p><strong>M&eacute;thodes Cl&eacute;s</strong></p><p><strong>setRepertoire</strong> : Configure le r&eacute;pertoire d'attente pour les fichiers &agrave; traiter.</p><p><strong>getAlphaSicaCode</strong> : R&eacute;cup&egrave;re le code alphanum&eacute;rique SICA pour un code num&eacute;rique donn&eacute;.</p><p><strong>resizeUsingJavaAlgo</strong> : Redimensionne une image en utilisant un algorithme Java.</p><p><strong>writeJpeg</strong> : &Eacute;crit un fichier JPEG en d&eacute;finissant la qualit&eacute; de compression.</p><p><strong>secondReadDataMatrixCode</strong> : Lit le code DataMatrix d'une image de ch&egrave;que.</p><p><strong>readNumeroEndos</strong> : Lit le num&eacute;ro d'endossement d'une image de ch&egrave;que.</p><p><strong>treatFile</strong> : Traite un fichier d'image de ch&egrave;que, en g&eacute;rant le d&eacute;placement et la mise &agrave; jour des informations dans la base de donn&eacute;es.</p><p>Cette classe est essentielle pour le traitement automatis&eacute; des ch&egrave;ques scann&eacute;s, garantissant que les informations sont correctement extraites et int&eacute;gr&eacute;es dans le syst&egrave;me bancaire.</p>