<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache LotSFDBankSrgWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer des fichiers de lot d'op&eacute;rations sous-r&eacute;gionales vers la banque. Elle traite diff&eacute;rents types d'op&eacute;rations financi&egrave;res, notamment les virements, les ch&egrave;ques, les effets, et les pr&eacute;l&egrave;vements.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates.sfd.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer des fichiers de lot d'op&eacute;rations sous-r&eacute;gionales &agrave; la banque.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les op&eacute;rations financi&egrave;res &agrave; partir de la base de donn&eacute;es.</p><p>Pr&eacute;pare les ent&ecirc;tes et les op&eacute;rations pour chaque type d'op&eacute;ration.</p><p>G&eacute;n&egrave;re des fichiers de lot pour chaque type d'op&eacute;ration.</p><p>Met &agrave; jour l'&eacute;tat des op&eacute;rations dans la base de donn&eacute;es apr&egrave;s traitement.</p><p><strong>Attributs</strong></p><p><strong>sql</strong> : String - Requ&ecirc;te SQL utilis&eacute;e pour r&eacute;cup&eacute;rer les donn&eacute;es.</p><p><strong>refLot</strong> : int - R&eacute;f&eacute;rence du lot en cours de traitement.</p><p><strong>vEnteteLots</strong> : Vector&lt;EnteteLot&gt; - Liste des ent&ecirc;tes de lot pr&eacute;par&eacute;es.</p><p><strong>cheques</strong> : Cheques[] - Tableau de ch&egrave;ques &agrave; traiter.</p><p><strong>cheques35</strong> : List&lt;Cheques&gt; - Liste de ch&egrave;ques de type 35.</p><p><strong>virements15</strong> : List&lt;Virements&gt; - Liste de virements de type 15.</p><p><strong>effets45</strong> : List&lt;Effets&gt; - Liste d'effets de type 45.</p><p><strong>effets46</strong> : List&lt;Effets&gt; - Liste d'effets de type 46.</p><p><strong>prelevements25</strong> : List&lt;Prelevements&gt; - Liste de pr&eacute;l&egrave;vements de type 25.</p><p><strong>remcom</strong> : Remcom - Objet repr&eacute;sentant une remise commerciale.</p><p><strong>lotcom</strong> : Lotcom - Objet repr&eacute;sentant un lot commercial.</p><p><strong>lotFile</strong> : String - Nom du fichier de lot g&eacute;n&eacute;r&eacute;.</p><p><strong>remiseHasCheques</strong> : boolean - Indicateur de pr&eacute;sence de ch&egrave;ques dans la remise.</p><p><strong>remiseHasEffets</strong> : boolean - Indicateur de pr&eacute;sence d'effets dans la remise.</p><p><strong>remiseHasVirements</strong> : boolean - Indicateur de pr&eacute;sence de virements dans la remise.</p><p><strong>remiseHasPrelevements</strong> : boolean - Indicateur de pr&eacute;sence de pr&eacute;l&egrave;vements dans la remise.</p><p><strong>dataBaseJPA</strong> : DataBaseJPA - Instance pour l'acc&egrave;s &agrave; la base de donn&eacute;es.</p><p><strong>parameters</strong> : ConcurrentHashMap&lt;String, Object&gt; - Param&egrave;tres pour les requ&ecirc;tes SQL.</p><p><strong>M&eacute;thodes</strong></p><p><strong>LotSFDBankSrgWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description du processus.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration des fichiers de lot pour les op&eacute;rations sous-r&eacute;gionales.</p><p><strong>prepareCheques(List&lt;Cheques&gt; cheques, String user)</strong> : Pr&eacute;pare les ch&egrave;ques pour l'inclusion dans un fichier de lot.</p><p><strong>preparePrelevements(List&lt;Prelevements&gt; prelevements, String user)</strong> : Pr&eacute;pare les pr&eacute;l&egrave;vements pour l'inclusion dans un fichier de lot.</p><p><strong>prepareEffets(List&lt;Effets&gt; effets, String user)</strong> : Pr&eacute;pare les effets pour l'inclusion dans un fichier de lot.</p><p><strong>prepareVirements(List&lt;Virements&gt; virements, String user)</strong> : Pr&eacute;pare les virements pour l'inclusion dans un fichier de lot.</p><p><strong>updateEtatOperations()</strong> : Met &agrave; jour l'&eacute;tat des op&eacute;rations dans la base de donn&eacute;es apr&egrave;s traitement.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEVALDELTA</strong> : Utilis&eacute; pour filtrer les op&eacute;rations &agrave; traiter.</p><p><strong>CETAOPELOTGEN</strong> : Utilis&eacute; pour mettre &agrave; jour l'&eacute;tat des op&eacute;rations apr&egrave;s traitement.</p><p><strong>SIB_IN_FOLDER</strong> : R&eacute;pertoire de destination pour les fichiers g&eacute;n&eacute;r&eacute;s.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des fichiers sont g&eacute;r&eacute;es par des logs et des messages d'erreur.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de transactions ou formats de fichiers.</p><p><strong>Coordination</strong> : La classe LotSFDBankSrgWriter coordonne la g&eacute;n&eacute;ration des fichiers de lot pour les transactions sous-r&eacute;gionales, assurant une gestion efficace des transferts pour les banques.</p>