<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache OutgoSousRegionalWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer et envoyer des fichiers de transactions sous-r&eacute;gionales vers la BCEAO. Elle traite diff&eacute;rents types de transactions, y compris les ch&egrave;ques, virements, effets, et pr&eacute;l&egrave;vements, en les organisant en lots pour l'envoi.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.forimal</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer des fichiers de transactions sous-r&eacute;gionales pour la BCEAO en traitant divers types de transactions bancaires.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les transactions &agrave; partir de la base de donn&eacute;es en fonction de leur &eacute;tat et type.</p><p>Organise les transactions en lots et les pr&eacute;pare pour l'envoi.</p><p>G&egrave;re les rejets et les erreurs de traitement.</p><p><strong>M&eacute;thodes</strong></p><p><strong>OutgoSousRegionalWriter()</strong> : Constructeur par d&eacute;faut.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi des fichiers de transactions sous-r&eacute;gionales.</p><p><strong>prepareCheques()</strong> : Pr&eacute;pare les ch&egrave;ques pour l'envoi en les organisant en lots.</p><p><strong>prepareVirements()</strong> : Pr&eacute;pare les virements pour l'envoi en les organisant en lots.</p><p><strong>prepareEffets()</strong> : Pr&eacute;pare les effets pour l'envoi en les organisant en lots.</p><p><strong>preparePrelevements()</strong> : Pr&eacute;pare les pr&eacute;l&egrave;vements pour l'envoi en les organisant en lots.</p><p><strong>prepareRejetEffets()</strong> : Pr&eacute;pare les effets rejet&eacute;s pour l'envoi en les organisant en lots.</p><p><strong>printRemise()</strong> : Imprime les remises pr&eacute;par&eacute;es pour l'envoi.</p><p><strong>Attributs</strong></p><p><strong>sql</strong> : Requ&ecirc;te SQL pour r&eacute;cup&eacute;rer les transactions.</p><p><strong>refLot</strong> : R&eacute;f&eacute;rence du lot courant.</p><p><strong>vEnteteLots</strong> : Liste des ent&ecirc;tes de lots pr&eacute;par&eacute;s pour l'envoi.</p><p><strong>sequence</strong> : S&eacute;quence utilis&eacute;e pour l'identification des lots.</p><p><strong>enteteRemise</strong> : Ent&ecirc;te de la remise courante.</p><p><strong>cheques, virements, effets, prelevements</strong> : Listes des transactions r&eacute;cup&eacute;r&eacute;es pour le traitement.</p><p><strong>remcom, lotcom</strong> : Objets repr&eacute;sentant les remises et lots courants.</p><p><strong>remiseHasCheques, remiseHasEffets, remiseHasVirements, remiseHasPrelevements, remiseHasRejetEffets</strong> : Indicateurs de la pr&eacute;sence de diff&eacute;rents types de transactions dans la remise.</p><p><strong>db</strong> : Instance de DataBaseJPA pour interagir avec la base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPERET, CETAOPERETREC, CETAOPEREJRET</strong> : &Eacute;tats des op&eacute;rations pour filtrer les transactions.</p><p><strong>CHEACCIMASCANOUNOR, VIRSTACLIANCNOR, VIRSTACLINOUNOR, VIRBANBANANCNOR, VIRMISDISANCNOR, VIRMISDISNOUNOR, BILORDNOUNOR, LETCHANOUNOR, ORDPRENOUNOR</strong> : Types de transactions pour filtrer les transactions.</p><p><strong>patternDate</strong> : Format de date utilis&eacute; pour les conversions de date.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors du traitement des transactions sont g&eacute;r&eacute;es et enregistr&eacute;es dans les logs.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types de transactions ou traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Con&ccedil;ue pour &ecirc;tre utilis&eacute;e dans des contextes o&ugrave; les transactions sous-r&eacute;gionales doivent &ecirc;tre g&eacute;r&eacute;es et suivies dans le syst&egrave;me bancaire, en respectant les r&egrave;gles d&eacute;finies par la BCEAO.</p>