<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache InitaMailSender est une extension de FlatFileWriter utilis&eacute;e pour envoyer des emails d'initialisation de p&eacute;riode de compensation. Elle utilise des mod&egrave;les d'email pour formater le contenu et envoie les emails aux destinataires sp&eacute;cifi&eacute;s.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.sica.mail</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Envoyer des emails d'initialisation de p&eacute;riode de compensation.</p><p><strong>Traitement</strong> :</p><p>V&eacute;rifie si le syst&egrave;me de base est &quot;BAOBAB&quot; pour d&eacute;terminer le traitement sp&eacute;cifique &agrave; la BCEAO.</p><p>Utilise un mod&egrave;le d'email pour formater le contenu de l'email.</p><p>Envoie l'email aux destinataires sp&eacute;cifi&eacute;s.</p><p><strong>M&eacute;thodes</strong></p><p><strong>InitaMailSender()</strong> : Constructeur par d&eacute;faut.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi d'email d'initialisation de p&eacute;riode de compensation.</p><p><strong>getTemplateINITA()</strong> : Retourne le chemin du mod&egrave;le d'email INITA.</p><p><strong>setTemplateINITA(String templateINITA)</strong> : D&eacute;finit le chemin du mod&egrave;le d'email INITA.</p><p><strong>getEmailsDest()</strong> : Retourne la liste des destinataires des emails.</p><p><strong>setEmailsDest(String emailsDest)</strong> : D&eacute;finit la liste des destinataires des emails.</p><p><strong>getDateCompensation()</strong> : Retourne la date de compensation.</p><p><strong>setDateCompensation(String dateCompensation)</strong> : D&eacute;finit la date de compensation.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>TEMPLATE_INITA</strong> : Chemin du mod&egrave;le d'email pour l'initialisation.</p><p><strong>EMAILS_DEST_OPS</strong> : Liste des destinataires des emails.</p><p><strong>CORE_SYSTEM</strong> : Indicateur du syst&egrave;me de base utilis&eacute;, pour d&eacute;terminer le traitement sp&eacute;cifique.</p><p><strong>codeBanque</strong> : Code de la banque utilis&eacute; pour r&eacute;cup&eacute;rer les destinataires sp&eacute;cifiques.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de l'envoi des emails sont g&eacute;r&eacute;es par des logs et des messages d'erreur.</p><p><strong>Extensibilit&eacute;</strong> : La classe peut &ecirc;tre &eacute;tendue pour inclure d'autres types de notifications ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette classe utilise JerseyEmailClient pour l'envoi des emails, facilitant ainsi l'int&eacute;gration avec d'autres services de messagerie.</p>