<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache EffetRetourSitWriter est une extension de FlatFileWriter utilis&eacute;e pour envoyer les effets retour vers le SIB (Syst&egrave;me d'Information Bancaire). Elle g&eacute;n&egrave;re un fichier plat contenant les informations des effets retour et met &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.orion</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Envoyer les effets retour vers le SIB en g&eacute;n&eacute;rant un fichier plat et mettre &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Traitement</strong> :</p><p>V&eacute;rifie si le verrouillage des effets retour est activ&eacute;.</p><p>R&eacute;cup&egrave;re les effets retour &agrave; envoyer.</p><p>G&eacute;n&egrave;re un fichier plat avec les informations des effets retour.</p><p>Met &agrave; jour l'&eacute;tat des effets apr&egrave;s envoi.</p><p>G&egrave;re le verrouillage des effets retour pour &eacute;viter les conflits d'acc&egrave;s.</p><p><strong>M&eacute;thodes</strong></p><p><strong>EffetRetourSitWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des effets retour vers le SIB.</p><p><strong>getMessageEffetsRecus()</strong> : Retourne le message des effets re&ccedil;us.</p><p><strong>setMessageEffetsRecus(String messageEffetsRecus)</strong> : D&eacute;finit le message des effets re&ccedil;us.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>LOCK_EFF_RETOUR</strong> : Param&egrave;tre de verrouillage pour &eacute;viter les conflits d'acc&egrave;s lors de la composition des fichiers d'effets retour.</p><p><strong>CETAOPERETREC</strong> : &Eacute;tat des effets retour re&ccedil;us.</p><p><strong>CETAOPERET</strong> : &Eacute;tat des effets retour.</p><p><strong>CETAOPERETENVSIB</strong> : &Eacute;tat des effets apr&egrave;s envoi vers le SIB.</p><p><strong>CETAOPERETRECENVSIB</strong> : &Eacute;tat des effets retour re&ccedil;us apr&egrave;s envoi vers le SIB.</p><p><strong>SIB_IN_FOLDER</strong> : Dossier de destination pour les fichiers g&eacute;n&eacute;r&eacute;s.</p><p><strong>EFF_OUT_FILE_ROOTNAME</strong> : Nom de base pour les fichiers d'effets retour.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de l'envoi des effets retour sont g&eacute;r&eacute;es par des logs et des messages d'avertissement.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types d'effets ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette tache utilise DataBaseJPA pour interagir avec la base de donn&eacute;es et effectuer les mises &agrave; jour n&eacute;cessaires.</p>