<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache VirementAllerWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer et envoyer des fichiers de virements vers un syst&egrave;me externe. Elle traite les virements, met &agrave; jour leur &eacute;tat, et g&eacute;n&egrave;re un fichier plat contenant les d&eacute;tails des virements.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer et envoyer des fichiers de virements, en mettant &agrave; jour les &eacute;tats des virements et en g&eacute;n&eacute;rant un fichier plat avec les d&eacute;tails des virements.</p><p><strong>Traitement</strong> :</p><p>Met &agrave; jour l'&eacute;tat des virements dans la base de donn&eacute;es.</p><p>R&eacute;cup&egrave;re les virements &agrave; traiter et calcule le montant total.</p><p>G&eacute;n&egrave;re un fichier plat contenant les d&eacute;tails des virements.</p><p>Met &agrave; jour l'&eacute;tat des virements apr&egrave;s traitement.</p><p><strong>M&eacute;thodes</strong></p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration et d'envoi des fichiers de virements, en mettant &agrave; jour les &eacute;tats des virements, en g&eacute;n&eacute;rant le fichier plat, et en enregistrant les &eacute;v&eacute;nements dans les logs.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEVALDELTA</strong> : Param&egrave;tre utilis&eacute; pour identifier l'&eacute;tat des virements &agrave; traiter.</p><p><strong>CETAOPEALLICOM1</strong> : Param&egrave;tre utilis&eacute; pour mettre &agrave; jour l'&eacute;tat des virements apr&egrave;s traitement.</p><p><strong>CODE_BANQUE</strong> : Code de la banque utilis&eacute; pour identifier l'&eacute;tablissement.</p><p><strong>CODE_BANQUE_SICA3</strong> : Code de la banque utilis&eacute; pour identifier l'&eacute;tablissement dans le fichier.</p><p><strong>SIB_IN_FOLDER</strong> : R&eacute;pertoire de destination pour le fichier de virements g&eacute;n&eacute;r&eacute;.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors du traitement des virements et de la g&eacute;n&eacute;ration des fichiers sont enregistr&eacute;es dans les logs.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de v&eacute;rifications ou de formats de fichiers si n&eacute;cessaire.</p><p><strong>Configuration</strong> : La classe utilise des composants configurables pour le traitement des virements et la g&eacute;n&eacute;ration des fichiers, permettant une adaptation facile aux besoins sp&eacute;cifiques du syst&egrave;me.</p><p><strong>Fichier Plat</strong> : Le fichier plat g&eacute;n&eacute;r&eacute; contient les d&eacute;tails des virements, y compris le nombre total de virements et le montant total, et est enregistr&eacute; dans le r&eacute;pertoire sp&eacute;cifi&eacute; par SIB_IN_FOLDER.</p>