<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ChequeSurCaisseBIAOSitWriter est une extension de FlatFileWriter utilis&eacute;e pour envoyer les ch&egrave;ques sur caisses vers le SIB (Syst&egrave;me d'Information Bancaire). Elle g&eacute;n&egrave;re un fichier plat contenant les informations des ch&egrave;ques sur caisses &agrave; envoyer et met &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.orion</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Envoyer les ch&egrave;ques sur caisses vers le SIB en g&eacute;n&eacute;rant un fichier plat et mettre &agrave; jour leur &eacute;tat dans la base de donn&eacute;es.</p><p><strong>Traitement</strong> :</p><p>Met &agrave; jour l'&eacute;tat des ch&egrave;ques avec des montants manquants.</p><p>R&eacute;cup&egrave;re les ch&egrave;ques sur caisses &agrave; envoyer.</p><p>G&eacute;n&egrave;re un fichier plat avec les informations des ch&egrave;ques sur caisses.</p><p>Met &agrave; jour l'&eacute;tat des ch&egrave;ques et des remises apr&egrave;s envoi.</p><p><strong>M&eacute;thodes</strong></p><p><strong>ChequeSurCaisseBIAOSitWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des ch&egrave;ques sur caisses vers le SIB.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEERR</strong> : &Eacute;tat des ch&egrave;ques avec erreur de validation.</p><p><strong>CETAOPEVAL</strong> : &Eacute;tat des ch&egrave;ques pr&ecirc;ts &agrave; &ecirc;tre valid&eacute;s.</p><p><strong>CETAOPEVALSURCAIENVSIB</strong> : &Eacute;tat des ch&egrave;ques sur caisses apr&egrave;s envoi.</p><p><strong>CETAREMENVSIB</strong> : &Eacute;tat des remises apr&egrave;s envoi.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de l'envoi des ch&egrave;ques sur caisses sont g&eacute;r&eacute;es par des logs.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types de ch&egrave;ques ou de traitements sp&eacute;cifiques.</p><p><strong>Int&eacute;gration</strong> : Cette tache utilise DataBase pour interagir avec la base de donn&eacute;es et effectuer les mises &agrave; jour n&eacute;cessaires.</p>