<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ImalServiceUtils fournit des utilitaires pour interagir avec le syst&egrave;me IMAL, notamment pour la gestion des ch&egrave;ques. Elle permet de cr&eacute;er, mettre &agrave; jour et r&eacute;cup&eacute;rer le statut des ch&egrave;ques dans IMAL.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.forimal</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Fournir des m&eacute;thodes utilitaires pour g&eacute;rer les interactions avec le syst&egrave;me IMAL concernant les ch&egrave;ques.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re la date d'endossement via un service IMAL.</p><p>Cr&eacute;e un ch&egrave;que dans le syst&egrave;me IMAL.</p><p>Met &agrave; jour un ch&egrave;que avec des images dans IMAL.</p><p>R&eacute;cup&egrave;re le statut d'un ch&egrave;que dans IMAL.</p><p><strong>M&eacute;thodes</strong></p><p><strong>ImalServiceUtils()</strong> : Constructeur par d&eacute;faut.</p><p><strong>returnDateEndos()</strong> : R&eacute;cup&egrave;re la date d'endossement &agrave; partir du service IMAL.</p><p><strong>createChequeInImal(Cheques cheque)</strong> : Cr&eacute;e un ch&egrave;que dans le syst&egrave;me IMAL et met &agrave; jour ses informations.</p><p><strong>updateChequeInImal(Cheques cheque)</strong> : Met &agrave; jour un ch&egrave;que avec des images dans le syst&egrave;me IMAL.</p><p><strong>fetchChequeStatusInImal(Cheques cheque)</strong> : R&eacute;cup&egrave;re le statut d'un ch&egrave;que dans le syst&egrave;me IMAL et met &agrave; jour ses informations en cons&eacute;quence.</p><p><strong>Attributs</strong></p><p><strong>LOG</strong> : Logger pour enregistrer les &eacute;v&eacute;nements et les erreurs.</p><p><strong>dataBaseJPA</strong> : Instance de DataBaseJPA pour interagir avec la base de donn&eacute;es.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPEALLICOM1</strong> : &Eacute;tat des ch&egrave;ques apr&egrave;s mise &agrave; jour avec image.</p><p><strong>CETAOPEALLICOM1ACC</strong> : &Eacute;tat des ch&egrave;ques valid&eacute;s par BIS.</p><p><strong>CETAOPEALLICOM1ACCENVSIB</strong> : &Eacute;tat des ch&egrave;ques apr&egrave;s envoi vers SIB.</p><p><strong>CETAOPEANO</strong> : &Eacute;tat des ch&egrave;ques annul&eacute;s ou rejet&eacute;s.</p><p><strong>CETAOPEVAL2</strong> : &Eacute;tat des ch&egrave;ques en cours de validation.</p><p><strong>CETAOPEREJRET</strong> : &Eacute;tat des ch&egrave;ques rejet&eacute;s apr&egrave;s compensation.</p><p><strong>DATECOMPENS_NAT</strong> : Date de compensation nationale.</p><p><strong>DATECOMPENS_SRG</strong> : Date de compensation r&eacute;gionale.</p><p><strong>CODE_SICA3</strong> : Code SICA3 pour la g&eacute;n&eacute;ration du MICR.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors des interactions avec le syst&egrave;me IMAL sont g&eacute;r&eacute;es et enregistr&eacute;es dans les logs.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres interactions ou services li&eacute;s &agrave; IMAL.</p><p><strong>Int&eacute;gration</strong> : Con&ccedil;ue pour &ecirc;tre utilis&eacute;e dans des contextes o&ugrave; les ch&egrave;ques doivent &ecirc;tre g&eacute;r&eacute;s et suivis dans le syst&egrave;me IMAL.</p>