<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ImalResponseObject est un mod&egrave;le de donn&eacute;es utilis&eacute; pour repr&eacute;senter la r&eacute;ponse d'une transaction dans le contexte du syst&egrave;me IMAL. Elle est con&ccedil;ue pour &ecirc;tre s&eacute;rialis&eacute;e et d&eacute;s&eacute;rialis&eacute;e en JSON, facilitant ainsi l'&eacute;change de donn&eacute;es entre les syst&egrave;mes.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.forimal</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Repr&eacute;senter la r&eacute;ponse d'une transaction de mani&egrave;re structur&eacute;e pour l'int&eacute;gration avec le syst&egrave;me IMAL.</p><p><strong>Traitement</strong> :</p><p>Fournit des getters et setters pour acc&eacute;der et modifier les attributs de la r&eacute;ponse.</p><p>Utilise l'annotation @JsonInclude pour exclure les champs null lors de la s&eacute;rialisation JSON.</p><p><strong>Attributs</strong></p><p><strong>message</strong> : Message de la r&eacute;ponse, par exemple, &quot;Remise cheque effectu&eacute;e avec succ&egrave;s&quot;.</p><p><strong>status</strong> : Statut de la transaction, par exemple, &quot;PENDING&quot; ou &quot;En cours&quot;.</p><p><strong>motif</strong> : Motif de la r&eacute;ponse, s'il y a lieu.</p><p><strong>code</strong> : Code associ&eacute; &agrave; la r&eacute;ponse.</p><p><strong>date</strong> : Date de la transaction ou de la r&eacute;ponse.</p><p><strong>transaction</strong> : Objet Transaction contenant des d&eacute;tails sp&eacute;cifiques de la transaction.</p><p><strong>errors</strong> : Objet GenericError pour capturer les erreurs &eacute;ventuelles.</p><p><strong>M&eacute;thodes</strong></p><p><strong>ImalResponseObject()</strong> : Constructeur par d&eacute;faut.</p><p><strong>Getters et Setters</strong> : Pour chaque attribut, permettant l'acc&egrave;s et la modification des valeurs.</p><p><strong>toString()</strong> : Retourne une repr&eacute;sentation en cha&icirc;ne de caract&egrave;res de l'objet, incluant tous ses attributs.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>Aucun param&egrave;tre sp&eacute;cifique mentionn&eacute;</strong> : La tache est un mod&egrave;le de donn&eacute;es et ne d&eacute;pend pas de param&egrave;tres externes pour son fonctionnement. Elle est con&ccedil;ue pour &ecirc;tre utilis&eacute;e dans des contextes o&ugrave; les r&eacute;ponses de transaction doivent &ecirc;tre &eacute;chang&eacute;es avec le syst&egrave;me IMAL ou d'autres syst&egrave;mes compatibles JSON.</p><p><strong>Remarques</strong></p><p><strong>S&eacute;rialisation JSON</strong> : La tache est configur&eacute;e pour exclure les champs null lors de la conversion en JSON, ce qui est utile pour r&eacute;duire la taille des donn&eacute;es &eacute;chang&eacute;es et &eacute;viter les valeurs ind&eacute;sirables.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure des attributs suppl&eacute;mentaires si n&eacute;cessaire pour d'autres int&eacute;grations ou fonctionnalit&eacute;s.</p><p><strong>Int&eacute;gration</strong> : Con&ccedil;ue pour &ecirc;tre utilis&eacute;e dans des contextes o&ugrave; les r&eacute;ponses de transaction doivent &ecirc;tre &eacute;chang&eacute;es avec le syst&egrave;me IMAL ou d'autres syst&egrave;mes compatibles JSON.</p>