<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache MiseEnPortefeuilleChequesAllerImalWriter est une extension de FlatFileWriter utilis&eacute;e pour traiter et envoyer des ch&egrave;ques aller vers le syst&egrave;me IMAL. Elle g&egrave;re la mise en portefeuille des ch&egrave;ques en v&eacute;rifiant les comptes internes et en mettant &agrave; jour les informations des ch&egrave;ques dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.forimal</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Traiter et envoyer des ch&egrave;ques aller vers IMAL en respectant le sch&eacute;ma comptable d&eacute;fini.</p><p><strong>Traitement</strong> :</p><p>V&eacute;rifie la configuration des comptes internes n&eacute;cessaires pour le traitement.</p><p>R&eacute;cup&egrave;re les ch&egrave;ques aller disponibles pour le traitement.</p><p>Met &agrave; jour les informations des ch&egrave;ques et les envoie vers IMAL.</p><p>G&egrave;re les verrous pour &eacute;viter les traitements concurrents.</p><p><strong>M&eacute;thodes</strong></p><p><strong>MiseEnPortefeuilleChequesAllerImalWriter()</strong> : Constructeur par d&eacute;faut.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de mise en portefeuille des ch&egrave;ques aller vers IMAL.</p><p><strong>fetchCheques()</strong> : R&eacute;cup&egrave;re les ch&egrave;ques aller disponibles pour le traitement &agrave; partir de la base de donn&eacute;es.</p><p><strong>Attributs</strong></p><p><strong>dataBaseJPA</strong> : Instance de DataBaseJPA pour interagir avec la base de donn&eacute;es.</p><p><strong>parameters</strong> : Map pour stocker les param&egrave;tres de requ&ecirc;te.</p><p><strong>LOG</strong> : Logger pour enregistrer les &eacute;v&eacute;nements et les erreurs.</p><p><strong>valeurEncaissementNonDisponible</strong> : Compte pour les valeurs &agrave; l'encaissement non disponibles.</p><p><strong>cptClienteleExigibleEncaissement</strong> : Compte pour la client&egrave;le exigible apr&egrave;s encaissement.</p><p><strong>cptRecouvrement</strong> : Compte de recouvrement.</p><p><strong>cptContrePartieClient</strong> : Compte de contrepartie pour le recouvrement client.</p><p><strong>cptFraisBCEAO</strong> : Compte pour les frais BCEAO.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CPT_ENCAISSEMENT_NON_DISPONIBLE</strong> : Compte pour les valeurs &agrave; l'encaissement non disponibles.</p><p><strong>CPT_CLIENTELE_EXIGIBLE_ENCAISSEMENT</strong> : Compte pour la client&egrave;le exigible apr&egrave;s encaissement.</p><p><strong>CPT_RECOUVREMENT</strong> : Compte de recouvrement.</p><p><strong>CPT_CONTREPARTIE_CLIENT</strong> : Compte de contrepartie pour le recouvrement client.</p><p><strong>CPT_FRAIS_BCEAO</strong> : Compte pour les frais BCEAO.</p><p><strong>LOCK_CHK_ALL_PORT_COMPENSE</strong> : Param&egrave;tre pour g&eacute;rer le verrouillage du traitement des ch&egrave;ques.</p><p><strong>CETAOPEALLICOM1ACC</strong> : &Eacute;tat des ch&egrave;ques apr&egrave;s mise &agrave; jour.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors du traitement des ch&egrave;ques sont g&eacute;r&eacute;es et enregistr&eacute;es dans les logs.</p><p style="margin-left: 30.0px;"><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres traitements ou v&eacute;rifications sp&eacute;cifiques aux ch&egrave;ques.</p><p><strong>Int&eacute;gration</strong> : Con&ccedil;ue pour &ecirc;tre utilis&eacute;e dans des contextes o&ugrave; les ch&egrave;ques doivent &ecirc;tre g&eacute;r&eacute;s et suivis dans le syst&egrave;me IMAL, en respectant les r&egrave;gles comptables d&eacute;finies.</p>