<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache SmartImageChequeDMReaderBkp est une extension de FlatFileReader utilis&eacute;e pour lire et traiter les fichiers d'images de ch&egrave;ques scann&eacute;s. Elle g&egrave;re la validation des donn&eacute;es, le traitement des images, et l'int&eacute;gration des informations dans le syst&egrave;me bancaire.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers d'images de ch&egrave;ques dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> : V&eacute;rifie les donn&eacute;es des fichiers scann&eacute;s, traite les images des ch&egrave;ques, et met &agrave; jour les informations dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Mise &agrave; jour des statuts des ch&egrave;ques et des s&eacute;quences dans la base de donn&eacute;es, avec les images des ch&egrave;ques d&eacute;plac&eacute;es vers le r&eacute;pertoire appropri&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Fichiers</strong> : Assure la lecture, la validation, et le d&eacute;placement des fichiers d'images de ch&egrave;ques.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Met &agrave; jour les statuts des ch&egrave;ques et des s&eacute;quences.</p><p><strong>Traitement d'Images</strong> : Redimensionne et compresse les images des ch&egrave;ques.</p><p><strong>V&eacute;rification de Conformit&eacute;</strong> : V&eacute;rifie si les fichiers ont d&eacute;j&agrave; &eacute;t&eacute; trait&eacute;s pour &eacute;viter les doublons.</p><p><strong>Lecture de Codes DataMatrix</strong> : Utilise DataMatrixClient pour extraire et traiter les donn&eacute;es des codes DataMatrix pr&eacute;sents sur les images de ch&egrave;ques. Ces donn&eacute;es sont utilis&eacute;es pour enrichir les informations sur le ch&egrave;que et v&eacute;rifier son authenticit&eacute;.</p><p><strong>D&eacute;tection des Coordonn&eacute;es de la DataMatrix</strong></p><p><strong>Param&egrave;tres de Configuration</strong> : Les coordonn&eacute;es et la taille du sous-image contenant le code DataMatrix sont d&eacute;finies par des param&egrave;tres configurables :</p><p>DT_SNIPPET_X, DT_SNIPPET_Y, DT_SNIPPET_W, DT_SNIPPET_H: Coordonn&eacute;es et dimensions pour les images de taille standard.</p><p>DT_SNIPPET_X1, DT_SNIPPET_Y1, DT_SNIPPET_W1, DT_SNIPPET_H1: Coordonn&eacute;es et dimensions pour les grandes images.</p><p><strong>Extraction du Sous-Image</strong> : Ces param&egrave;tres sont utilis&eacute;s pour extraire un sous-image de l'image compl&egrave;te du ch&egrave;que, qui est ensuite trait&eacute; pour lire le code DataMatrix.</p><p><strong>Traitement des Exceptions</strong> : Si la lecture du code &eacute;choue, un service Python est appel&eacute; pour tenter de lire le code DataMatrix.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>IMG_ALLER_FOLDER</strong> : R&eacute;pertoire de destination pour les images trait&eacute;es.</p><p><strong>CODE_SICA2</strong> et <strong>CODE_SICA3</strong> : Param&egrave;tres pour la conversion des codes num&eacute;riques en codes alphanum&eacute;riques.</p><p><strong>COMPRESSION_RATIO</strong> : Ratio de compression pour les images.</p>