<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache PrelevementRetourAmplitudeWriter est une extension de FlatFileWriter utilis&eacute;e pour g&eacute;n&eacute;rer des fichiers de retour pour les pr&eacute;l&egrave;vements destin&eacute;s &agrave; NSIA. Elle traite les pr&eacute;l&egrave;vements en retour, g&eacute;n&egrave;re un fichier plat contenant les d&eacute;tails des pr&eacute;l&egrave;vements, et enregistre ces fichiers dans un r&eacute;pertoire sp&eacute;cifi&eacute;.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : G&eacute;n&eacute;rer des fichiers de retour pour les pr&eacute;l&egrave;vements destin&eacute;s &agrave; NSIA, en traitant les pr&eacute;l&egrave;vements en retour et en g&eacute;n&eacute;rant un fichier plat avec les d&eacute;tails des pr&eacute;l&egrave;vements.</p><p><strong>Traitement</strong> :</p><p>R&eacute;cup&egrave;re les pr&eacute;l&egrave;vements en retour depuis la base de donn&eacute;es.</p><p>G&eacute;n&egrave;re un fichier plat contenant les d&eacute;tails des pr&eacute;l&egrave;vements.</p><p>Met &agrave; jour l'&eacute;tat des pr&eacute;l&egrave;vements apr&egrave;s traitement.</p><p>Enregistre les fichiers g&eacute;n&eacute;r&eacute;s dans le r&eacute;pertoire sp&eacute;cifi&eacute; par SIB_IN_FOLDER.</p><p><strong>M&eacute;thodes</strong></p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration des fichiers de retour, en r&eacute;cup&eacute;rant les pr&eacute;l&egrave;vements en retour, en g&eacute;n&eacute;rant les fichiers plats, en mettant &agrave; jour l'&eacute;tat des pr&eacute;l&egrave;vements, et en enregistrant les &eacute;v&eacute;nements dans les logs.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>CETAOPERET</strong> : Param&egrave;tre utilis&eacute; pour identifier l'&eacute;tat des pr&eacute;l&egrave;vements en retour.</p><p><strong>CETAOPERETREC</strong> : Param&egrave;tre utilis&eacute; pour identifier un autre &eacute;tat des pr&eacute;l&egrave;vements en retour.</p><p><strong>CETAOPERETENVSIB</strong> : Param&egrave;tre utilis&eacute; pour identifier l'&eacute;tat des pr&eacute;l&egrave;vements apr&egrave;s envoi.</p><p><strong>SIB_IN_FOLDER</strong> : R&eacute;pertoire de destination pour les fichiers de retour g&eacute;n&eacute;r&eacute;s.</p><p><strong>CODE_BANQUE_SICA3</strong> : Code de la banque utilis&eacute; dans le fichier plat.</p><p><strong>CODEMEPREL</strong> : Code utilis&eacute; dans le nom du fichier pour identifier le type de pr&eacute;l&egrave;vement.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors du traitement des pr&eacute;l&egrave;vements et de la g&eacute;n&eacute;ration des fichiers sont enregistr&eacute;es dans les logs.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de v&eacute;rifications ou de formats de fichiers si n&eacute;cessaire.</p><p><strong>Configuration</strong> : La classe utilise des composants configurables pour le traitement des pr&eacute;l&egrave;vements et la g&eacute;n&eacute;ration des fichiers, permettant une adaptation facile aux besoins sp&eacute;cifiques du syst&egrave;me.</p><p><strong>Fichier Plat</strong> : Le fichier plat g&eacute;n&eacute;r&eacute; contient les d&eacute;tails des pr&eacute;l&egrave;vements, y compris le montant total, le nombre de pr&eacute;l&egrave;vements, et d'autres informations pertinentes, et est enregistr&eacute; dans le r&eacute;pertoire sp&eacute;cifi&eacute; par SIB_IN_FOLDER.</p>