<p><strong>SmartChequeWithoutSlipReader</strong></p><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache SmartChequeWithoutSlipReader est con&ccedil;ue pour lire, traiter et sauvegarder les fichiers de ch&egrave;ques scann&eacute;s sans bordereau. Elle int&egrave;gre les informations dans le syst&egrave;me et applique des v&eacute;rifications de conformit&eacute; pour assurer l'int&eacute;grit&eacute; des donn&eacute;es.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : La classe est activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers de ch&egrave;ques scann&eacute;s dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> : Elle v&eacute;rifie les donn&eacute;es des fichiers scann&eacute;s, traite les images des ch&egrave;ques, applique des tatouages num&eacute;riques, et met &agrave; jour les informations dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Les statuts des ch&egrave;ques et des s&eacute;quences sont mis &agrave; jour dans la base de donn&eacute;es, et les images des ch&egrave;ques sont d&eacute;plac&eacute;es vers le r&eacute;pertoire appropri&eacute;.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Gestion des Fichiers</strong> : La classe assure la lecture, la validation, et le d&eacute;placement des fichiers de ch&egrave;ques scann&eacute;s.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> : Elle met &agrave; jour les statuts des ch&egrave;ques et des s&eacute;quences.</p><p><strong>Traitement d'Images</strong> : Elle redimensionne, tatoue et d&eacute;place les images des ch&egrave;ques.</p><p><strong>V&eacute;rification des Codes SICA</strong> : La classe int&egrave;gre la conversion des codes num&eacute;riques en codes alphanum&eacute;riques pour les banques.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>IMG_ALLER_FOLDER</strong> : R&eacute;pertoire de destination pour les images trait&eacute;es.</p><p><strong>CODE_SICA2</strong> et <strong>CODE_SICA3</strong> : Param&egrave;tres pour la conversion des codes num&eacute;riques en codes alphanum&eacute;riques.</p><p><strong>CETAOPESTO</strong> et <strong>CETAIMASTO</strong> : Statuts utilis&eacute;s pour les op&eacute;rations et les images des ch&egrave;ques.</p><p><strong>Exemples d'Utilisation</strong></p><p>La classe est utilis&eacute;e pour valider, traiter et sauvegarder les ch&egrave;ques scann&eacute;s sans bordereau dans un environnement bancaire.</p><p><strong>Int&eacute;gration avec d'autres Syst&egrave;mes</strong></p><p>Elle est int&eacute;gr&eacute;e avec le syst&egrave;me de gestion des ch&egrave;ques, les services de tatouage num&eacute;rique, et les bases de donn&eacute;es pour la gestion des s&eacute;quences et des ch&egrave;ques.</p>