<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache FichiersRetoursSitWriter est une extension de FlatFileWriter utilis&eacute;e pour orchestrer l'envoi des fichiers de retour vers le SIB (Syst&egrave;me d'Information Bancaire). Elle ex&eacute;cute plusieurs processus d'&eacute;criture pour diff&eacute;rents types de fichiers de retour et g&egrave;re les messages associ&eacute;s &agrave; chaque type de fichier.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.orion</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Coordonner l'envoi des fichiers de retour vers le SIB en ex&eacute;cutant plusieurs &eacute;crivains de fichiers de retour et en collectant les messages associ&eacute;s.</p><p><strong>Traitement</strong> :</p><p>Ex&eacute;cute une s&eacute;rie de classes d'&eacute;criture de fichiers de retour, chacune responsable d'un type sp&eacute;cifique de fichier de retour.</p><p>Collecte et stocke les messages associ&eacute;s &agrave; chaque type de fichier de retour.</p><p><strong>M&eacute;thodes</strong></p><p><strong>FichiersRetoursSitWriter()</strong> : Constructeur par d&eacute;faut qui initialise la description de l'envoi.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus d'envoi des fichiers de retour en appelant les m&eacute;thodes execute() de plusieurs classes d'&eacute;criture de fichiers de retour et collecte les messages associ&eacute;s.</p><p><strong>Classes d'&Eacute;criture de Fichiers de Retour Ex&eacute;cut&eacute;es</strong></p><p><strong>ChequeRetourSitWriter</strong> : G&egrave;re l'envoi des ch&egrave;ques retour.</p><p><strong>EffetRetourSitWriter</strong> : G&egrave;re l'envoi des effets retour.</p><p><strong>VirementRetourSitWriter</strong> : G&egrave;re l'envoi des virements retour.</p><p><strong>ChequeRejeteSitWriter</strong> : G&egrave;re l'envoi des ch&egrave;ques rejet&eacute;s.</p><p><strong>EffetAllerRejeteSitWriter</strong> : G&egrave;re l'envoi des effets aller rejet&eacute;s.</p><p><strong>PrelevementRetourSitWriter</strong> : G&egrave;re l'envoi des pr&eacute;l&egrave;vements retour.</p><p><strong>Attributs</strong></p><p><strong>messageChequesRecus</strong> : Message des ch&egrave;ques re&ccedil;us.</p><p><strong>messageVirementsRecus</strong> : Message des virements re&ccedil;us.</p><p><strong>messageEffetsRecus</strong> : Message des effets re&ccedil;us.</p><p><strong>messagePrelevementsRecus</strong> : Message des pr&eacute;l&egrave;vements re&ccedil;us.</p><p><strong>messageChequesRejetesRecus</strong> : Message des ch&egrave;ques rejet&eacute;s re&ccedil;us.</p><p><strong>messageEffetsRejetesRecus</strong> : Message des effets rejet&eacute;s re&ccedil;us.</p><p><strong>messagePrelevementsRejetesRecus</strong> : Message des pr&eacute;l&egrave;vements rejet&eacute;s re&ccedil;us.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>LOCK_EFF_RETOUR</strong> : Param&egrave;tre de verrouillage pour &eacute;viter les conflits d'acc&egrave;s lors de la composition des fichiers d'effets retour.</p><p><strong>CETAOPERETREC</strong> : &Eacute;tat des effets retour re&ccedil;us.</p><p><strong>CETAOPERET</strong> : &Eacute;tat des effets retour.</p><p><strong>CETAOPERETENVSIB</strong> : &Eacute;tat des effets apr&egrave;s envoi vers le SIB.</p><p><strong>CETAOPERETRECENVSIB</strong> : &Eacute;tat des effets retour re&ccedil;us apr&egrave;s envoi vers le SIB.</p><p><strong>SIB_IN_FOLDER</strong> : Dossier de destination pour les fichiers g&eacute;n&eacute;r&eacute;s.</p><p><strong>EFF_OUT_FILE_ROOTNAME</strong> : Nom de base pour les fichiers d'effets retour.</p><p><strong>Remarques</strong></p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure d'autres types de fichiers de retour ou pour modifier l'ordre d'ex&eacute;cution des &eacute;crivains de fichiers.</p><p><strong>Int&eacute;gration</strong> : Cette tache sert de point central pour l'ex&eacute;cution coordonn&eacute;e des processus d'&eacute;criture de fichiers de retour, facilitant ainsi la gestion des envois vers le SIB.</p>