<p /><p><strong>Description</strong> : La tache SmartActionSFTPCleverDownloader est con&ccedil;ue pour t&eacute;l&eacute;charger des fichiers depuis un serveur SFTP suite &agrave; une action comme un bouton. Elle g&egrave;re la connexion s&eacute;curis&eacute;e, le t&eacute;l&eacute;chargement des fichiers, et la gestion des erreurs.</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : La m&eacute;thode execute() est appel&eacute;e pour initier le processus de t&eacute;l&eacute;chargement.</p><p><strong>Traitement</strong> : &Eacute;tablit une connexion SFTP s&eacute;curis&eacute;e, t&eacute;l&eacute;charge les fichiers sp&eacute;cifi&eacute;s, et g&egrave;re les erreurs potentielles.</p><p><strong>R&eacute;sultat</strong> : Les fichiers sont t&eacute;l&eacute;charg&eacute;s avec succ&egrave;s depuis le serveur SFTP.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de connexion ou de t&eacute;l&eacute;chargement sont consign&eacute;es dans les journaux.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Connexion SFTP</strong> : &Eacute;tablit une connexion s&eacute;curis&eacute;e au serveur SFTP en utilisant un nom d'utilisateur et un mot de passe, ou une cl&eacute; priv&eacute;e.</p><p><strong>T&eacute;l&eacute;chargement de Fichiers</strong> : T&eacute;l&eacute;charge les fichiers sp&eacute;cifi&eacute;s depuis le r&eacute;pertoire distant sur le serveur SFTP vers un r&eacute;pertoire local.</p><p><strong>Gestion des Erreurs</strong> : G&egrave;re les erreurs de connexion et de t&eacute;l&eacute;chargement.</p><p><strong>Suppression des Fichiers</strong> : Supprime les fichiers t&eacute;l&eacute;charg&eacute;s du serveur SFTP apr&egrave;s un t&eacute;l&eacute;chargement r&eacute;ussi.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>SFTPHOST</strong> : Adresse du serveur SFTP, obtenue dynamiquement &agrave; partir de l'identifiant du r&eacute;pertoire.</p><p><strong>SFTPPORT</strong> : Port du serveur SFTP, avec une valeur par d&eacute;faut de <strong>22 </strong>si non sp&eacute;cifi&eacute;e.</p><p><strong>SFTPUSER</strong> : Nom d'utilisateur pour la connexion SFTP, obtenu dynamiquement.</p><p><strong>SFTPPASSWORD</strong> : Mot de passe pour la connexion SFTP, obtenu dynamiquement.</p><p><strong>REMOTE_FOLDER</strong> : R&eacute;pertoire distant o&ugrave; les fichiers doivent &ecirc;tre t&eacute;l&eacute;charg&eacute;s, d&eacute;fini par repertoire.getChemin(), avec comme valeur par d&eacute;faut<strong> /remote/incoming/ (configurable)</strong>.</p><p><strong>LOCAL_FOLDER</strong> : R&eacute;pertoire local o&ugrave; les fichiers t&eacute;l&eacute;charg&eacute;s sont stock&eacute;s, d&eacute;fini par repertoire.getPartenaire(), avec comme valeur par d&eacute;faut <strong>/var/data/sftp_download</strong>.</p><p><strong>REMOTE_FILE_EXTENSION</strong> : Extension des fichiers &agrave; consid&eacute;rer pour le t&eacute;l&eacute;chargement, d&eacute;finie par repertoire.getExtension(), avec comme valeur par d&eacute;faut <strong>*</strong>.</p><p><strong>SFTP_CONN_VIA_KEY</strong> : Indique si la connexion SFTP doit se faire via une cl&eacute; priv&eacute;e, avec comme valeur par d&eacute;faut <strong>false</strong>.</p><p><strong>SFTP_TIME_ALIVE</strong> : Temps d'attente pour la connexion SFTP, avec une valeur par d&eacute;faut de <strong>300000 ms</strong>.</p><p><strong>PREFERRED_AUTH_SFTP</strong> : M&eacute;thode d'authentification pr&eacute;f&eacute;r&eacute;e pour SFTP, par d&eacute;faut <strong>password</strong>.</p><p><strong>SFTP_OLD_ALGOS</strong> : Indique si des algorithmes plus anciens doivent &ecirc;tre utilis&eacute;s pour la connexion, avec comme valeur par d&eacute;faut <strong>false</strong>.</p><p><strong>Exemples d'Utilisation</strong></p><p>Utilis&eacute;e pour automatiser le t&eacute;l&eacute;chargement s&eacute;curis&eacute; de fichiers depuis des serveurs SFTP dans un environnement d'entreprise.</p><p><strong>Int&eacute;gration avec d'autres Syst&egrave;mes</strong></p><p>Int&eacute;gr&eacute;e avec les syst&egrave;mes de gestion de fichiers pour assurer un t&eacute;l&eacute;chargement s&eacute;curis&eacute; et fiable des fichiers.</p>