<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache CompteBulkReader est utilis&eacute;e pour lire et traiter les fichiers contenant des informations de comptes bancaires, en effectuant des op&eacute;rations de suppression et d'insertion en masse sur ces comptes dans la base de donn&eacute;es.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.comptes</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers de comptes dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit chaque ligne du fichier pour extraire les informations de comptes bancaires.</p><p>Supprime tous les comptes existants dans la base de donn&eacute;es avant d'ins&eacute;rer les nouveaux comptes extraits du fichier.</p><p>Utilise des transactions en lot pour ins&eacute;rer les comptes dans la base de donn&eacute;es.</p><p><strong>R&eacute;sultat</strong> : Les comptes bancaires sont supprim&eacute;s et r&eacute;ins&eacute;r&eacute;s dans la base de donn&eacute;es selon les instructions du fichier.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de traitement sont consign&eacute;es dans les journaux pour un suivi ult&eacute;rieur.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Utilise LineIterator pour lire chaque ligne du fichier et extraire les informations n&eacute;cessaires.</p><p><strong>Gestion des Comptes</strong> :</p><p>Supprime tous les comptes existants dans la base de donn&eacute;es.</p><p>Ins&egrave;re les nouveaux comptes extraits du fichier.</p><p><strong>Interaction avec la Base de Donn&eacute;es</strong> :</p><p>Utilise DataBaseJPA pour ex&eacute;cuter des requ&ecirc;tes SQL et g&eacute;rer les transactions de base de donn&eacute;es.</p><p>Utilise des transactions en lot pour optimiser l'insertion des comptes.</p><p><strong>Gestion des Erreurs</strong> : Consigne les erreurs de validation et de traitement dans les journaux.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>S&eacute;parateur de Fichier de Compte</strong> : Utilise un s&eacute;parateur de fichier configurable pour analyser les lignes du fichier.</p><p>Cette fiche technique inclut les fonctionnalit&eacute;s principales de la classe CompteBulkReader, en mettant l'accent sur le processus de lecture, de gestion des comptes et d'interaction avec la base de donn&eacute;es.</p>