<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache ImalChequeObject est un mod&egrave;le de donn&eacute;es utilis&eacute; pour repr&eacute;senter les informations d'un ch&egrave;que dans le contexte du syst&egrave;me IMAL. Elle est con&ccedil;ue pour &ecirc;tre s&eacute;rialis&eacute;e en JSON, facilitant ainsi l'&eacute;change de donn&eacute;es entre les syst&egrave;mes.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.forimal</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Repr&eacute;senter les informations d'un ch&egrave;que de mani&egrave;re structur&eacute;e pour l'int&eacute;gration avec le syst&egrave;me IMAL.</p><p><strong>Traitement</strong> :</p><p>Fournit des getters et setters pour acc&eacute;der et modifier les attributs du ch&egrave;que.</p><p>Utilise l'annotation @JsonInclude pour exclure les champs null lors de la s&eacute;rialisation JSON.</p><p><strong>Attributs</strong></p><p><strong>accountNumberFrom</strong> : Num&eacute;ro de compte de l'&eacute;metteur du ch&egrave;que.</p><p><strong>accountNumberTo</strong> : Num&eacute;ro de compte du b&eacute;n&eacute;ficiaire du ch&egrave;que.</p><p><strong>amount</strong> : Montant du ch&egrave;que.</p><p><strong>benef_name</strong> : Nom du b&eacute;n&eacute;ficiaire.</p><p><strong>chq_number</strong> : Num&eacute;ro du ch&egrave;que.</p><p><strong>chq_date</strong> : Date du ch&egrave;que.</p><p><strong>recto</strong> : Image ou information du recto du ch&egrave;que.</p><p><strong>verso</strong> : Image ou information du verso du ch&egrave;que.</p><p><strong>trs_no</strong> : Num&eacute;ro de transaction associ&eacute; au ch&egrave;que.</p><p><strong>micr</strong> : Code MICR du ch&egrave;que.</p><p><strong>M&eacute;thodes</strong></p><p><strong>ImalChequeObject()</strong> : Constructeur par d&eacute;faut.</p><p><strong>Getters et Setters</strong> : Pour chaque attribut, permettant l'acc&egrave;s et la modification des valeurs.</p><p><strong>toString()</strong> : Retourne une repr&eacute;sentation en cha&icirc;ne de caract&egrave;res de l'objet, incluant tous ses attributs.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>Aucun param&egrave;tre sp&eacute;cifique mentionn&eacute;</strong> : La tache est un mod&egrave;le de donn&eacute;es et ne d&eacute;pend pas de param&egrave;tres externes pour son fonctionnement. Elle est con&ccedil;ue pour &ecirc;tre utilis&eacute;e dans des contextes o&ugrave; les donn&eacute;es de ch&egrave;que doivent &ecirc;tre &eacute;chang&eacute;es avec le syst&egrave;me IMAL ou d'autres syst&egrave;mes compatibles JSON.</p><p><strong>Remarques</strong></p><p><strong>S&eacute;rialisation JSON</strong> : La tache est configur&eacute;e pour exclure les champs null lors de la conversion en JSON, ce qui est utile pour r&eacute;duire la taille des donn&eacute;es &eacute;chang&eacute;es et &eacute;viter les valeurs ind&eacute;sirables.</p><p><strong>Extensibilit&eacute;</strong> : La tache peut &ecirc;tre &eacute;tendue pour inclure des attributs suppl&eacute;mentaires si n&eacute;cessaire pour d'autres int&eacute;grations ou fonctionnalit&eacute;s.</p><p><strong>Int&eacute;gration</strong> : Con&ccedil;ue pour &ecirc;tre utilis&eacute;e dans des contextes o&ugrave; les donn&eacute;es de ch&egrave;que doivent &ecirc;tre &eacute;chang&eacute;es avec le syst&egrave;me IMAL ou d'autres syst&egrave;mes compatibles JSON.</p>