<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache MAILOToIMGIReader est utilis&eacute;e pour lire et traiter les fichiers MAILO, en particulier pour renommer ces fichiers selon un format sp&eacute;cifique bas&eacute; sur des r&egrave;gles de nommage pr&eacute;d&eacute;finies.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.readers.ampup</p><p><strong>Description Fonctionnelle</strong></p><p><strong>D&eacute;clenchement</strong> : Activ&eacute;e lors de la d&eacute;tection de nouveaux fichiers MAILO dans le r&eacute;pertoire configur&eacute;.</p><p><strong>Traitement</strong> :</p><p>Lit le fichier pour extraire les informations n&eacute;cessaires &agrave; partir de son nom.</p><p>D&eacute;termine le code de la banque destinataire et g&eacute;n&egrave;re un nouveau nom de fichier bas&eacute; sur ce code et d'autres param&egrave;tres.</p><p>Renomme le fichier selon le format requis.</p><p><strong>R&eacute;sultat</strong> : Le fichier est renomm&eacute; et pr&ecirc;t &agrave; &ecirc;tre utilis&eacute; dans les processus suivants.</p><p><strong>En cas d&rsquo;erreur</strong> : Les erreurs de renommage sont consign&eacute;es dans les journaux et une notification d'erreur est affich&eacute;e si possible.</p><p><strong>Op&eacute;rations Cl&eacute;s</strong></p><p><strong>Lecture des Fichiers</strong> : Analyse le nom du fichier pour extraire les informations n&eacute;cessaires.</p><p><strong>G&eacute;n&eacute;ration de Noms</strong> : Utilise des m&eacute;thodes utilitaires pour g&eacute;n&eacute;rer un nouveau nom de fichier bas&eacute; sur le code de la banque destinataire et d'autres param&egrave;tres.</p><p><strong>Renommage des Fichiers</strong> : Renomme le fichier avec le nouveau nom g&eacute;n&eacute;r&eacute;. G&egrave;re les erreurs de renommage en affichant des notifications et en lan&ccedil;ant des exceptions.</p><p><strong>Param&egrave;tres du Composant</strong></p><p><strong>CODE_BANQUE_SICA3</strong> : Code de la banque utilis&eacute; pour d&eacute;terminer le type de fichier &agrave; g&eacute;n&eacute;rer, avec comme valeur par d&eacute;faut: <strong>CI160</strong>.</p><p><strong>DATECOMPENS_NAT</strong> et <strong>DATECOMPENS_SRG</strong> : Dates utilis&eacute;es pour calculer les s&eacute;quences de fichiers nationaux et r&eacute;gionaux respectivement.</p><p>Cette fiche technique inclut les fonctionnalit&eacute;s principales de la classe MAILOToIMGIReader, en mettant l'accent sur le processus de renommage des fichiers et la gestion des erreurs associ&eacute;es.</p>