<p /><p><strong>Introduction</strong></p><p><strong>Description</strong> : La tache MailiSFDWriter est une extension de FlatFileWriter utilis&eacute;e pour orchestrer la g&eacute;n&eacute;ration des fichiers MAILI vers la banque. Elle utilise deux autres classes, MailiNatSFDWriter et MailiSrgSFDWriter, pour g&eacute;rer respectivement les fichiers nationaux et sous-r&eacute;gionaux.</p><p><strong>Package</strong></p><p><strong>Emplacement</strong> : sas.action.writers.corporates.sfd.sica</p><p><strong>Description Fonctionnelle</strong></p><p><strong>Objectif</strong> : Orchestrer la g&eacute;n&eacute;ration des fichiers MAILI pour les envois vers la banque, en combinant les fichiers nationaux et sous-r&eacute;gionaux.</p><p><strong>Traitement</strong> :</p><p>Initialise les instances de MailiNatSFDWriter et MailiSrgSFDWriter.</p><p>Ex&eacute;cute la g&eacute;n&eacute;ration des fichiers pour les deux types de transactions (nationales et sous-r&eacute;gionales).</p><p>Met &agrave; jour la description du processus pour inclure les r&eacute;sultats des deux op&eacute;rations.</p><p><strong>Attributs</strong></p><p><strong>mailiNatSFDWriter</strong> : MailiNatSFDWriter - Instance utilis&eacute;e pour g&eacute;rer la g&eacute;n&eacute;ration des fichiers nationaux.</p><p><strong>mailiSrgSFDWriter</strong> : MailiSrgSFDWriter - Instance utilis&eacute;e pour g&eacute;rer la g&eacute;n&eacute;ration des fichiers sous-r&eacute;gionaux.</p><p><strong>M&eacute;thodes</strong></p><p><strong>MailiSFDWriter()</strong> : Constructeur par d&eacute;faut qui initialise les instances de MailiNatSFDWriter et MailiSrgSFDWriter et d&eacute;finit la description du processus.</p><p><strong>execute()</strong> : Ex&eacute;cute le processus de g&eacute;n&eacute;ration des fichiers MAILI, en appelant les m&eacute;thodes execute() des instances mailiNatSFDWriter et mailiSrgSFDWriter, et met &agrave; jour la description du processus avec les r&eacute;sultats.</p><p><strong>Composants Internes</strong></p><p><strong>MailiNatSFDWriter, MailiSrgSFDWriter</strong> : Classes utilis&eacute;es pour g&eacute;rer respectivement les fichiers nationaux et sous-r&eacute;gionaux.</p><p><strong>Param&egrave;tres Utilis&eacute;s</strong></p><p><strong>Parameters Map</strong> : Utilis&eacute; pour passer les param&egrave;tres de configuration aux instances de MailiNatSFDWriter et MailiSrgSFDWriter.</p><p><strong>Remarques</strong></p><p><strong>Gestion des Erreurs</strong> : Les erreurs lors de la g&eacute;n&eacute;ration des fichiers sont g&eacute;r&eacute;es par les classes MailiNatSFDWriter et MailiSrgSFDWriter.</p><p><strong>Extensibilit&eacute;</strong> : La classe est con&ccedil;ue pour &ecirc;tre facilement extensible pour inclure d'autres types de transactions ou formats de fichiers.</p><p><strong>Configuration</strong> : La classe utilise une map de param&egrave;tres pour configurer les instances de MailiNatSFDWriter et MailiSrgSFDWriter, permettant une adaptation facile aux besoins sp&eacute;cifiques du syst&egrave;me.</p><p><strong>Coordination</strong> : La classe MailiSFDWriter coordonne la g&eacute;n&eacute;ration des fichiers MAILI pour les transactions nationales et sous-r&eacute;gionales, assurant une gestion efficace des transferts vers la banque.</p>