<h1>PARAMETRAGE DE LA PERSONNALISATION DE LA BANQUE</h1><h3>Introduction</h3><p>Ce param&eacute;trage permet de <strong>personnaliser l&rsquo;identit&eacute; visuelle et les messages d&rsquo;accueil</strong> de l&rsquo;application bancaire. Il est utilis&eacute; pour adapter l&rsquo;exp&eacute;rience utilisateur aux sp&eacute;cificit&eacute;s de la banque d&eacute;ployant la solution SmartAccess. Ces param&egrave;tres influencent directement l&rsquo;apparence de l&rsquo;interface utilisateur ainsi que les premiers &eacute;l&eacute;ments de communication affich&eacute;s &agrave; l&rsquo;ouverture de l&rsquo;application.</p><p>Ils jouent un r&ocirc;le essentiel dans la coh&eacute;rence de l&rsquo;image de marque et dans la clart&eacute; des &eacute;changes avec l&rsquo;utilisateur final.</p><hr /><h3>Nom de la banque</h3><h4><strong>APP_NAME_IN_BANK</strong></h4><ul><li><p><strong>Valeur :</strong> <code>smartaccess</code></p></li><li><p><strong>Libell&eacute; par d&eacute;faut:</strong> <code>BGFICLEARING</code></p></li><li><p><strong>Type :</strong> <code>CODE_PARAMS</code></p></li><li><p><strong>Description :</strong> Ce param&egrave;tre permet de d&eacute;finir le <strong>nom de l'application bancaire tel qu&rsquo;il doit appara&icirc;tre dans l&rsquo;interface</strong>. Par exemple, bien que l&rsquo;application soit g&eacute;n&eacute;rique (<code>smartaccess</code>), elle peut &ecirc;tre personnalis&eacute;e pour afficher le nom sp&eacute;cifique de la banque, ici <code>BGFICLEARING</code>. Cela renforce la personnalisation de l&rsquo;outil pour chaque client institutionnel.</p></li></ul><hr /><h3>Message de bienvenue</h3><h4><strong>WELCOME_MESSAGE</strong></h4><ul><li><p><strong>Valeur par d&eacute;faut :</strong> <code>Connectez-vous &agrave;</code></p></li><li><p><strong>Libell&eacute; :</strong> Message de bienvenue</p></li><li><p><strong>Type :</strong> <code>CODE_PARAMS</code></p></li><li><p><strong>Description :</strong> Ce param&egrave;tre d&eacute;finit le <strong>texte affich&eacute; lors de la connexion initiale</strong> &agrave; l'application. Il s&rsquo;agit d&rsquo;un message d&rsquo;accueil ou d&rsquo;invitation &agrave; se connecter. Ce message peut &ecirc;tre personnalis&eacute; pour refl&eacute;ter le ton et le style de communication de la banque.</p></li></ul><hr /><p>Ces param&egrave;tres permettent d&rsquo;<strong>adapter dynamiquement l&rsquo;identit&eacute; visuelle et textuelle</strong> de l&rsquo;application selon la banque cliente, sans n&eacute;cessiter de modification dans le code source. Cela favorise une r&eacute;utilisabilit&eacute; optimale de la plateforme pour plusieurs entit&eacute;s bancaires.</p>