<h1>PARAMETRAGE DES POINTS D&rsquo;ACCES A LA COMPENSATION</h1><h3><strong>Introduction</strong></h3><p>Ce param&eacute;trage permet de configurer les points d&rsquo;acc&egrave;s utilis&eacute;s par l&rsquo;application pour transmettre les op&eacute;rations de compensation bancaire, que ce soit au niveau <strong>sous-r&eacute;gional</strong> ou <strong>national</strong>. Ces param&egrave;tres sont essentiels pour diriger correctement les flux de compensation vers les syst&egrave;mes correspondants (comme SICA-UEMOA pour la sous-r&eacute;gion). Ils assurent la conformit&eacute; des op&eacute;rations de r&egrave;glement avec les standards des autorit&eacute;s mon&eacute;taires et facilitent une meilleure gestion des circuits interbancaires.</p><p>Les points d&rsquo;acc&egrave;s sont d&eacute;finis en fonction de la localisation g&eacute;ographique et du type de compensation, afin de garantir un traitement efficace, structur&eacute; et automatis&eacute; des op&eacute;rations financi&egrave;res.</p><hr /><h3><strong>Point d&rsquo;acc&egrave;s &agrave; la compensation sous-r&eacute;gionale</strong></h3><ul><li><p><strong>Nom du param&egrave;tre</strong> : <code>PAC_SCSR_SICA3</code></p></li><li><p><strong>Valeur par d&eacute;faut</strong> : <code>CI0</code></p></li><li><p><strong>Libell&eacute;</strong> : POINT D&rsquo;ACC&Egrave;S &Agrave; LA COMPENSATION SOUS-R&Eacute;GIONALE</p></li><li><p><strong>Type</strong> : <code>CODE_PAC</code></p></li></ul><p><strong>Description</strong> :<br />Ce param&egrave;tre indique le point d&rsquo;acc&egrave;s technique utilis&eacute; pour acheminer les op&eacute;rations vers la plateforme de compensation sous-r&eacute;gionale, g&eacute;n&eacute;ralement SICA-UEMOA. La valeur <code>CI0</code> correspond au code du point d&rsquo;acc&egrave;s configur&eacute; pour la C&ocirc;te d&rsquo;Ivoire dans le cadre de la compensation sous-r&eacute;gionale.<br />Il permet de diriger les flux interbancaires qui concernent plusieurs pays membres de l&rsquo;Union vers l&rsquo;infrastructure r&eacute;gionale appropri&eacute;e. Ce point d&rsquo;acc&egrave;s est essentiel pour toutes les transactions transfrontali&egrave;res dans la zone UEMOA.</p><hr /><h3><strong>Point d&rsquo;acc&egrave;s &agrave; la compensation nationale</strong></h3><ul><li><p><strong>Nom du param&egrave;tre</strong> : <code>PAC_SCMP_SICA3</code></p></li><li><p><strong>Valeur par d&eacute;faut</strong> : <code>CI1</code></p></li><li><p><strong>Libell&eacute;</strong> : Point d&rsquo;acc&egrave;s &agrave; la compensation nationale</p></li><li><p><strong>Type</strong> : <code>CODE_PAC</code></p></li></ul><p><strong>Description</strong> :<br />Ce param&egrave;tre d&eacute;finit le point d&rsquo;acc&egrave;s r&eacute;serv&eacute; aux op&eacute;rations de compensation trait&eacute;es uniquement au <strong>niveau national</strong>. La valeur <code>CI1</code> est associ&eacute;e &agrave; la C&ocirc;te d&rsquo;Ivoire pour la compensation locale.<br />Il permet de s&eacute;parer les flux domestiques des flux sous-r&eacute;gionaux, en dirigeant les op&eacute;rations vers l&rsquo;infrastructure d&eacute;di&eacute;e &agrave; la gestion des &eacute;changes interbancaires internes. Ce point d&rsquo;acc&egrave;s est particuli&egrave;rement utile pour optimiser le traitement des ch&egrave;ques, virements ou autres moyens de paiement destin&eacute;s aux &eacute;tablissements locaux.</p>