<h1>PARAMETRAGE DU CODE BANQUE PROPRIETAIRE</h1><h3><strong>Introduction</strong></h3><p>Ce param&eacute;trage permet de sp&eacute;cifier le code d&rsquo;identification de la banque dans les syst&egrave;mes de compensation et dans les &eacute;changes interbancaires. Il est essentiel pour assurer une identification unique et correcte de la banque lors des traitements automatis&eacute;s, que ce soit pour les op&eacute;rations nationales ou sous-r&eacute;gionales.<br />Les syst&egrave;mes comme SICA (Syst&egrave;me Interbancaire de Compensation Automatis&eacute;) exigent que chaque &eacute;tablissement participant dispose d&rsquo;un code unique et conforme aux normes d&eacute;finies par les autorit&eacute;s mon&eacute;taires.</p><hr /><h3><strong>Code Banque dans le syst&egrave;me SICA3</strong></h3><ul><li><p><strong>Nom du param&egrave;tre</strong> : <code>CODE_BANQUE_SICA3</code></p></li><li><p><strong>Valeur par d&eacute;faut</strong> : <code>SN140</code></p></li><li><p><strong>Libell&eacute;</strong> : Code Banque Propri&eacute;taire</p></li><li><p><strong>Type</strong> : <code>CODE_BANQUE</code></p></li></ul><p><strong>Description</strong> :<br />Ce param&egrave;tre repr&eacute;sente le code unique attribu&eacute; &agrave; la banque dans le syst&egrave;me de compensation sous-r&eacute;gionale SICA3. La valeur <code>SN140</code> identifie l&rsquo;&eacute;tablissement bancaire au sein de cette infrastructure r&eacute;gionale.<br />Ce code est utilis&eacute; dans tous les &eacute;changes et r&egrave;glements interbancaires transitant par la plateforme SICA, assurant ainsi une tra&ccedil;abilit&eacute; et une bonne reconnaissance de la banque par les autres institutions financi&egrave;res.</p><hr /><h3><strong>Code Banque (g&eacute;n&eacute;ral)</strong></h3><ul><li><p><strong>Nom du param&egrave;tre</strong> : <code>CODE_BANQUE</code></p></li><li><p><strong>Valeur par d&eacute;faut</strong> : <code>SN140</code></p></li><li><p><strong>Libell&eacute;</strong> : Code Banque Propri&eacute;taire</p></li><li><p><strong>Type</strong> : <code>CODE_BANQUE</code></p></li></ul><p><strong>Description</strong> :<br />Ce param&egrave;tre d&eacute;signe le code d&rsquo;identification g&eacute;n&eacute;ral de la banque dans les diff&eacute;rents syst&egrave;mes de traitement bancaire internes et externes. Il est utilis&eacute; &agrave; travers l&rsquo;ensemble des modules de l&rsquo;application pour repr&eacute;senter l&rsquo;entit&eacute; bancaire propri&eacute;taire de la plateforme.<br />Le code <code>SN140</code> est utilis&eacute; comme identifiant principal de la banque dans les op&eacute;rations internes, les &eacute;changes de fichiers, les rapports, et les interfaces avec d&rsquo;autres syst&egrave;mes tiers.</p>