<h1>PARAMETRAGE POUR  L&rsquo;ENDOS GRAPHIQUE</h1><h3>Introduction</h3><p>Ce param&eacute;trage permet de configurer les informations n&eacute;cessaires &agrave; l&rsquo;application du cachet graphique (image d&rsquo;endossement) sur les ch&egrave;ques. Ces param&egrave;tres sont utilis&eacute;s par les composants charg&eacute;s du traitement ou de l&rsquo;impression des documents bancaires. Ils assurent que l&rsquo;image du cachet est positionn&eacute;e avec pr&eacute;cision &agrave; l&rsquo;endroit souhait&eacute; sur le ch&egrave;que, conform&eacute;ment aux exigences de pr&eacute;sentation de l&rsquo;agence.</p><p>Pour fonctionner correctement, le moteur graphique utilis&eacute; par l&rsquo;application doit disposer du chemin vers l&rsquo;image &agrave; ins&eacute;rer, ainsi que des coordonn&eacute;es X et Y pour positionner cette image sur le document.</p><p><strong><span style="color: rgb(7,71,166);">Endos graphique corporate</span></strong></p><h4><strong>Introduction</strong></h4><p>L&rsquo;application offre la possibilit&eacute; d&rsquo;apposer un cachet graphique (image d&rsquo;endossement) sur les ch&egrave;ques lors de leur traitement. Cette fonctionnalit&eacute; repose sur trois param&egrave;tres fondamentaux d&eacute;finis sous le type CODE_PARAMS. Ils permettent de configurer le chemin de l&rsquo;image utilis&eacute;e ainsi que son positionnement pr&eacute;cis sur le ch&egrave;que.</p><p>Ces r&eacute;glages garantissent une pr&eacute;sentation homog&egrave;ne et conforme aux exigences visuelles de l&rsquo;&eacute;tablissement bancaire.</p><hr /><h3><strong>Chemin de l&rsquo;image du cachet</strong></h3><p><strong>Nom du param&egrave;tre : </strong>AGENCE_TATTOO_PIC<br /><strong>Valeur par d&eacute;faut :</strong> C:/smartaccess/cachets/EndoCheque.jpg<br /><strong>Libell&eacute; : </strong>Chemin o&ugrave; se trouve l&rsquo;endos ch&egrave;que<br /><strong>Type : </strong>CODE_PARAMS</p><p><strong>Description :</strong><br />Ce param&egrave;tre indique le chemin absolu vers l&rsquo;image &agrave; utiliser comme cachet sur le ch&egrave;que. L&rsquo;application acc&egrave;de &agrave; cette ressource pour la superposer au document lors de l&rsquo;impression ou du traitement num&eacute;rique.<br />Le chemin doit &ecirc;tre valide et accessible par le syst&egrave;me d&rsquo;exploitation h&ocirc;te pour garantir un fonctionnement sans erreur.</p><hr /><h3><strong>Position verticale de l&rsquo;image</strong></h3><p><strong>Nom du param&egrave;tre : </strong>TATTOOIMG_Y<br /><strong>Valeur par d&eacute;faut : </strong>100<br /><strong>Libell&eacute; : </strong>Position verticale du cachet<br /><strong>Type : </strong>CODE_PARAMS</p><p><strong>Description :</strong><br />Sp&eacute;cifie la coordonn&eacute;e Y (verticale) &agrave; laquelle l&rsquo;image du cachet sera plac&eacute;e sur le ch&egrave;que. Cette position permet d&rsquo;ajuster le cachet dans une zone pr&eacute;cise, tout en respectant les normes de marquage.<br />L&rsquo;unit&eacute; est exprim&eacute;e en pixels ou en points selon le moteur graphique utilis&eacute;.</p><hr /><h3><strong>Position horizontale de l&rsquo;image</strong></h3><p><strong>Nom du param&egrave;tre : </strong>TATTOOIMG_X<br /><strong>Valeur par d&eacute;faut : </strong>100<br /><strong>Libell&eacute; : </strong>Position horizontale du cachet<br /><strong>Type : </strong>CODE_PARAMS</p><p><strong>Description :</strong><br />D&eacute;termine la coordonn&eacute;e X (horizontale) de l&rsquo;image du cachet. Ce param&egrave;tre permet d&rsquo;ancrer l&rsquo;image &agrave; un emplacement sp&eacute;cifique sur le ch&egrave;que pour un rendu pr&eacute;cis et esth&eacute;tique.<br />Une mauvaise configuration de cette valeur peut entra&icirc;ner un chevauchement ou une mauvaise lisibilit&eacute; du cachet.</p><hr /><h3><strong>Conclusion</strong></h3><p>Ces trois param&egrave;tres sont essentiels pour assurer l&rsquo;application automatique, conforme et normalis&eacute;e du cachet graphique sur les ch&egrave;ques.<br />Toute modification de ces valeurs doit faire l&rsquo;objet de tests rigoureux afin de garantir que la lisibilit&eacute; du document et la conformit&eacute; aux standards graphiques de l&rsquo;&eacute;tablissement sont pr&eacute;serv&eacute;es.</p><p><strong><span style="color: rgb(7,71,166);">Endos graphique &ldquo;compens&eacute; le&rdquo;</span></strong></p><h3>Introduction</h3><p>L&rsquo;endos graphique &ldquo;Compens&eacute; le&rdquo; repose sur un ensemble de param&egrave;tres essentiels d&eacute;finis dans le syst&egrave;me sous le type <code>CODE_PARAMS</code>. Ces param&egrave;tres permettent &agrave; l&rsquo;application de positionner et d&rsquo;appliquer automatiquement un cachet (image ou texte) sur les ch&egrave;ques, avec une grande pr&eacute;cision.<br />Ce m&eacute;canisme garantit l&rsquo;uniformit&eacute; visuelle et la conformit&eacute; des ch&egrave;ques endoss&eacute;s selon les exigences des institutions bancaires.</p><h3>Param&egrave;tres de configuration</h3><hr /><p><strong>Nom du param&egrave;tre : TATOO_PICTURE</strong><br /><strong>Valeur par d&eacute;faut :</strong> true<br /><strong>Libell&eacute; :</strong> Flocage du texte<br /><strong>Type :</strong> CODE_PARAMS</p><p><strong>Description :</strong><br />Ce param&egrave;tre active l&rsquo;incrustation (flocage) automatique du texte &ldquo;Compens&eacute; le&rdquo; sur le ch&egrave;que. Si la valeur est <code>true</code>, le cachet est appliqu&eacute; automatiquement.</p><hr /><p><strong>Nom du param&egrave;tre : TATOO_PRE_TEXT</strong><br /><strong>Valeur par d&eacute;faut :</strong> ECOBANK SN, COMPENS&Eacute; LE<br /><strong>Libell&eacute; :</strong> Texte affich&eacute; sur l&rsquo;endos du ch&egrave;que<br /><strong>Type :</strong> CODE_PARAMS</p><p><strong>Description :</strong><br />D&eacute;finit le contenu du texte qui sera affich&eacute; sur le ch&egrave;que. Il est g&eacute;n&eacute;ralement compos&eacute; du nom de la banque suivi de la mention &ldquo;COMPENS&Eacute; LE&rdquo;.</p><hr /><p><strong>Nom du param&egrave;tre : TATOO_STYLE</strong><br /><strong>Valeur par d&eacute;faut :</strong> Arial-BOLD-12<br /><strong>Libell&eacute; :</strong> Style de la police du texte<br /><strong>Type :</strong> CODE_PARAMS</p><p><strong>Description :</strong><br />Sp&eacute;cifie le style typographique utilis&eacute; pour le texte endoss&eacute;. Cela inclut la police, le poids (gras) et la taille.</p><hr /><p><strong>Nom du param&egrave;tre : TATOO_FOR_SEE</strong><br /><strong>Valeur par d&eacute;faut :</strong> OUI<br /><strong>Libell&eacute; :</strong> Visualisation<br /><strong>Type :</strong> CODE_PARAMS</p><p><strong>Description :</strong><br />Permet d&rsquo;activer l&rsquo;option de visualisation du cachet &ldquo;compens&eacute; le&rdquo; avant impression. Si la valeur est <code>OUI</code>, un aper&ccedil;u est disponible.</p><hr /><p><strong>Nom du param&egrave;tre : TATOO_X</strong><br /><strong>Valeur par d&eacute;faut :</strong> 100<br /><strong>Libell&eacute; :</strong> Position horizontale du cachet<br /><strong>Type :</strong> CODE_PARAMS</p><p><strong>Description :</strong><br />D&eacute;finit la position horizontale (coordonn&eacute;e X) &agrave; laquelle le cachet sera appliqu&eacute; sur le ch&egrave;que. L&rsquo;unit&eacute; est exprim&eacute;e en pixels ou en points selon le moteur d&rsquo;impression.</p><hr /><p><strong>Nom du param&egrave;tre : TATOO_Y</strong><br /><strong>Valeur par d&eacute;faut :</strong> 250<br /><strong>Libell&eacute; :</strong> Position verticale du cachet<br /><strong>Type :</strong> CODE_PARAMS</p><p><strong>Description :</strong><br />Sp&eacute;cifie la position verticale (coordonn&eacute;e Y) de l&rsquo;endos sur le ch&egrave;que, permettant un positionnement exact du texte ou de l&rsquo;image.</p><hr /><h3>Conclusion</h3><p>Ces param&egrave;tres agissent ensemble pour assurer que le cachet &ldquo;compens&eacute; le&rdquo; est appliqu&eacute; &agrave; l&rsquo;emplacement exact pr&eacute;vu sur chaque ch&egrave;que, selon un format coh&eacute;rent et conforme aux standards de l&rsquo;agence. Ce syst&egrave;me permet &eacute;galement un ajustement rapide sans modification du code source, renfor&ccedil;ant la souplesse op&eacute;rationnelle.</p><p /><p>&nbsp;</p>