<h1>PARAMETRAGE DE L&rsquo;AD</h1><p /><h4>Connexion &agrave; l&rsquo;Active Directory &ndash; Mode Simple (LDAP)</h4><h3>Introduction</h3><p>Ce param&eacute;trage permet de configurer l&rsquo;authentification des utilisateurs via un annuaire Active Directory en mode standard (LDAP). Il est utilis&eacute; dans les institutions bancaires souhaitant centraliser la gestion des identifiants utilisateurs sans recourir &agrave; une authentification locale.<br />Cette configuration est particuli&egrave;rement adapt&eacute;e aux environnements d&rsquo;entreprise o&ugrave; la s&eacute;curit&eacute;, la tra&ccedil;abilit&eacute; et la gestion unifi&eacute;e des comptes sont des priorit&eacute;s. Le param&eacute;trage permet de modifier dynamiquement les param&egrave;tres de connexion sans intervention dans le code source.</p><h3>Param&egrave;tres de la connexion AD</h3><p><strong>Nom du param&egrave;tre : AD_FOREST_SEARCH</strong><br />Valeur : <a href="http://BSICBANK.CI">BSICBANK.CI</a><br />Libell&eacute; : Base de Recherche AD<br />Type : CODE_PARAMS</p><p><strong>Description :</strong><br />Ce param&egrave;tre sp&eacute;cifie le domaine Active Directory &agrave; utiliser pour les recherches d&rsquo;utilisateurs. Il s&rsquo;agit de la base &agrave; partir de laquelle les comptes seront interrog&eacute;s dans l&rsquo;AD.</p><hr /><p><strong>Nom du param&egrave;tre : AD_CONN_ID</strong><br />Valeur : SMART<br />Libell&eacute; : Utilisateur de connexion AD<br />Type : CODE_PARAMS</p><p><strong>Description :</strong><br />D&eacute;finit l&rsquo;identifiant de l&rsquo;utilisateur technique utilis&eacute; pour &eacute;tablir la connexion entre l&rsquo;application et le serveur Active Directory.</p><hr /><p><strong>Nom du param&egrave;tre : AD_CONN_PASSWORD</strong><br />Valeur : [crypt&eacute;]<br />Libell&eacute; : Mot de passe user AD<br />Type : CODE_CRYPTED</p><p><strong>Description :</strong><br />Contient le mot de passe chiffr&eacute; de l&rsquo;utilisateur technique (d&eacute;fini par <code>AD_CONN_ID</code>). Ce mot de passe est requis pour s&rsquo;authentifier aupr&egrave;s de l&rsquo;Active Directory.</p><hr /><p><strong>Nom du param&egrave;tre : AD_HOST</strong><br />Valeur : Adresse IP du serveur<br />Libell&eacute; : Adresse IP AD<br />Type : CODE_PARAMS</p><p><strong>Description :</strong><br />Sp&eacute;cifie l&rsquo;adresse IP du contr&ocirc;leur de domaine AD avec lequel l&rsquo;application doit &eacute;tablir la communication pour l&rsquo;authentification LDAP.</p><hr /><p><strong>Nom du param&egrave;tre : LDAP_CONNECTION</strong><br />Valeur : OUI<br />Libell&eacute; : Connexion &agrave; un Annuaire pour l'authentification<br />Type : CODE_PARAMS</p><p><strong>Description :</strong><br />Active ou d&eacute;sactive l&rsquo;utilisation de l&rsquo;annuaire AD via le protocole LDAP. Si la valeur est d&eacute;finie &agrave; OUI, l&rsquo;application interrogera l&rsquo;AD pour authentifier les utilisateurs.</p><hr /><p><strong>Nom du param&egrave;tre : EXTERNAL_USER_CONNECTION</strong><br />Valeur : OUI / NON / (absent)<br />Type : CODE_PARAMS</p><p><strong>Description :</strong><br />Contr&ocirc;le la source d&rsquo;authentification des utilisateurs :</p><ul><li><p>Si OUI : l&rsquo;authentification passe par une source externe comme l&rsquo;AD.</p></li><li><p>Si NON : l&rsquo;authentification est locale, via la base de donn&eacute;es de l&rsquo;application.</p></li><li><p>Si le param&egrave;tre est absent : l&rsquo;application utilise par d&eacute;faut la base de donn&eacute;es locale.</p></li></ul><hr /><h2>Connexion &agrave; l&rsquo;Active Directory &ndash; Mode API avec Token</h2><h3>Introduction</h3><p>Dans certains environnements, l&rsquo;authentification via LDAP direct peut &ecirc;tre remplac&eacute;e par une API s&eacute;curis&eacute;e utilisant un syst&egrave;me de jetons. Cette m&eacute;thode repose sur un service interm&eacute;diaire qui s&rsquo;occupe de la validation des identifiants en communiquant avec l&rsquo;Active Directory via des protocoles modernes d&rsquo;authentification. Ce mode est utile pour des architectures distribu&eacute;es ou cloud, ou lorsqu&rsquo;un acc&egrave;s direct &agrave; l&rsquo;AD n&rsquo;est pas possible.</p><h3>Param&egrave;tres de la connexion AD via API</h3><p><strong>Nom du param&egrave;tre : AD_AUTH_SERV_TOKEN</strong><br />Valeur : OUI<br />Libell&eacute; : Connexion AD et TOKEN<br />Type : CODE_PARAMS</p><p><strong>Description :</strong><br />Active la connexion &agrave; l&rsquo;annuaire Active Directory via une API externe s&eacute;curis&eacute;e par jeton (token). Lorsque ce param&egrave;tre est activ&eacute;, l&rsquo;application ne passe plus par LDAP mais par un service distant.</p><hr /><p><strong>Nom du param&egrave;tre : AD_AUTH_SERV_TOKEN_TEST</strong><br />Valeur : OUI<br />Libell&eacute; : Connexion AD et TOKEN test<br />Type : CODE_PARAMS</p><p><strong>Description :</strong><br />Permet d&rsquo;activer la connexion AD via jeton pour un environnement de test ou de pr&eacute;production. Ce param&egrave;tre facilite la validation fonctionnelle avant mise en production.</p>