<p /><h4><strong>Introduction</strong></h4><p>Ce document d&eacute;crit le param&eacute;trage n&eacute;cessaire pour permettre le <strong>transfert de fichiers entre SmartACCESS et un serveur distant</strong>, en utilisant l&rsquo;un des protocoles de transfert s&eacute;curis&eacute;s suivants :<br /><strong>SFTP (Secure File Transfer Protocol)</strong>, <strong>FTP (File Transfer Protocol)</strong> ou <strong>FTPS (FTP Secure)</strong>.</p><p>Les transferts peuvent s&rsquo;effectuer :</p><ul><li><p><strong>Depuis SmartACCESS vers un serveur distant</strong> (export de fichiers),</p></li><li><p><strong>Depuis un serveur distant vers SmartACCESS</strong> (import de fichiers).</p></li></ul><p>Ces &eacute;changes sont g&eacute;n&eacute;ralement utilis&eacute;s pour l&rsquo;automatisation de processus m&eacute;tiers tels que l&rsquo;import de donn&eacute;es, l&rsquo;export de rapports ou l&rsquo;archivage de fichiers.</p><hr /><h2><strong>Objectifs des T&acirc;ches de Transfert</strong></h2><p>Les t&acirc;ches de transfert permettent de :</p><ul><li><p><strong>&Eacute;tablir une connexion automatis&eacute;e et s&eacute;curis&eacute;e</strong> entre SmartACCESS et un serveur distant,</p></li><li><p><strong>Transmettre ou r&eacute;cup&eacute;rer des fichiers</strong> &agrave; intervalles r&eacute;guliers selon une planification d&eacute;finie,</p></li><li><p><strong>Int&eacute;grer les fichiers dans des processus internes</strong> (import en base, traitement, archivage),</p></li><li><p><strong>Maintenir un historique ou des logs de transfert</strong> pour audit et supervision.</p></li></ul><hr /><h2><strong>Conditions Pr&eacute;alables</strong></h2><p>Pour garantir le bon fonctionnement des transferts, les &eacute;l&eacute;ments suivants doivent &ecirc;tre configur&eacute;s :</p><ol start="1"><li><p><strong>Connexion r&eacute;seau active et s&eacute;curis&eacute;e</strong> entre SmartACCESS et le serveur distant (acc&egrave;s direct, VPN, pare-feu ouvert sur les ports n&eacute;cessaires).</p></li><li><p><strong>Informations de connexion valides</strong>, selon le protocole choisi :</p><ul><li><p>Nom d&rsquo;utilisateur et mot de passe,</p></li><li><p>Ou cl&eacute; SSH dans le cas de SFTP.</p></li></ul></li><li><p><strong>Param&egrave;tres de transfert</strong> &agrave; sp&eacute;cifier :</p><ul><li><p>Adresse IP ou nom d&rsquo;h&ocirc;te du serveur distant,</p></li><li><p>Port de communication (par d&eacute;faut : 22 pour SFTP, 21 pour FTP/FTPS),</p></li><li><p>Chemins des r&eacute;pertoires source et destination (c&ocirc;t&eacute; SmartACCESS et serveur distant),</p></li><li><p>Sens du transfert (envoi ou r&eacute;ception),</p></li><li><p>Fr&eacute;quence des transferts et planification horaire.</p></li></ul></li><li><p><strong>Gestion post-transfert</strong> :</p><ul><li><p>Suppression, archivage ou renommage des fichiers apr&egrave;s envoi ou r&eacute;ception,</p></li><li><p>Traitement des erreurs ou fichiers en doublon.</p></li></ul></li></ol><hr /><h2><strong>D&eacute;finitions des Protocoles</strong></h2><ul><li><p><strong>SFTP (Secure File Transfer Protocol)</strong> : Protocole s&eacute;curis&eacute; bas&eacute; sur SSH. Il offre un chiffrement complet des donn&eacute;es et des m&eacute;tadonn&eacute;es &eacute;chang&eacute;es.</p></li><li><p><strong>FTP (File Transfer Protocol)</strong> : Protocole standard, non chiffr&eacute;, &agrave; utiliser uniquement en environnement de confiance.</p></li><li><p><strong>FTPS (FTP Secure)</strong> : Variante s&eacute;curis&eacute;e du FTP utilisant les protocoles SSL/TLS pour s&eacute;curiser la transmission des donn&eacute;es.</p></li></ul><p>Ces param&eacute;trages sont r&eacute;alis&eacute;s &agrave; partir de <strong>t&acirc;ches configur&eacute;es dans SmartACCESS</strong>.</p>