<h1>PARAMETRAGE DU PASSAGE D&rsquo;UN CHEQUE EN SBF OU A L&rsquo;ENCAISSEMENT</h1><h2>Introduction</h2><p style="margin-left: 30.0px;">Ce param&eacute;trage permet de contr&ocirc;ler le comportement de l&rsquo;application lors de la validation d&rsquo;une remise de ch&egrave;ques, en d&eacute;finissant si les ch&egrave;ques doivent &ecirc;tre automatiquement pass&eacute;s <strong>&agrave; l&rsquo;encaissement</strong> ou <strong>en SBF (Sauf bonne fin)</strong>.<br />Il s&rsquo;agit d&rsquo;un m&eacute;canisme flexible permettant aux &eacute;tablissements financiers de s&rsquo;adapter &agrave; leurs proc&eacute;dures internes sans n&eacute;cessit&eacute; de modifier le code source. Le param&egrave;tre associ&eacute; permet de choisir dynamiquement le mode de traitement souhait&eacute; pour les ch&egrave;ques d&eacute;pos&eacute;s par les clients.</p><hr /><h2>Mode de traitement des ch&egrave;ques</h2><p><strong>Nom du param&egrave;tre :</strong> SHOW_SBF_AE</p><p><strong>Valeur par d&eacute;faut :</strong> OUI</p><p><strong>Libell&eacute; :</strong> Affiche les m&eacute;thodes passer un cheque en SBF , a&nbsp; l'encaissement dans le menu de Validation des Remises</p><p><strong>Type :</strong> CODE_PARAMS</p><p><strong>Description :</strong><br />Ce param&egrave;tre d&eacute;termine la m&eacute;thode de traitement appliqu&eacute;e aux ch&egrave;ques au moment de leur validation dans le menu <strong>Validation des Remises</strong>.</p><ul><li><p>Si la valeur est <strong>ENCAISSEMENT</strong>, les ch&egrave;ques sont directement trait&eacute;s comme encaiss&eacute;s. Cela signifie qu&rsquo;ils suivent le circuit standard sans retenue particuli&egrave;re, conform&eacute;ment aux d&eacute;lais usuels d&rsquo;encaissement.</p></li><li><p>Si la valeur est <strong>SBF</strong>, les ch&egrave;ques sont enregistr&eacute;s sous forme de cr&eacute;ances conditionnelles. Le montant est cr&eacute;dit&eacute; de mani&egrave;re pr&eacute;visionnelle, sous r&eacute;serve de bonne fin, avec des r&egrave;gles de disponibilit&eacute;s sp&eacute;cifiques.</p></li></ul><p>Ce m&eacute;canisme permet de refl&eacute;ter fid&egrave;lement les politiques de gestion de risque et les processus internes de traitement des ch&egrave;ques propres &agrave; chaque institution. Le changement de mode peut &ecirc;tre op&eacute;r&eacute; simplement en modifiant la valeur du param&egrave;tre dans le syst&egrave;me.</p><p /><p />