<h1 style="margin-left: 30.0px;">PARAMETRAGE POUR LA RECUPERATION DES COMPTES</h1><p /><h4><strong>Introduction</strong></h4><p>Ce param&eacute;trage permet de d&eacute;finir les modalit&eacute;s d&rsquo;acc&egrave;s aux comptes des clients dans le syst&egrave;me bancaire. Il oriente le comportement de l&rsquo;application quant &agrave; la source de v&eacute;rit&eacute; des informations de comptes : soit en local (base de donn&eacute;es propre &agrave; l&rsquo;application), soit via des appels API vers le Core Banking System (CBS).</p><p>Ces param&egrave;tres sont essentiels pour garantir l&rsquo;int&eacute;gration fluide et s&eacute;curis&eacute;e entre l&rsquo;interface utilisateur et le syst&egrave;me bancaire central, en tenant compte des choix d&rsquo;architecture de chaque banque cliente.</p><hr /><h4><strong>Acc&egrave;s local &agrave; la base des comptes</strong></h4><ul><li><p><strong>Nom du param&egrave;tre</strong> : <code>LOCAL_BASE_COMPTE</code></p></li><li><p><strong>Valeur par d&eacute;faut</strong> : <code>OUI</code></p></li><li><p><strong>Libell&eacute;</strong> : LOCAL BASE COMPTE</p></li><li><p><strong>Type</strong> : <code>CODE_PARAMS</code></p></li></ul><p><strong>Description</strong> :<br />Ce param&egrave;tre indique si l&rsquo;application doit acc&eacute;der aux comptes des clients &agrave; partir d&rsquo;une base de donn&eacute;es locale (<code>OUI</code>) ou non (<code>NON</code>). Lorsqu&rsquo;il est activ&eacute;, l&rsquo;application interroge une base interne pour r&eacute;cup&eacute;rer les informations des comptes. Cela peut &ecirc;tre utile en mode d&eacute;connect&eacute; ou en cas d&rsquo;absence d&rsquo;int&eacute;gration directe avec le syst&egrave;me bancaire central.</p><hr /><h4><strong>Acc&egrave;s aux comptes via une API (Core Banking)</strong></h4><ul><li><p><strong>Nom du param&egrave;tre</strong> : <code>FETCH_COMPTE_SERVICE</code></p></li><li><p><strong>Valeur par d&eacute;faut</strong> : <code>OUI</code></p></li><li><p><strong>Libell&eacute;</strong> : FETCH_COMPTE_SERVICE</p></li><li><p><strong>Type</strong> : <code>CODE_PARAMS</code></p></li></ul><p><strong>Description</strong> :<br />Ce param&egrave;tre contr&ocirc;le l&rsquo;activation de la r&eacute;cup&eacute;ration des comptes via une API expos&eacute;e par le Core Banking System. Lorsqu&rsquo;il est &agrave; <code>OUI</code>, l&rsquo;application interagit directement avec le syst&egrave;me bancaire central pour r&eacute;cup&eacute;rer les comptes &agrave; jour et valid&eacute;s, assurant une synchronisation en temps r&eacute;el. Cela garantit une meilleure coh&eacute;rence des donn&eacute;es, en particulier pour les op&eacute;rations sensibles ou complexes.</p><hr /><h4><strong>Syst&egrave;me bancaire principal</strong></h4><ul><li><p><strong>Nom du param&egrave;tre</strong> : <code>CORE_SYSTEM</code></p></li><li><p><strong>Valeur par d&eacute;faut</strong> : <code>AMPLITUDE</code></p></li><li><p><strong>Libell&eacute;</strong> : Core Banking system</p></li><li><p><strong>Type</strong> : <code>CODE_PARAMS</code></p></li></ul><p><strong>Description</strong> :<br />Ce param&egrave;tre sp&eacute;cifie le nom du Core Banking System utilis&eacute; par la banque. Ici, la valeur <code>AMPLITUDE</code> indique que l&rsquo;infrastructure bancaire principale repose sur le syst&egrave;me AMPLITUDE. Cette information peut &ecirc;tre exploit&eacute;e par l&rsquo;application pour adapter dynamiquement certains comportements ou int&eacute;grations selon le CBS en place.</p>