<h2><strong>Introduction</strong></h2><p>Ce document d&eacute;crit le param&eacute;trage n&eacute;cessaire au sein de <strong>SmartACCESS</strong> pour le <strong>traitement automatis&eacute; des fichiers issus des scanners de ch&egrave;ques et d&rsquo;effets bancaires</strong>, dans le cadre des op&eacute;rations de <strong>compensation interbancaire</strong>.</p><p>Les documents scann&eacute;s (images et donn&eacute;es associ&eacute;es) doivent &ecirc;tre correctement identifi&eacute;s, class&eacute;s et pr&eacute;par&eacute;s en vue de leur int&eacute;gration dans les processus de compensation, conform&eacute;ment aux normes et formats d&eacute;finis par les autorit&eacute;s bancaires.</p><hr /><h2><strong>Objectifs du traitement des fichiers scann&eacute;s</strong></h2><p>Le syst&egrave;me permet de :</p><ul><li><p><strong>Surveiller les r&eacute;pertoires de d&eacute;p&ocirc;t des fichiers g&eacute;n&eacute;r&eacute;s par les scanners</strong>,</p></li><li><p><strong>D&eacute;tecter automatiquement les nouveaux lots de fichiers</strong> &agrave; traiter (images recto/verso, fichiers de donn&eacute;es structur&eacute;es &ndash; type XML, TXT, etc.),</p></li><li><p><strong>Valider et transformer les fichiers selon les formats d&rsquo;&eacute;change exig&eacute;s</strong> (ex : norme BCEAO, SEPA, etc.),</p></li><li><p><strong>Transmettre les lots conformes au syst&egrave;me de compensation</strong>,</p></li><li><p><strong>Archiver les fichiers trait&eacute;s</strong> et g&eacute;n&eacute;rer les journaux de suivi.</p></li></ul><hr /><h2><strong>Conditions pr&eacute;alables</strong></h2><p>Avant toute mise en &oelig;uvre, les &eacute;l&eacute;ments suivants doivent &ecirc;tre disponibles et correctement configur&eacute;s :</p><ol start="1"><li><p><strong>R&eacute;pertoires surveill&eacute;s</strong> : dossiers de r&eacute;ception des fichiers en provenance des scanners de ch&egrave;ques/effets.</p></li><li><p><strong>Structure des fichiers attendue</strong> :</p><ul><li><p>Images scann&eacute;es (g&eacute;n&eacute;ralement au format TIFF ou JPEG),</p></li><li><p>Fichiers de donn&eacute;es (souvent au format CSV, XML ou texte plat) contenant les m&eacute;tadonn&eacute;es (montant, n&deg; de ch&egrave;que, banque &eacute;mettrice, etc.).</p></li></ul></li><li><p><strong>Conventions de nommage</strong> et d'organisation des fichiers (ex. : un dossier par lot, pr&eacute;fixes de fichiers, etc.).</p></li><li><p><strong>Acc&egrave;s s&eacute;curis&eacute;</strong> aux r&eacute;pertoires (droits en lecture/&eacute;criture par le service SmartACCESS).</p></li><li><p><strong>Correspondance entre les types de fichiers et les traitements &agrave; appliquer</strong> :</p><ul><li><p>Association &agrave; des sc&eacute;narios sp&eacute;cifiques (ex. : traitement_ch&egrave;ques, traitement_effets),</p></li><li><p>D&eacute;tection d&rsquo;anomalies (images manquantes, doublons, incoh&eacute;rences de format ou de contenu).</p></li></ul></li></ol><hr /><h2><strong>&Eacute;tapes de param&eacute;trage</strong></h2><ol start="1"><li><p><strong>Configuration des r&eacute;pertoires d&rsquo;entr&eacute;e</strong> dans SmartACCESS (chemin r&eacute;seau, fr&eacute;quence de balayage).</p></li><li><p><strong>D&eacute;finition des mod&egrave;les de traitement</strong> :</p><ul><li><p>R&egrave;gles de validation syntaxique et m&eacute;tier,</p></li><li><p>Contr&ocirc;les d&rsquo;int&eacute;grit&eacute; (pr&eacute;sence des fichiers recto/verso, concordance avec les m&eacute;tadonn&eacute;es),</p></li><li><p>Traitements correctifs &eacute;ventuels (exclusion, renvoi en erreur, renommage).</p></li></ul></li><li><p><strong>Transformation des donn&eacute;es</strong> vers le format requis pour la compensation (ex. : encapsulation dans un fichier XML normalis&eacute; ou une archive ZIP).</p></li><li><p><strong>Archivage et tra&ccedil;abilit&eacute;</strong> :</p><ul><li><p>D&eacute;placement des fichiers trait&eacute;s vers un r&eacute;pertoire d&rsquo;archives,</p></li><li><p>Enregistrement des logs d&eacute;taill&eacute;s (op&eacute;rations r&eacute;ussies, erreurs, avertissements).</p></li></ul></li><li><p><strong>Transmission au syst&egrave;me de compensation</strong> (via SFTP ou autre connecteur interbancaire, si int&eacute;gr&eacute; dans la cha&icirc;ne).</p></li></ol><p /><p>Ces param&eacute;trages sont r&eacute;alis&eacute;s &agrave; partir de <strong>t&acirc;ches configur&eacute;es dans SmartACCESS</strong>.</p>